espressif/esp-idf/components/soc/esp32s31/register/soc/hp_sys_clkrst_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** HP_SYS_CLKRST_SOC_CLK_SEL_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_SOC_CLK_SEL_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x0)
/** HP_SYS_CLKRST_REG_SOC_CLK_SEL : R/W; bitpos: [1:0]; default: 0;
 *  Configures to select the clock source of HP_ROOT_CLK.
 *  0 (default): XTAL_CLK
 *  1: PLL_F300M_CLK
 *  2: RC_FAST_CLK
 */
#define HP_SYS_CLKRST_REG_SOC_CLK_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_SOC_CLK_SEL_M  (HP_SYS_CLKRST_REG_SOC_CLK_SEL_V << HP_SYS_CLKRST_REG_SOC_CLK_SEL_S)
#define HP_SYS_CLKRST_REG_SOC_CLK_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_SOC_CLK_SEL_S  0

/** HP_SYS_CLKRST_CPU_FREQ_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_CPU_FREQ_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x4)
/** HP_SYS_CLKRST_REG_CPU_CLK_DIV_NUM : R/W; bitpos: [7:0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CPU_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_CPU_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_CPU_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_CPU_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_CPU_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_CPU_CLK_DIV_NUM_S  0
/** HP_SYS_CLKRST_REG_CPU_CLK_DIV_NUMERATOR : R/W; bitpos: [10:8]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CPU_CLK_DIV_NUMERATOR    0x00000007U
#define HP_SYS_CLKRST_REG_CPU_CLK_DIV_NUMERATOR_M  (HP_SYS_CLKRST_REG_CPU_CLK_DIV_NUMERATOR_V << HP_SYS_CLKRST_REG_CPU_CLK_DIV_NUMERATOR_S)
#define HP_SYS_CLKRST_REG_CPU_CLK_DIV_NUMERATOR_V  0x00000007U
#define HP_SYS_CLKRST_REG_CPU_CLK_DIV_NUMERATOR_S  8
/** HP_SYS_CLKRST_REG_CPU_CLK_DIV_DENOMINATOR : R/W; bitpos: [13:11]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CPU_CLK_DIV_DENOMINATOR    0x00000007U
#define HP_SYS_CLKRST_REG_CPU_CLK_DIV_DENOMINATOR_M  (HP_SYS_CLKRST_REG_CPU_CLK_DIV_DENOMINATOR_V << HP_SYS_CLKRST_REG_CPU_CLK_DIV_DENOMINATOR_S)
#define HP_SYS_CLKRST_REG_CPU_CLK_DIV_DENOMINATOR_V  0x00000007U
#define HP_SYS_CLKRST_REG_CPU_CLK_DIV_DENOMINATOR_S  11

/** HP_SYS_CLKRST_MEM_FREQ_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_MEM_FREQ_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x8)
/** HP_SYS_CLKRST_REG_MEM_CLK_DIV_NUM : R/W; bitpos: [0]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_MEM_CLK_DIV_NUM    (BIT(0))
#define HP_SYS_CLKRST_REG_MEM_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_MEM_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_MEM_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_MEM_CLK_DIV_NUM_V  0x00000001U
#define HP_SYS_CLKRST_REG_MEM_CLK_DIV_NUM_S  0

/** HP_SYS_CLKRST_SYS_FREQ_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_SYS_FREQ_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0xc)
/** HP_SYS_CLKRST_REG_SYS_CLK_DIV_NUM : R/W; bitpos: [7:0]; default: 2;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_SYS_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_SYS_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_SYS_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_SYS_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_SYS_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_SYS_CLK_DIV_NUM_S  0
/** HP_SYS_CLKRST_REG_SYS_CLK_DIV_NUMERATOR : R/W; bitpos: [10:8]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_SYS_CLK_DIV_NUMERATOR    0x00000007U
#define HP_SYS_CLKRST_REG_SYS_CLK_DIV_NUMERATOR_M  (HP_SYS_CLKRST_REG_SYS_CLK_DIV_NUMERATOR_V << HP_SYS_CLKRST_REG_SYS_CLK_DIV_NUMERATOR_S)
#define HP_SYS_CLKRST_REG_SYS_CLK_DIV_NUMERATOR_V  0x00000007U
#define HP_SYS_CLKRST_REG_SYS_CLK_DIV_NUMERATOR_S  8
/** HP_SYS_CLKRST_REG_SYS_CLK_DIV_DENOMINATOR : R/W; bitpos: [13:11]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_SYS_CLK_DIV_DENOMINATOR    0x00000007U
#define HP_SYS_CLKRST_REG_SYS_CLK_DIV_DENOMINATOR_M  (HP_SYS_CLKRST_REG_SYS_CLK_DIV_DENOMINATOR_V << HP_SYS_CLKRST_REG_SYS_CLK_DIV_DENOMINATOR_S)
#define HP_SYS_CLKRST_REG_SYS_CLK_DIV_DENOMINATOR_V  0x00000007U
#define HP_SYS_CLKRST_REG_SYS_CLK_DIV_DENOMINATOR_S  11

/** HP_SYS_CLKRST_APB_FREQ_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_APB_FREQ_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x10)
/** HP_SYS_CLKRST_REG_APB_CLK_DIV_NUM : R/W; bitpos: [7:0]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_APB_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_APB_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_APB_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_APB_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_APB_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_APB_CLK_DIV_NUM_S  0
/** HP_SYS_CLKRST_REG_APB_CLK_DIV_NUMERATOR : R/W; bitpos: [10:8]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_APB_CLK_DIV_NUMERATOR    0x00000007U
#define HP_SYS_CLKRST_REG_APB_CLK_DIV_NUMERATOR_M  (HP_SYS_CLKRST_REG_APB_CLK_DIV_NUMERATOR_V << HP_SYS_CLKRST_REG_APB_CLK_DIV_NUMERATOR_S)
#define HP_SYS_CLKRST_REG_APB_CLK_DIV_NUMERATOR_V  0x00000007U
#define HP_SYS_CLKRST_REG_APB_CLK_DIV_NUMERATOR_S  8
/** HP_SYS_CLKRST_REG_APB_CLK_DIV_DENOMINATOR : R/W; bitpos: [13:11]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_APB_CLK_DIV_DENOMINATOR    0x00000007U
#define HP_SYS_CLKRST_REG_APB_CLK_DIV_DENOMINATOR_M  (HP_SYS_CLKRST_REG_APB_CLK_DIV_DENOMINATOR_V << HP_SYS_CLKRST_REG_APB_CLK_DIV_DENOMINATOR_S)
#define HP_SYS_CLKRST_REG_APB_CLK_DIV_DENOMINATOR_V  0x00000007U
#define HP_SYS_CLKRST_REG_APB_CLK_DIV_DENOMINATOR_S  11

/** HP_SYS_CLKRST_ROOT_CLK_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_ROOT_CLK_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x14)
/** HP_SYS_CLKRST_REG_SOC_CLK_UPDATE : R/W/WTC; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_SOC_CLK_UPDATE    (BIT(0))
#define HP_SYS_CLKRST_REG_SOC_CLK_UPDATE_M  (HP_SYS_CLKRST_REG_SOC_CLK_UPDATE_V << HP_SYS_CLKRST_REG_SOC_CLK_UPDATE_S)
#define HP_SYS_CLKRST_REG_SOC_CLK_UPDATE_V  0x00000001U
#define HP_SYS_CLKRST_REG_SOC_CLK_UPDATE_S  0

/** HP_SYS_CLKRST_CPU_WFI_DELAY_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_CPU_WFI_DELAY_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x18)
/** HP_SYS_CLKRST_REG_CPUICM_DELAY_NUM : R/W; bitpos: [3:0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CPUICM_DELAY_NUM    0x0000000FU
#define HP_SYS_CLKRST_REG_CPUICM_DELAY_NUM_M  (HP_SYS_CLKRST_REG_CPUICM_DELAY_NUM_V << HP_SYS_CLKRST_REG_CPUICM_DELAY_NUM_S)
#define HP_SYS_CLKRST_REG_CPUICM_DELAY_NUM_V  0x0000000FU
#define HP_SYS_CLKRST_REG_CPUICM_DELAY_NUM_S  0

