espressif/esp-idf/components/soc/esp32s31/register/soc/hp_sys_clkrst_reg.h
/** HP_SYS_CLKRST_HPCORE0_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_HPCORE0_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x1c)
/** HP_SYS_CLKRST_REG_CORE0_CLIC_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CORE0_CLIC_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_CORE0_CLIC_CLK_EN_M  (HP_SYS_CLKRST_REG_CORE0_CLIC_CLK_EN_V << HP_SYS_CLKRST_REG_CORE0_CLIC_CLK_EN_S)
#define HP_SYS_CLKRST_REG_CORE0_CLIC_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CORE0_CLIC_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_CORE0_CPU_CLK_EN : R/W; bitpos: [1]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CORE0_CPU_CLK_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_CORE0_CPU_CLK_EN_M  (HP_SYS_CLKRST_REG_CORE0_CPU_CLK_EN_V << HP_SYS_CLKRST_REG_CORE0_CPU_CLK_EN_S)
#define HP_SYS_CLKRST_REG_CORE0_CPU_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CORE0_CPU_CLK_EN_S  1
/** HP_SYS_CLKRST_REG_CORE0_GLOBAL_RST_EN : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CORE0_GLOBAL_RST_EN    (BIT(2))
#define HP_SYS_CLKRST_REG_CORE0_GLOBAL_RST_EN_M  (HP_SYS_CLKRST_REG_CORE0_GLOBAL_RST_EN_V << HP_SYS_CLKRST_REG_CORE0_GLOBAL_RST_EN_S)
#define HP_SYS_CLKRST_REG_CORE0_GLOBAL_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CORE0_GLOBAL_RST_EN_S  2
/** HP_SYS_CLKRST_REG_CORE0_FORCE_NORST : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CORE0_FORCE_NORST    (BIT(3))
#define HP_SYS_CLKRST_REG_CORE0_FORCE_NORST_M  (HP_SYS_CLKRST_REG_CORE0_FORCE_NORST_V << HP_SYS_CLKRST_REG_CORE0_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_CORE0_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_CORE0_FORCE_NORST_S  3

/** HP_SYS_CLKRST_HPCORE1_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_HPCORE1_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x20)
/** HP_SYS_CLKRST_REG_CORE1_CLIC_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CORE1_CLIC_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_CORE1_CLIC_CLK_EN_M  (HP_SYS_CLKRST_REG_CORE1_CLIC_CLK_EN_V << HP_SYS_CLKRST_REG_CORE1_CLIC_CLK_EN_S)
#define HP_SYS_CLKRST_REG_CORE1_CLIC_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CORE1_CLIC_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_CORE1_CPU_CLK_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CORE1_CPU_CLK_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_CORE1_CPU_CLK_EN_M  (HP_SYS_CLKRST_REG_CORE1_CPU_CLK_EN_V << HP_SYS_CLKRST_REG_CORE1_CPU_CLK_EN_S)
#define HP_SYS_CLKRST_REG_CORE1_CPU_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CORE1_CPU_CLK_EN_S  1
/** HP_SYS_CLKRST_REG_CORE1_GLOBAL_RST_EN : R/W; bitpos: [2]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CORE1_GLOBAL_RST_EN    (BIT(2))
#define HP_SYS_CLKRST_REG_CORE1_GLOBAL_RST_EN_M  (HP_SYS_CLKRST_REG_CORE1_GLOBAL_RST_EN_V << HP_SYS_CLKRST_REG_CORE1_GLOBAL_RST_EN_S)
#define HP_SYS_CLKRST_REG_CORE1_GLOBAL_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CORE1_GLOBAL_RST_EN_S  2
/** HP_SYS_CLKRST_REG_CORE1_FORCE_NORST : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CORE1_FORCE_NORST    (BIT(3))
#define HP_SYS_CLKRST_REG_CORE1_FORCE_NORST_M  (HP_SYS_CLKRST_REG_CORE1_FORCE_NORST_V << HP_SYS_CLKRST_REG_CORE1_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_CORE1_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_CORE1_FORCE_NORST_S  3

/** HP_SYS_CLKRST_TRACE_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_TRACE_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x24)
/** HP_SYS_CLKRST_REG_TRACE_CPU_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TRACE_CPU_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_TRACE_CPU_CLK_EN_M  (HP_SYS_CLKRST_REG_TRACE_CPU_CLK_EN_V << HP_SYS_CLKRST_REG_TRACE_CPU_CLK_EN_S)
#define HP_SYS_CLKRST_REG_TRACE_CPU_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TRACE_CPU_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_TRACE_SYS_CLK_EN : R/W; bitpos: [1]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TRACE_SYS_CLK_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_TRACE_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_TRACE_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_TRACE_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_TRACE_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TRACE_SYS_CLK_EN_S  1
/** HP_SYS_CLKRST_REG_TRACE_CPU_CLK_FORCE_ON : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TRACE_CPU_CLK_FORCE_ON    (BIT(2))
#define HP_SYS_CLKRST_REG_TRACE_CPU_CLK_FORCE_ON_M  (HP_SYS_CLKRST_REG_TRACE_CPU_CLK_FORCE_ON_V << HP_SYS_CLKRST_REG_TRACE_CPU_CLK_FORCE_ON_S)
#define HP_SYS_CLKRST_REG_TRACE_CPU_CLK_FORCE_ON_V  0x00000001U
#define HP_SYS_CLKRST_REG_TRACE_CPU_CLK_FORCE_ON_S  2
/** HP_SYS_CLKRST_REG_TRACE_SYS_CLK_FORCE_ON : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TRACE_SYS_CLK_FORCE_ON    (BIT(3))
#define HP_SYS_CLKRST_REG_TRACE_SYS_CLK_FORCE_ON_M  (HP_SYS_CLKRST_REG_TRACE_SYS_CLK_FORCE_ON_V << HP_SYS_CLKRST_REG_TRACE_SYS_CLK_FORCE_ON_S)
#define HP_SYS_CLKRST_REG_TRACE_SYS_CLK_FORCE_ON_V  0x00000001U
#define HP_SYS_CLKRST_REG_TRACE_SYS_CLK_FORCE_ON_S  3
/** HP_SYS_CLKRST_REG_TRACE0_RST_EN : R/W; bitpos: [4]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TRACE0_RST_EN    (BIT(4))
#define HP_SYS_CLKRST_REG_TRACE0_RST_EN_M  (HP_SYS_CLKRST_REG_TRACE0_RST_EN_V << HP_SYS_CLKRST_REG_TRACE0_RST_EN_S)
#define HP_SYS_CLKRST_REG_TRACE0_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TRACE0_RST_EN_S  4
/** HP_SYS_CLKRST_REG_TRACE1_RST_EN : R/W; bitpos: [5]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TRACE1_RST_EN    (BIT(5))
#define HP_SYS_CLKRST_REG_TRACE1_RST_EN_M  (HP_SYS_CLKRST_REG_TRACE1_RST_EN_V << HP_SYS_CLKRST_REG_TRACE1_RST_EN_S)
#define HP_SYS_CLKRST_REG_TRACE1_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TRACE1_RST_EN_S  5
/** HP_SYS_CLKRST_REG_TRACE0_FORCE_NORST : R/W; bitpos: [6]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TRACE0_FORCE_NORST    (BIT(6))
#define HP_SYS_CLKRST_REG_TRACE0_FORCE_NORST_M  (HP_SYS_CLKRST_REG_TRACE0_FORCE_NORST_V << HP_SYS_CLKRST_REG_TRACE0_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_TRACE0_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_TRACE0_FORCE_NORST_S  6
/** HP_SYS_CLKRST_REG_TRACE1_FORCE_NORST : R/W; bitpos: [7]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TRACE1_FORCE_NORST    (BIT(7))
#define HP_SYS_CLKRST_REG_TRACE1_FORCE_NORST_M  (HP_SYS_CLKRST_REG_TRACE1_FORCE_NORST_V << HP_SYS_CLKRST_REG_TRACE1_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_TRACE1_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_TRACE1_FORCE_NORST_S  7

