espressif/esp-idf/components/soc/esp32s31/register/soc/hp_sys_clkrst_reg.h
/** HP_SYS_CLKRST_TCM_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_TCM_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x28)
/** HP_SYS_CLKRST_REG_TCM_CPU_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TCM_CPU_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_TCM_CPU_CLK_EN_M  (HP_SYS_CLKRST_REG_TCM_CPU_CLK_EN_V << HP_SYS_CLKRST_REG_TCM_CPU_CLK_EN_S)
#define HP_SYS_CLKRST_REG_TCM_CPU_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TCM_CPU_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_TCM_CPU_CLK_FORCE_ON : R/W; bitpos: [1]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TCM_CPU_CLK_FORCE_ON    (BIT(1))
#define HP_SYS_CLKRST_REG_TCM_CPU_CLK_FORCE_ON_M  (HP_SYS_CLKRST_REG_TCM_CPU_CLK_FORCE_ON_V << HP_SYS_CLKRST_REG_TCM_CPU_CLK_FORCE_ON_S)
#define HP_SYS_CLKRST_REG_TCM_CPU_CLK_FORCE_ON_V  0x00000001U
#define HP_SYS_CLKRST_REG_TCM_CPU_CLK_FORCE_ON_S  1
/** HP_SYS_CLKRST_REG_TCM_RST_EN : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TCM_RST_EN    (BIT(2))
#define HP_SYS_CLKRST_REG_TCM_RST_EN_M  (HP_SYS_CLKRST_REG_TCM_RST_EN_V << HP_SYS_CLKRST_REG_TCM_RST_EN_S)
#define HP_SYS_CLKRST_REG_TCM_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TCM_RST_EN_S  2

/** HP_SYS_CLKRST_TCMMON_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_TCMMON_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x2c)
/** HP_SYS_CLKRST_REG_TCMMON_CPU_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TCMMON_CPU_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_TCMMON_CPU_CLK_EN_M  (HP_SYS_CLKRST_REG_TCMMON_CPU_CLK_EN_V << HP_SYS_CLKRST_REG_TCMMON_CPU_CLK_EN_S)
#define HP_SYS_CLKRST_REG_TCMMON_CPU_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TCMMON_CPU_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_TCMMON_SYS_CLK_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TCMMON_SYS_CLK_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_TCMMON_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_TCMMON_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_TCMMON_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_TCMMON_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TCMMON_SYS_CLK_EN_S  1
/** HP_SYS_CLKRST_REG_TCMMON_RST_EN : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TCMMON_RST_EN    (BIT(2))
#define HP_SYS_CLKRST_REG_TCMMON_RST_EN_M  (HP_SYS_CLKRST_REG_TCMMON_RST_EN_V << HP_SYS_CLKRST_REG_TCMMON_RST_EN_S)
#define HP_SYS_CLKRST_REG_TCMMON_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TCMMON_RST_EN_S  2
/** HP_SYS_CLKRST_REG_TCMMON_FORCE_NORST : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TCMMON_FORCE_NORST    (BIT(3))
#define HP_SYS_CLKRST_REG_TCMMON_FORCE_NORST_M  (HP_SYS_CLKRST_REG_TCMMON_FORCE_NORST_V << HP_SYS_CLKRST_REG_TCMMON_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_TCMMON_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_TCMMON_FORCE_NORST_S  3

/** HP_SYS_CLKRST_PSRAMMON_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_PSRAMMON_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x30)
/** HP_SYS_CLKRST_REG_PSRAM_MON_SYS_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PSRAM_MON_SYS_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_PSRAM_MON_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_PSRAM_MON_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_PSRAM_MON_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_PSRAM_MON_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PSRAM_MON_SYS_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_PSRAM_MON_RST_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PSRAM_MON_RST_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_PSRAM_MON_RST_EN_M  (HP_SYS_CLKRST_REG_PSRAM_MON_RST_EN_V << HP_SYS_CLKRST_REG_PSRAM_MON_RST_EN_S)
#define HP_SYS_CLKRST_REG_PSRAM_MON_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PSRAM_MON_RST_EN_S  1
/** HP_SYS_CLKRST_REG_PSRAM_MON_FORCE_NORST : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PSRAM_MON_FORCE_NORST    (BIT(2))
#define HP_SYS_CLKRST_REG_PSRAM_MON_FORCE_NORST_M  (HP_SYS_CLKRST_REG_PSRAM_MON_FORCE_NORST_V << HP_SYS_CLKRST_REG_PSRAM_MON_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_PSRAM_MON_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_PSRAM_MON_FORCE_NORST_S  2

/** HP_SYS_CLKRST_ROM_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_ROM_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x34)
/** HP_SYS_CLKRST_REG_ROM_MEM_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_ROM_MEM_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_ROM_MEM_CLK_EN_M  (HP_SYS_CLKRST_REG_ROM_MEM_CLK_EN_V << HP_SYS_CLKRST_REG_ROM_MEM_CLK_EN_S)
#define HP_SYS_CLKRST_REG_ROM_MEM_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_ROM_MEM_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_ROM_MEM_CLK_FORCE_ON : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_ROM_MEM_CLK_FORCE_ON    (BIT(1))
#define HP_SYS_CLKRST_REG_ROM_MEM_CLK_FORCE_ON_M  (HP_SYS_CLKRST_REG_ROM_MEM_CLK_FORCE_ON_V << HP_SYS_CLKRST_REG_ROM_MEM_CLK_FORCE_ON_S)
#define HP_SYS_CLKRST_REG_ROM_MEM_CLK_FORCE_ON_V  0x00000001U
#define HP_SYS_CLKRST_REG_ROM_MEM_CLK_FORCE_ON_S  1
/** HP_SYS_CLKRST_REG_ROM_RST_EN : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_ROM_RST_EN    (BIT(2))
#define HP_SYS_CLKRST_REG_ROM_RST_EN_M  (HP_SYS_CLKRST_REG_ROM_RST_EN_V << HP_SYS_CLKRST_REG_ROM_RST_EN_S)
#define HP_SYS_CLKRST_REG_ROM_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_ROM_RST_EN_S  2

/** HP_SYS_CLKRST_CACHE_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_CACHE_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x38)
/** HP_SYS_CLKRST_REG_CPU_ACACHE_CPU_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CPU_ACACHE_CPU_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_CPU_ACACHE_CPU_CLK_EN_M  (HP_SYS_CLKRST_REG_CPU_ACACHE_CPU_CLK_EN_V << HP_SYS_CLKRST_REG_CPU_ACACHE_CPU_CLK_EN_S)
#define HP_SYS_CLKRST_REG_CPU_ACACHE_CPU_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CPU_ACACHE_CPU_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_CPU_ACACHE_CPU_CLK_FORCE_ON : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CPU_ACACHE_CPU_CLK_FORCE_ON    (BIT(1))
#define HP_SYS_CLKRST_REG_CPU_ACACHE_CPU_CLK_FORCE_ON_M  (HP_SYS_CLKRST_REG_CPU_ACACHE_CPU_CLK_FORCE_ON_V << HP_SYS_CLKRST_REG_CPU_ACACHE_CPU_CLK_FORCE_ON_S)
#define HP_SYS_CLKRST_REG_CPU_ACACHE_CPU_CLK_FORCE_ON_V  0x00000001U
#define HP_SYS_CLKRST_REG_CPU_ACACHE_CPU_CLK_FORCE_ON_S  1
/** HP_SYS_CLKRST_REG_CPU_ACACHE_RST_EN : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CPU_ACACHE_RST_EN    (BIT(2))
#define HP_SYS_CLKRST_REG_CPU_ACACHE_RST_EN_M  (HP_SYS_CLKRST_REG_CPU_ACACHE_RST_EN_V << HP_SYS_CLKRST_REG_CPU_ACACHE_RST_EN_S)
#define HP_SYS_CLKRST_REG_CPU_ACACHE_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CPU_ACACHE_RST_EN_S  2
/** HP_SYS_CLKRST_REG_ROM_ACACHE_MEM_CLK_EN : R/W; bitpos: [3]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_ROM_ACACHE_MEM_CLK_EN    (BIT(3))
#define HP_SYS_CLKRST_REG_ROM_ACACHE_MEM_CLK_EN_M  (HP_SYS_CLKRST_REG_ROM_ACACHE_MEM_CLK_EN_V << HP_SYS_CLKRST_REG_ROM_ACACHE_MEM_CLK_EN_S)
#define HP_SYS_CLKRST_REG_ROM_ACACHE_MEM_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_ROM_ACACHE_MEM_CLK_EN_S  3
/** HP_SYS_CLKRST_REG_ROM_ACACHE_MEM_CLK_FORCE_ON : R/W; bitpos: [4]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_ROM_ACACHE_MEM_CLK_FORCE_ON    (BIT(4))
#define HP_SYS_CLKRST_REG_ROM_ACACHE_MEM_CLK_FORCE_ON_M  (HP_SYS_CLKRST_REG_ROM_ACACHE_MEM_CLK_FORCE_ON_V << HP_SYS_CLKRST_REG_ROM_ACACHE_MEM_CLK_FORCE_ON_S)
#define HP_SYS_CLKRST_REG_ROM_ACACHE_MEM_CLK_FORCE_ON_V  0x00000001U
#define HP_SYS_CLKRST_REG_ROM_ACACHE_MEM_CLK_FORCE_ON_S  4
/** HP_SYS_CLKRST_REG_ROM_ACACHE_RST_EN : R/W; bitpos: [5]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_ROM_ACACHE_RST_EN    (BIT(5))
#define HP_SYS_CLKRST_REG_ROM_ACACHE_RST_EN_M  (HP_SYS_CLKRST_REG_ROM_ACACHE_RST_EN_V << HP_SYS_CLKRST_REG_ROM_ACACHE_RST_EN_S)
#define HP_SYS_CLKRST_REG_ROM_ACACHE_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_ROM_ACACHE_RST_EN_S  5
/** HP_SYS_CLKRST_REG_CPU_CACHE_CPU_CLK_EN : R/W; bitpos: [6]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CPU_CACHE_CPU_CLK_EN    (BIT(6))
#define HP_SYS_CLKRST_REG_CPU_CACHE_CPU_CLK_EN_M  (HP_SYS_CLKRST_REG_CPU_CACHE_CPU_CLK_EN_V << HP_SYS_CLKRST_REG_CPU_CACHE_CPU_CLK_EN_S)
#define HP_SYS_CLKRST_REG_CPU_CACHE_CPU_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CPU_CACHE_CPU_CLK_EN_S  6
/** HP_SYS_CLKRST_REG_CPU_CACHE_CPU_CLK_FORCE_ON : R/W; bitpos: [7]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CPU_CACHE_CPU_CLK_FORCE_ON    (BIT(7))
#define HP_SYS_CLKRST_REG_CPU_CACHE_CPU_CLK_FORCE_ON_M  (HP_SYS_CLKRST_REG_CPU_CACHE_CPU_CLK_FORCE_ON_V << HP_SYS_CLKRST_REG_CPU_CACHE_CPU_CLK_FORCE_ON_S)
#define HP_SYS_CLKRST_REG_CPU_CACHE_CPU_CLK_FORCE_ON_V  0x00000001U
#define HP_SYS_CLKRST_REG_CPU_CACHE_CPU_CLK_FORCE_ON_S  7
/** HP_SYS_CLKRST_REG_CPU_CACHE_RST_EN : R/W; bitpos: [8]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CPU_CACHE_RST_EN    (BIT(8))
#define HP_SYS_CLKRST_REG_CPU_CACHE_RST_EN_M  (HP_SYS_CLKRST_REG_CPU_CACHE_RST_EN_V << HP_SYS_CLKRST_REG_CPU_CACHE_RST_EN_S)
#define HP_SYS_CLKRST_REG_CPU_CACHE_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CPU_CACHE_RST_EN_S  8
/** HP_SYS_CLKRST_REG_MSPI_CACHE_SYS_CLK_EN : R/W; bitpos: [9]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_MSPI_CACHE_SYS_CLK_EN    (BIT(9))
#define HP_SYS_CLKRST_REG_MSPI_CACHE_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_MSPI_CACHE_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_MSPI_CACHE_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_MSPI_CACHE_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_MSPI_CACHE_SYS_CLK_EN_S  9
/** HP_SYS_CLKRST_REG_MSPI_CACHE_SYS_CLK_FORCE_ON : R/W; bitpos: [10]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_MSPI_CACHE_SYS_CLK_FORCE_ON    (BIT(10))
#define HP_SYS_CLKRST_REG_MSPI_CACHE_SYS_CLK_FORCE_ON_M  (HP_SYS_CLKRST_REG_MSPI_CACHE_SYS_CLK_FORCE_ON_V << HP_SYS_CLKRST_REG_MSPI_CACHE_SYS_CLK_FORCE_ON_S)
#define HP_SYS_CLKRST_REG_MSPI_CACHE_SYS_CLK_FORCE_ON_V  0x00000001U
#define HP_SYS_CLKRST_REG_MSPI_CACHE_SYS_CLK_FORCE_ON_S  10
/** HP_SYS_CLKRST_REG_MSPI_CACHE_RST_EN : R/W; bitpos: [11]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_MSPI_CACHE_RST_EN    (BIT(11))
#define HP_SYS_CLKRST_REG_MSPI_CACHE_RST_EN_M  (HP_SYS_CLKRST_REG_MSPI_CACHE_RST_EN_V << HP_SYS_CLKRST_REG_MSPI_CACHE_RST_EN_S)
#define HP_SYS_CLKRST_REG_MSPI_CACHE_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_MSPI_CACHE_RST_EN_S  11
/** HP_SYS_CLKRST_REG_DCACHE_CLK_EN : R/W; bitpos: [12]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_DCACHE_CLK_EN    (BIT(12))
#define HP_SYS_CLKRST_REG_DCACHE_CLK_EN_M  (HP_SYS_CLKRST_REG_DCACHE_CLK_EN_V << HP_SYS_CLKRST_REG_DCACHE_CLK_EN_S)
#define HP_SYS_CLKRST_REG_DCACHE_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_DCACHE_CLK_EN_S  12
/** HP_SYS_CLKRST_REG_DCACHE_RST_EN : R/W; bitpos: [13]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_DCACHE_RST_EN    (BIT(13))
#define HP_SYS_CLKRST_REG_DCACHE_RST_EN_M  (HP_SYS_CLKRST_REG_DCACHE_RST_EN_V << HP_SYS_CLKRST_REG_DCACHE_RST_EN_S)
#define HP_SYS_CLKRST_REG_DCACHE_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_DCACHE_RST_EN_S  13
/** HP_SYS_CLKRST_REG_ICACHE0_CLK_EN : R/W; bitpos: [14]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_ICACHE0_CLK_EN    (BIT(14))
#define HP_SYS_CLKRST_REG_ICACHE0_CLK_EN_M  (HP_SYS_CLKRST_REG_ICACHE0_CLK_EN_V << HP_SYS_CLKRST_REG_ICACHE0_CLK_EN_S)
#define HP_SYS_CLKRST_REG_ICACHE0_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_ICACHE0_CLK_EN_S  14
/** HP_SYS_CLKRST_REG_ICACHE0_RST_EN : R/W; bitpos: [15]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_ICACHE0_RST_EN    (BIT(15))
#define HP_SYS_CLKRST_REG_ICACHE0_RST_EN_M  (HP_SYS_CLKRST_REG_ICACHE0_RST_EN_V << HP_SYS_CLKRST_REG_ICACHE0_RST_EN_S)
#define HP_SYS_CLKRST_REG_ICACHE0_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_ICACHE0_RST_EN_S  15
/** HP_SYS_CLKRST_REG_ICACHE1_CLK_EN : R/W; bitpos: [16]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_ICACHE1_CLK_EN    (BIT(16))
#define HP_SYS_CLKRST_REG_ICACHE1_CLK_EN_M  (HP_SYS_CLKRST_REG_ICACHE1_CLK_EN_V << HP_SYS_CLKRST_REG_ICACHE1_CLK_EN_S)
#define HP_SYS_CLKRST_REG_ICACHE1_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_ICACHE1_CLK_EN_S  16
/** HP_SYS_CLKRST_REG_ICACHE1_RST_EN : R/W; bitpos: [17]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_ICACHE1_RST_EN    (BIT(17))
#define HP_SYS_CLKRST_REG_ICACHE1_RST_EN_M  (HP_SYS_CLKRST_REG_ICACHE1_RST_EN_V << HP_SYS_CLKRST_REG_ICACHE1_RST_EN_S)
#define HP_SYS_CLKRST_REG_ICACHE1_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_ICACHE1_RST_EN_S  17

/** HP_SYS_CLKRST_ICM_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_ICM_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x3c)
/** HP_SYS_CLKRST_REG_ICM_CPU_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_ICM_CPU_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_ICM_CPU_CLK_EN_M  (HP_SYS_CLKRST_REG_ICM_CPU_CLK_EN_V << HP_SYS_CLKRST_REG_ICM_CPU_CLK_EN_S)
#define HP_SYS_CLKRST_REG_ICM_CPU_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_ICM_CPU_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_ICM_MEM_CLK_EN : R/W; bitpos: [1]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_ICM_MEM_CLK_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_ICM_MEM_CLK_EN_M  (HP_SYS_CLKRST_REG_ICM_MEM_CLK_EN_V << HP_SYS_CLKRST_REG_ICM_MEM_CLK_EN_S)
#define HP_SYS_CLKRST_REG_ICM_MEM_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_ICM_MEM_CLK_EN_S  1
/** HP_SYS_CLKRST_REG_ICM_SYS_CLK_EN : R/W; bitpos: [2]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_ICM_SYS_CLK_EN    (BIT(2))
#define HP_SYS_CLKRST_REG_ICM_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_ICM_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_ICM_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_ICM_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_ICM_SYS_CLK_EN_S  2
/** HP_SYS_CLKRST_REG_ICM_APB_CLK_EN : R/W; bitpos: [3]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_ICM_APB_CLK_EN    (BIT(3))
#define HP_SYS_CLKRST_REG_ICM_APB_CLK_EN_M  (HP_SYS_CLKRST_REG_ICM_APB_CLK_EN_V << HP_SYS_CLKRST_REG_ICM_APB_CLK_EN_S)
#define HP_SYS_CLKRST_REG_ICM_APB_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_ICM_APB_CLK_EN_S  3
/** HP_SYS_CLKRST_REG_CPUICM_GATED_CLK_FORCE_ON : R/W; bitpos: [4]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CPUICM_GATED_CLK_FORCE_ON    (BIT(4))
#define HP_SYS_CLKRST_REG_CPUICM_GATED_CLK_FORCE_ON_M  (HP_SYS_CLKRST_REG_CPUICM_GATED_CLK_FORCE_ON_V << HP_SYS_CLKRST_REG_CPUICM_GATED_CLK_FORCE_ON_S)
#define HP_SYS_CLKRST_REG_CPUICM_GATED_CLK_FORCE_ON_V  0x00000001U
#define HP_SYS_CLKRST_REG_CPUICM_GATED_CLK_FORCE_ON_S  4

