espressif/esp-idf/components/soc/esp32s31/register/soc/hp_sys_clkrst_reg.h
/** HP_SYS_CLKRST_MODEM_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_MODEM_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x40)
/** HP_SYS_CLKRST_REG_MODEM_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_MODEM_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_MODEM_CLK_EN_M  (HP_SYS_CLKRST_REG_MODEM_CLK_EN_V << HP_SYS_CLKRST_REG_MODEM_CLK_EN_S)
#define HP_SYS_CLKRST_REG_MODEM_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_MODEM_CLK_EN_S  0

/** HP_SYS_CLKRST_MISC_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_MISC_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x44)
/** HP_SYS_CLKRST_REG_MISC_CPU_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_MISC_CPU_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_MISC_CPU_CLK_EN_M  (HP_SYS_CLKRST_REG_MISC_CPU_CLK_EN_V << HP_SYS_CLKRST_REG_MISC_CPU_CLK_EN_S)
#define HP_SYS_CLKRST_REG_MISC_CPU_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_MISC_CPU_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_MISC_SYS_CLK_EN : R/W; bitpos: [1]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_MISC_SYS_CLK_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_MISC_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_MISC_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_MISC_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_MISC_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_MISC_SYS_CLK_EN_S  1
/** HP_SYS_CLKRST_REG_SYSREG_APB_CLK_EN : R/W; bitpos: [2]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_SYSREG_APB_CLK_EN    (BIT(2))
#define HP_SYS_CLKRST_REG_SYSREG_APB_CLK_EN_M  (HP_SYS_CLKRST_REG_SYSREG_APB_CLK_EN_V << HP_SYS_CLKRST_REG_SYSREG_APB_CLK_EN_S)
#define HP_SYS_CLKRST_REG_SYSREG_APB_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_SYSREG_APB_CLK_EN_S  2
/** HP_SYS_CLKRST_REG_HP_CLKRST_APB_CLK_EN : R/W; bitpos: [3]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_HP_CLKRST_APB_CLK_EN    (BIT(3))
#define HP_SYS_CLKRST_REG_HP_CLKRST_APB_CLK_EN_M  (HP_SYS_CLKRST_REG_HP_CLKRST_APB_CLK_EN_V << HP_SYS_CLKRST_REG_HP_CLKRST_APB_CLK_EN_S)
#define HP_SYS_CLKRST_REG_HP_CLKRST_APB_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_HP_CLKRST_APB_CLK_EN_S  3

/** HP_SYS_CLKRST_BUSMON_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_BUSMON_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x48)
/** HP_SYS_CLKRST_REG_BUSMON_CORE0_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_BUSMON_CORE0_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_BUSMON_CORE0_CLK_EN_M  (HP_SYS_CLKRST_REG_BUSMON_CORE0_CLK_EN_V << HP_SYS_CLKRST_REG_BUSMON_CORE0_CLK_EN_S)
#define HP_SYS_CLKRST_REG_BUSMON_CORE0_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_BUSMON_CORE0_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_BUSMON_CORE0_CLK_FORCE_ON : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_BUSMON_CORE0_CLK_FORCE_ON    (BIT(1))
#define HP_SYS_CLKRST_REG_BUSMON_CORE0_CLK_FORCE_ON_M  (HP_SYS_CLKRST_REG_BUSMON_CORE0_CLK_FORCE_ON_V << HP_SYS_CLKRST_REG_BUSMON_CORE0_CLK_FORCE_ON_S)
#define HP_SYS_CLKRST_REG_BUSMON_CORE0_CLK_FORCE_ON_V  0x00000001U
#define HP_SYS_CLKRST_REG_BUSMON_CORE0_CLK_FORCE_ON_S  1
/** HP_SYS_CLKRST_REG_BUSMON_CORE0_RST_EN : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_BUSMON_CORE0_RST_EN    (BIT(2))
#define HP_SYS_CLKRST_REG_BUSMON_CORE0_RST_EN_M  (HP_SYS_CLKRST_REG_BUSMON_CORE0_RST_EN_V << HP_SYS_CLKRST_REG_BUSMON_CORE0_RST_EN_S)
#define HP_SYS_CLKRST_REG_BUSMON_CORE0_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_BUSMON_CORE0_RST_EN_S  2
/** HP_SYS_CLKRST_REG_BUSMON_CORE0_FORCE_NORST : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_BUSMON_CORE0_FORCE_NORST    (BIT(3))
#define HP_SYS_CLKRST_REG_BUSMON_CORE0_FORCE_NORST_M  (HP_SYS_CLKRST_REG_BUSMON_CORE0_FORCE_NORST_V << HP_SYS_CLKRST_REG_BUSMON_CORE0_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_BUSMON_CORE0_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_BUSMON_CORE0_FORCE_NORST_S  3
/** HP_SYS_CLKRST_REG_BUSMON_CORE1_CLK_EN : R/W; bitpos: [4]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_BUSMON_CORE1_CLK_EN    (BIT(4))
#define HP_SYS_CLKRST_REG_BUSMON_CORE1_CLK_EN_M  (HP_SYS_CLKRST_REG_BUSMON_CORE1_CLK_EN_V << HP_SYS_CLKRST_REG_BUSMON_CORE1_CLK_EN_S)
#define HP_SYS_CLKRST_REG_BUSMON_CORE1_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_BUSMON_CORE1_CLK_EN_S  4
/** HP_SYS_CLKRST_REG_BUSMON_CORE1_CLK_FORCE_ON : R/W; bitpos: [5]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_BUSMON_CORE1_CLK_FORCE_ON    (BIT(5))
#define HP_SYS_CLKRST_REG_BUSMON_CORE1_CLK_FORCE_ON_M  (HP_SYS_CLKRST_REG_BUSMON_CORE1_CLK_FORCE_ON_V << HP_SYS_CLKRST_REG_BUSMON_CORE1_CLK_FORCE_ON_S)
#define HP_SYS_CLKRST_REG_BUSMON_CORE1_CLK_FORCE_ON_V  0x00000001U
#define HP_SYS_CLKRST_REG_BUSMON_CORE1_CLK_FORCE_ON_S  5
/** HP_SYS_CLKRST_REG_BUSMON_CORE1_RST_EN : R/W; bitpos: [6]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_BUSMON_CORE1_RST_EN    (BIT(6))
#define HP_SYS_CLKRST_REG_BUSMON_CORE1_RST_EN_M  (HP_SYS_CLKRST_REG_BUSMON_CORE1_RST_EN_V << HP_SYS_CLKRST_REG_BUSMON_CORE1_RST_EN_S)
#define HP_SYS_CLKRST_REG_BUSMON_CORE1_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_BUSMON_CORE1_RST_EN_S  6
/** HP_SYS_CLKRST_REG_BUSMON_CORE1_FORCE_NORST : R/W; bitpos: [7]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_BUSMON_CORE1_FORCE_NORST    (BIT(7))
#define HP_SYS_CLKRST_REG_BUSMON_CORE1_FORCE_NORST_M  (HP_SYS_CLKRST_REG_BUSMON_CORE1_FORCE_NORST_V << HP_SYS_CLKRST_REG_BUSMON_CORE1_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_BUSMON_CORE1_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_BUSMON_CORE1_FORCE_NORST_S  7

/** HP_SYS_CLKRST_REMOVE_TMP0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_REMOVE_TMP0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x4c)
/** HP_SYS_CLKRST_REG_GDMA_CPU_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_GDMA_CPU_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_GDMA_CPU_CLK_EN_M  (HP_SYS_CLKRST_REG_GDMA_CPU_CLK_EN_V << HP_SYS_CLKRST_REG_GDMA_CPU_CLK_EN_S)
#define HP_SYS_CLKRST_REG_GDMA_CPU_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_GDMA_CPU_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_VPU_CPU_CLK_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_VPU_CPU_CLK_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_VPU_CPU_CLK_EN_M  (HP_SYS_CLKRST_REG_VPU_CPU_CLK_EN_V << HP_SYS_CLKRST_REG_VPU_CPU_CLK_EN_S)
#define HP_SYS_CLKRST_REG_VPU_CPU_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_VPU_CPU_CLK_EN_S  1
/** HP_SYS_CLKRST_REG_VPU_SYS_CLK_EN : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_VPU_SYS_CLK_EN    (BIT(2))
#define HP_SYS_CLKRST_REG_VPU_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_VPU_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_VPU_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_VPU_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_VPU_SYS_CLK_EN_S  2

/** HP_SYS_CLKRST_PVT0_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_PVT0_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x50)
/** HP_SYS_CLKRST_REG_PVT0_SYS_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PVT0_SYS_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_PVT0_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_PVT0_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_PVT0_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_PVT0_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PVT0_SYS_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_PVT0_TOP_RST_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PVT0_TOP_RST_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_PVT0_TOP_RST_EN_M  (HP_SYS_CLKRST_REG_PVT0_TOP_RST_EN_V << HP_SYS_CLKRST_REG_PVT0_TOP_RST_EN_S)
#define HP_SYS_CLKRST_REG_PVT0_TOP_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PVT0_TOP_RST_EN_S  1
/** HP_SYS_CLKRST_REG_PVT0_APB_RST_EN : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PVT0_APB_RST_EN    (BIT(2))
#define HP_SYS_CLKRST_REG_PVT0_APB_RST_EN_M  (HP_SYS_CLKRST_REG_PVT0_APB_RST_EN_V << HP_SYS_CLKRST_REG_PVT0_APB_RST_EN_S)
#define HP_SYS_CLKRST_REG_PVT0_APB_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PVT0_APB_RST_EN_S  2
/** HP_SYS_CLKRST_REG_PVT0_CLK_DIV_NUM : R/W; bitpos: [10:3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PVT0_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_PVT0_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_PVT0_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_PVT0_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_PVT0_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_PVT0_CLK_DIV_NUM_S  3
/** HP_SYS_CLKRST_REG_PVT0_CLK_EN : R/W; bitpos: [11]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PVT0_CLK_EN    (BIT(11))
#define HP_SYS_CLKRST_REG_PVT0_CLK_EN_M  (HP_SYS_CLKRST_REG_PVT0_CLK_EN_V << HP_SYS_CLKRST_REG_PVT0_CLK_EN_S)
#define HP_SYS_CLKRST_REG_PVT0_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PVT0_CLK_EN_S  11

/** HP_SYS_CLKRST_PVT0_PERI_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_PVT0_PERI_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x54)
/** HP_SYS_CLKRST_REG_PVT0_PERI_GROUP1_RST_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PVT0_PERI_GROUP1_RST_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_PVT0_PERI_GROUP1_RST_EN_M  (HP_SYS_CLKRST_REG_PVT0_PERI_GROUP1_RST_EN_V << HP_SYS_CLKRST_REG_PVT0_PERI_GROUP1_RST_EN_S)
#define HP_SYS_CLKRST_REG_PVT0_PERI_GROUP1_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PVT0_PERI_GROUP1_RST_EN_S  0
/** HP_SYS_CLKRST_REG_PVT0_PERI_GROUP2_RST_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PVT0_PERI_GROUP2_RST_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_PVT0_PERI_GROUP2_RST_EN_M  (HP_SYS_CLKRST_REG_PVT0_PERI_GROUP2_RST_EN_V << HP_SYS_CLKRST_REG_PVT0_PERI_GROUP2_RST_EN_S)
#define HP_SYS_CLKRST_REG_PVT0_PERI_GROUP2_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PVT0_PERI_GROUP2_RST_EN_S  1
/** HP_SYS_CLKRST_REG_PVT0_PERI_GROUP3_RST_EN : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PVT0_PERI_GROUP3_RST_EN    (BIT(2))
#define HP_SYS_CLKRST_REG_PVT0_PERI_GROUP3_RST_EN_M  (HP_SYS_CLKRST_REG_PVT0_PERI_GROUP3_RST_EN_V << HP_SYS_CLKRST_REG_PVT0_PERI_GROUP3_RST_EN_S)
#define HP_SYS_CLKRST_REG_PVT0_PERI_GROUP3_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PVT0_PERI_GROUP3_RST_EN_S  2
/** HP_SYS_CLKRST_REG_PVT0_PERI_GROUP4_RST_EN : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PVT0_PERI_GROUP4_RST_EN    (BIT(3))
#define HP_SYS_CLKRST_REG_PVT0_PERI_GROUP4_RST_EN_M  (HP_SYS_CLKRST_REG_PVT0_PERI_GROUP4_RST_EN_V << HP_SYS_CLKRST_REG_PVT0_PERI_GROUP4_RST_EN_S)
#define HP_SYS_CLKRST_REG_PVT0_PERI_GROUP4_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PVT0_PERI_GROUP4_RST_EN_S  3
/** HP_SYS_CLKRST_REG_PVT0_PERI_GROUP1_CLK_EN : R/W; bitpos: [4]; default: 0;
 *  TOP power domain pvt clk en
 */
#define HP_SYS_CLKRST_REG_PVT0_PERI_GROUP1_CLK_EN    (BIT(4))
#define HP_SYS_CLKRST_REG_PVT0_PERI_GROUP1_CLK_EN_M  (HP_SYS_CLKRST_REG_PVT0_PERI_GROUP1_CLK_EN_V << HP_SYS_CLKRST_REG_PVT0_PERI_GROUP1_CLK_EN_S)
#define HP_SYS_CLKRST_REG_PVT0_PERI_GROUP1_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PVT0_PERI_GROUP1_CLK_EN_S  4
/** HP_SYS_CLKRST_REG_PVT0_PERI_GROUP2_CLK_EN : R/W; bitpos: [5]; default: 0;
 *  TOP power domain pvt clk en
 */
#define HP_SYS_CLKRST_REG_PVT0_PERI_GROUP2_CLK_EN    (BIT(5))
#define HP_SYS_CLKRST_REG_PVT0_PERI_GROUP2_CLK_EN_M  (HP_SYS_CLKRST_REG_PVT0_PERI_GROUP2_CLK_EN_V << HP_SYS_CLKRST_REG_PVT0_PERI_GROUP2_CLK_EN_S)
#define HP_SYS_CLKRST_REG_PVT0_PERI_GROUP2_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PVT0_PERI_GROUP2_CLK_EN_S  5
/** HP_SYS_CLKRST_REG_PVT0_PERI_GROUP3_CLK_EN : R/W; bitpos: [6]; default: 0;
 *  modem power domain pvt clk en
 */
#define HP_SYS_CLKRST_REG_PVT0_PERI_GROUP3_CLK_EN    (BIT(6))
#define HP_SYS_CLKRST_REG_PVT0_PERI_GROUP3_CLK_EN_M  (HP_SYS_CLKRST_REG_PVT0_PERI_GROUP3_CLK_EN_V << HP_SYS_CLKRST_REG_PVT0_PERI_GROUP3_CLK_EN_S)
#define HP_SYS_CLKRST_REG_PVT0_PERI_GROUP3_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PVT0_PERI_GROUP3_CLK_EN_S  6
/** HP_SYS_CLKRST_REG_PVT0_PERI_GROUP4_CLK_EN : R/W; bitpos: [7]; default: 0;
 *  modem power domain pvt clk en
 */
#define HP_SYS_CLKRST_REG_PVT0_PERI_GROUP4_CLK_EN    (BIT(7))
#define HP_SYS_CLKRST_REG_PVT0_PERI_GROUP4_CLK_EN_M  (HP_SYS_CLKRST_REG_PVT0_PERI_GROUP4_CLK_EN_V << HP_SYS_CLKRST_REG_PVT0_PERI_GROUP4_CLK_EN_S)
#define HP_SYS_CLKRST_REG_PVT0_PERI_GROUP4_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PVT0_PERI_GROUP4_CLK_EN_S  7

/** HP_SYS_CLKRST_CRYPTO_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_CRYPTO_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x58)
/** HP_SYS_CLKRST_REG_CRYPTO_SYS_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CRYPTO_SYS_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_CRYPTO_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_CRYPTO_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_CRYPTO_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_CRYPTO_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CRYPTO_SYS_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_CRYPTO_RST_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CRYPTO_RST_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_CRYPTO_RST_EN_M  (HP_SYS_CLKRST_REG_CRYPTO_RST_EN_V << HP_SYS_CLKRST_REG_CRYPTO_RST_EN_S)
#define HP_SYS_CLKRST_REG_CRYPTO_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CRYPTO_RST_EN_S  1
/** HP_SYS_CLKRST_REG_CRYPTO_SEC_CLK_EN : R/W; bitpos: [2]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CRYPTO_SEC_CLK_EN    (BIT(2))
#define HP_SYS_CLKRST_REG_CRYPTO_SEC_CLK_EN_M  (HP_SYS_CLKRST_REG_CRYPTO_SEC_CLK_EN_V << HP_SYS_CLKRST_REG_CRYPTO_SEC_CLK_EN_S)
#define HP_SYS_CLKRST_REG_CRYPTO_SEC_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CRYPTO_SEC_CLK_EN_S  2
/** HP_SYS_CLKRST_REG_CRYPTO_SEC_RST_EN : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CRYPTO_SEC_RST_EN    (BIT(3))
#define HP_SYS_CLKRST_REG_CRYPTO_SEC_RST_EN_M  (HP_SYS_CLKRST_REG_CRYPTO_SEC_RST_EN_V << HP_SYS_CLKRST_REG_CRYPTO_SEC_RST_EN_S)
#define HP_SYS_CLKRST_REG_CRYPTO_SEC_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CRYPTO_SEC_RST_EN_S  3
/** HP_SYS_CLKRST_REG_CRYPTO_AES_CLK_EN : R/W; bitpos: [4]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CRYPTO_AES_CLK_EN    (BIT(4))
#define HP_SYS_CLKRST_REG_CRYPTO_AES_CLK_EN_M  (HP_SYS_CLKRST_REG_CRYPTO_AES_CLK_EN_V << HP_SYS_CLKRST_REG_CRYPTO_AES_CLK_EN_S)
#define HP_SYS_CLKRST_REG_CRYPTO_AES_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CRYPTO_AES_CLK_EN_S  4
/** HP_SYS_CLKRST_REG_CRYPTO_AES_RST_EN : R/W; bitpos: [5]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CRYPTO_AES_RST_EN    (BIT(5))
#define HP_SYS_CLKRST_REG_CRYPTO_AES_RST_EN_M  (HP_SYS_CLKRST_REG_CRYPTO_AES_RST_EN_V << HP_SYS_CLKRST_REG_CRYPTO_AES_RST_EN_S)
#define HP_SYS_CLKRST_REG_CRYPTO_AES_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CRYPTO_AES_RST_EN_S  5
/** HP_SYS_CLKRST_REG_CRYPTO_SHA_CLK_EN : R/W; bitpos: [6]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CRYPTO_SHA_CLK_EN    (BIT(6))
#define HP_SYS_CLKRST_REG_CRYPTO_SHA_CLK_EN_M  (HP_SYS_CLKRST_REG_CRYPTO_SHA_CLK_EN_V << HP_SYS_CLKRST_REG_CRYPTO_SHA_CLK_EN_S)
#define HP_SYS_CLKRST_REG_CRYPTO_SHA_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CRYPTO_SHA_CLK_EN_S  6
/** HP_SYS_CLKRST_REG_CRYPTO_SHA_RST_EN : R/W; bitpos: [7]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CRYPTO_SHA_RST_EN    (BIT(7))
#define HP_SYS_CLKRST_REG_CRYPTO_SHA_RST_EN_M  (HP_SYS_CLKRST_REG_CRYPTO_SHA_RST_EN_V << HP_SYS_CLKRST_REG_CRYPTO_SHA_RST_EN_S)
#define HP_SYS_CLKRST_REG_CRYPTO_SHA_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CRYPTO_SHA_RST_EN_S  7
/** HP_SYS_CLKRST_REG_CRYPTO_RSA_CLK_EN : R/W; bitpos: [8]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CRYPTO_RSA_CLK_EN    (BIT(8))
#define HP_SYS_CLKRST_REG_CRYPTO_RSA_CLK_EN_M  (HP_SYS_CLKRST_REG_CRYPTO_RSA_CLK_EN_V << HP_SYS_CLKRST_REG_CRYPTO_RSA_CLK_EN_S)
#define HP_SYS_CLKRST_REG_CRYPTO_RSA_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CRYPTO_RSA_CLK_EN_S  8
/** HP_SYS_CLKRST_REG_CRYPTO_RSA_RST_EN : R/W; bitpos: [9]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CRYPTO_RSA_RST_EN    (BIT(9))
#define HP_SYS_CLKRST_REG_CRYPTO_RSA_RST_EN_M  (HP_SYS_CLKRST_REG_CRYPTO_RSA_RST_EN_V << HP_SYS_CLKRST_REG_CRYPTO_RSA_RST_EN_S)
#define HP_SYS_CLKRST_REG_CRYPTO_RSA_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CRYPTO_RSA_RST_EN_S  9
/** HP_SYS_CLKRST_REG_CRYPTO_DS_CLK_EN : R/W; bitpos: [10]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CRYPTO_DS_CLK_EN    (BIT(10))
#define HP_SYS_CLKRST_REG_CRYPTO_DS_CLK_EN_M  (HP_SYS_CLKRST_REG_CRYPTO_DS_CLK_EN_V << HP_SYS_CLKRST_REG_CRYPTO_DS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_CRYPTO_DS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CRYPTO_DS_CLK_EN_S  10
/** HP_SYS_CLKRST_REG_CRYPTO_DS_RST_EN : R/W; bitpos: [11]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CRYPTO_DS_RST_EN    (BIT(11))
#define HP_SYS_CLKRST_REG_CRYPTO_DS_RST_EN_M  (HP_SYS_CLKRST_REG_CRYPTO_DS_RST_EN_V << HP_SYS_CLKRST_REG_CRYPTO_DS_RST_EN_S)
#define HP_SYS_CLKRST_REG_CRYPTO_DS_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CRYPTO_DS_RST_EN_S  11
/** HP_SYS_CLKRST_REG_CRYPTO_ECC_CLK_EN : R/W; bitpos: [12]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CRYPTO_ECC_CLK_EN    (BIT(12))
#define HP_SYS_CLKRST_REG_CRYPTO_ECC_CLK_EN_M  (HP_SYS_CLKRST_REG_CRYPTO_ECC_CLK_EN_V << HP_SYS_CLKRST_REG_CRYPTO_ECC_CLK_EN_S)
#define HP_SYS_CLKRST_REG_CRYPTO_ECC_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CRYPTO_ECC_CLK_EN_S  12
/** HP_SYS_CLKRST_REG_CRYPTO_ECC_RST_EN : R/W; bitpos: [13]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CRYPTO_ECC_RST_EN    (BIT(13))
#define HP_SYS_CLKRST_REG_CRYPTO_ECC_RST_EN_M  (HP_SYS_CLKRST_REG_CRYPTO_ECC_RST_EN_V << HP_SYS_CLKRST_REG_CRYPTO_ECC_RST_EN_S)
#define HP_SYS_CLKRST_REG_CRYPTO_ECC_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CRYPTO_ECC_RST_EN_S  13
/** HP_SYS_CLKRST_REG_CRYPTO_HMAC_CLK_EN : R/W; bitpos: [14]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CRYPTO_HMAC_CLK_EN    (BIT(14))
#define HP_SYS_CLKRST_REG_CRYPTO_HMAC_CLK_EN_M  (HP_SYS_CLKRST_REG_CRYPTO_HMAC_CLK_EN_V << HP_SYS_CLKRST_REG_CRYPTO_HMAC_CLK_EN_S)
#define HP_SYS_CLKRST_REG_CRYPTO_HMAC_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CRYPTO_HMAC_CLK_EN_S  14
/** HP_SYS_CLKRST_REG_CRYPTO_HMAC_RST_EN : R/W; bitpos: [15]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CRYPTO_HMAC_RST_EN    (BIT(15))
#define HP_SYS_CLKRST_REG_CRYPTO_HMAC_RST_EN_M  (HP_SYS_CLKRST_REG_CRYPTO_HMAC_RST_EN_V << HP_SYS_CLKRST_REG_CRYPTO_HMAC_RST_EN_S)
#define HP_SYS_CLKRST_REG_CRYPTO_HMAC_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CRYPTO_HMAC_RST_EN_S  15
/** HP_SYS_CLKRST_REG_CRYPTO_ECDSA_CLK_EN : R/W; bitpos: [16]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CRYPTO_ECDSA_CLK_EN    (BIT(16))
#define HP_SYS_CLKRST_REG_CRYPTO_ECDSA_CLK_EN_M  (HP_SYS_CLKRST_REG_CRYPTO_ECDSA_CLK_EN_V << HP_SYS_CLKRST_REG_CRYPTO_ECDSA_CLK_EN_S)
#define HP_SYS_CLKRST_REG_CRYPTO_ECDSA_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CRYPTO_ECDSA_CLK_EN_S  16
/** HP_SYS_CLKRST_REG_CRYPTO_ECDSA_RST_EN : R/W; bitpos: [17]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CRYPTO_ECDSA_RST_EN    (BIT(17))
#define HP_SYS_CLKRST_REG_CRYPTO_ECDSA_RST_EN_M  (HP_SYS_CLKRST_REG_CRYPTO_ECDSA_RST_EN_V << HP_SYS_CLKRST_REG_CRYPTO_ECDSA_RST_EN_S)
#define HP_SYS_CLKRST_REG_CRYPTO_ECDSA_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CRYPTO_ECDSA_RST_EN_S  17
/** HP_SYS_CLKRST_REG_CRYPTO_CLK_SRC_SEL : R/W; bitpos: [21:20]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CRYPTO_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_CRYPTO_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_CRYPTO_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_CRYPTO_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_CRYPTO_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_CRYPTO_CLK_SRC_SEL_S  20
/** HP_SYS_CLKRST_REG_CRYPTO_RMA_CLK_EN : R/W; bitpos: [22]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CRYPTO_RMA_CLK_EN    (BIT(22))
#define HP_SYS_CLKRST_REG_CRYPTO_RMA_CLK_EN_M  (HP_SYS_CLKRST_REG_CRYPTO_RMA_CLK_EN_V << HP_SYS_CLKRST_REG_CRYPTO_RMA_CLK_EN_S)
#define HP_SYS_CLKRST_REG_CRYPTO_RMA_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CRYPTO_RMA_CLK_EN_S  22
/** HP_SYS_CLKRST_REG_CRYPTO_RMA_RST_EN : R/W; bitpos: [23]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CRYPTO_RMA_RST_EN    (BIT(23))
#define HP_SYS_CLKRST_REG_CRYPTO_RMA_RST_EN_M  (HP_SYS_CLKRST_REG_CRYPTO_RMA_RST_EN_V << HP_SYS_CLKRST_REG_CRYPTO_RMA_RST_EN_S)
#define HP_SYS_CLKRST_REG_CRYPTO_RMA_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CRYPTO_RMA_RST_EN_S  23

/** HP_SYS_CLKRST_KEY_MANAGER_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_KEY_MANAGER_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x5c)
/** HP_SYS_CLKRST_REG_KEY_MANAGER_SYS_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_KEY_MANAGER_SYS_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_KEY_MANAGER_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_KEY_MANAGER_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_KEY_MANAGER_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_KEY_MANAGER_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_KEY_MANAGER_SYS_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_CRYPTO_KM_RST_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CRYPTO_KM_RST_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_CRYPTO_KM_RST_EN_M  (HP_SYS_CLKRST_REG_CRYPTO_KM_RST_EN_V << HP_SYS_CLKRST_REG_CRYPTO_KM_RST_EN_S)
#define HP_SYS_CLKRST_REG_CRYPTO_KM_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CRYPTO_KM_RST_EN_S  1
/** HP_SYS_CLKRST_REG_CRYPTO_KM_CLK_EN : R/W; bitpos: [2]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CRYPTO_KM_CLK_EN    (BIT(2))
#define HP_SYS_CLKRST_REG_CRYPTO_KM_CLK_EN_M  (HP_SYS_CLKRST_REG_CRYPTO_KM_CLK_EN_V << HP_SYS_CLKRST_REG_CRYPTO_KM_CLK_EN_S)
#define HP_SYS_CLKRST_REG_CRYPTO_KM_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CRYPTO_KM_CLK_EN_S  2

/** HP_SYS_CLKRST_DPA_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_DPA_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x60)
/** HP_SYS_CLKRST_REG_SEC_DPA_LEVEL : R/W; bitpos: [1:0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_SEC_DPA_LEVEL    0x00000003U
#define HP_SYS_CLKRST_REG_SEC_DPA_LEVEL_M  (HP_SYS_CLKRST_REG_SEC_DPA_LEVEL_V << HP_SYS_CLKRST_REG_SEC_DPA_LEVEL_S)
#define HP_SYS_CLKRST_REG_SEC_DPA_LEVEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_SEC_DPA_LEVEL_S  0
/** HP_SYS_CLKRST_REG_SEC_DPA_CFG_SEL : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_SEC_DPA_CFG_SEL    (BIT(2))
#define HP_SYS_CLKRST_REG_SEC_DPA_CFG_SEL_M  (HP_SYS_CLKRST_REG_SEC_DPA_CFG_SEL_V << HP_SYS_CLKRST_REG_SEC_DPA_CFG_SEL_S)
#define HP_SYS_CLKRST_REG_SEC_DPA_CFG_SEL_V  0x00000001U
#define HP_SYS_CLKRST_REG_SEC_DPA_CFG_SEL_S  2

