espressif/esp-idf/components/soc/esp32s31/register/soc/hp_sys_clkrst_reg.h
/** HP_SYS_CLKRST_FLASH_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_FLASH_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x64)
/** HP_SYS_CLKRST_REG_FLASH_SYS_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_FLASH_SYS_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_FLASH_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_FLASH_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_FLASH_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_FLASH_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_FLASH_SYS_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_FLASH_AXI_RST_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_FLASH_AXI_RST_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_FLASH_AXI_RST_EN_M  (HP_SYS_CLKRST_REG_FLASH_AXI_RST_EN_V << HP_SYS_CLKRST_REG_FLASH_AXI_RST_EN_S)
#define HP_SYS_CLKRST_REG_FLASH_AXI_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_FLASH_AXI_RST_EN_S  1
/** HP_SYS_CLKRST_REG_FLASH_APB_RST_EN : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_FLASH_APB_RST_EN    (BIT(2))
#define HP_SYS_CLKRST_REG_FLASH_APB_RST_EN_M  (HP_SYS_CLKRST_REG_FLASH_APB_RST_EN_V << HP_SYS_CLKRST_REG_FLASH_APB_RST_EN_S)
#define HP_SYS_CLKRST_REG_FLASH_APB_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_FLASH_APB_RST_EN_S  2
/** HP_SYS_CLKRST_REG_FLASH_AXI_FORCE_NORST : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_FLASH_AXI_FORCE_NORST    (BIT(3))
#define HP_SYS_CLKRST_REG_FLASH_AXI_FORCE_NORST_M  (HP_SYS_CLKRST_REG_FLASH_AXI_FORCE_NORST_V << HP_SYS_CLKRST_REG_FLASH_AXI_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_FLASH_AXI_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_FLASH_AXI_FORCE_NORST_S  3
/** HP_SYS_CLKRST_REG_FLASH_APB_FORCE_NORST : R/W; bitpos: [4]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_FLASH_APB_FORCE_NORST    (BIT(4))
#define HP_SYS_CLKRST_REG_FLASH_APB_FORCE_NORST_M  (HP_SYS_CLKRST_REG_FLASH_APB_FORCE_NORST_V << HP_SYS_CLKRST_REG_FLASH_APB_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_FLASH_APB_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_FLASH_APB_FORCE_NORST_S  4
/** HP_SYS_CLKRST_REG_FLASH_CLK_SRC_SEL : R/W; bitpos: [6:5]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_FLASH_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_FLASH_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_FLASH_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_FLASH_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_FLASH_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_FLASH_CLK_SRC_SEL_S  5
/** HP_SYS_CLKRST_REG_FLASH_PLL_CLK_EN : R/W; bitpos: [7]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_FLASH_PLL_CLK_EN    (BIT(7))
#define HP_SYS_CLKRST_REG_FLASH_PLL_CLK_EN_M  (HP_SYS_CLKRST_REG_FLASH_PLL_CLK_EN_V << HP_SYS_CLKRST_REG_FLASH_PLL_CLK_EN_S)
#define HP_SYS_CLKRST_REG_FLASH_PLL_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_FLASH_PLL_CLK_EN_S  7
/** HP_SYS_CLKRST_REG_FLASH_CORE_CLK_EN : R/W; bitpos: [8]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_FLASH_CORE_CLK_EN    (BIT(8))
#define HP_SYS_CLKRST_REG_FLASH_CORE_CLK_EN_M  (HP_SYS_CLKRST_REG_FLASH_CORE_CLK_EN_V << HP_SYS_CLKRST_REG_FLASH_CORE_CLK_EN_S)
#define HP_SYS_CLKRST_REG_FLASH_CORE_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_FLASH_CORE_CLK_EN_S  8
/** HP_SYS_CLKRST_REG_FLASH_CORE_CLK_DIV_NUM : R/W; bitpos: [16:9]; default: 3;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_FLASH_CORE_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_FLASH_CORE_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_FLASH_CORE_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_FLASH_CORE_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_FLASH_CORE_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_FLASH_CORE_CLK_DIV_NUM_S  9

/** HP_SYS_CLKRST_PSRAM_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_PSRAM_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x68)
/** HP_SYS_CLKRST_REG_PSRAM_SYS_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PSRAM_SYS_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_PSRAM_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_PSRAM_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_PSRAM_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_PSRAM_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PSRAM_SYS_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_PSRAM_AXI_RST_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PSRAM_AXI_RST_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_PSRAM_AXI_RST_EN_M  (HP_SYS_CLKRST_REG_PSRAM_AXI_RST_EN_V << HP_SYS_CLKRST_REG_PSRAM_AXI_RST_EN_S)
#define HP_SYS_CLKRST_REG_PSRAM_AXI_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PSRAM_AXI_RST_EN_S  1
/** HP_SYS_CLKRST_REG_PSRAM_APB_RST_EN : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PSRAM_APB_RST_EN    (BIT(2))
#define HP_SYS_CLKRST_REG_PSRAM_APB_RST_EN_M  (HP_SYS_CLKRST_REG_PSRAM_APB_RST_EN_V << HP_SYS_CLKRST_REG_PSRAM_APB_RST_EN_S)
#define HP_SYS_CLKRST_REG_PSRAM_APB_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PSRAM_APB_RST_EN_S  2
/** HP_SYS_CLKRST_REG_PSRAM_AXI_FORCE_NORST : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PSRAM_AXI_FORCE_NORST    (BIT(3))
#define HP_SYS_CLKRST_REG_PSRAM_AXI_FORCE_NORST_M  (HP_SYS_CLKRST_REG_PSRAM_AXI_FORCE_NORST_V << HP_SYS_CLKRST_REG_PSRAM_AXI_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_PSRAM_AXI_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_PSRAM_AXI_FORCE_NORST_S  3
/** HP_SYS_CLKRST_REG_PSRAM_APB_FORCE_NORST : R/W; bitpos: [4]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PSRAM_APB_FORCE_NORST    (BIT(4))
#define HP_SYS_CLKRST_REG_PSRAM_APB_FORCE_NORST_M  (HP_SYS_CLKRST_REG_PSRAM_APB_FORCE_NORST_V << HP_SYS_CLKRST_REG_PSRAM_APB_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_PSRAM_APB_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_PSRAM_APB_FORCE_NORST_S  4
/** HP_SYS_CLKRST_REG_PSRAM_CLK_SRC_SEL : R/W; bitpos: [6:5]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PSRAM_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_PSRAM_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_PSRAM_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_PSRAM_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_PSRAM_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_PSRAM_CLK_SRC_SEL_S  5
/** HP_SYS_CLKRST_REG_PSRAM_PLL_CLK_EN : R/W; bitpos: [7]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PSRAM_PLL_CLK_EN    (BIT(7))
#define HP_SYS_CLKRST_REG_PSRAM_PLL_CLK_EN_M  (HP_SYS_CLKRST_REG_PSRAM_PLL_CLK_EN_V << HP_SYS_CLKRST_REG_PSRAM_PLL_CLK_EN_S)
#define HP_SYS_CLKRST_REG_PSRAM_PLL_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PSRAM_PLL_CLK_EN_S  7
/** HP_SYS_CLKRST_REG_PSRAM_CORE_CLK_EN : R/W; bitpos: [8]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PSRAM_CORE_CLK_EN    (BIT(8))
#define HP_SYS_CLKRST_REG_PSRAM_CORE_CLK_EN_M  (HP_SYS_CLKRST_REG_PSRAM_CORE_CLK_EN_V << HP_SYS_CLKRST_REG_PSRAM_CORE_CLK_EN_S)
#define HP_SYS_CLKRST_REG_PSRAM_CORE_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PSRAM_CORE_CLK_EN_S  8
/** HP_SYS_CLKRST_REG_PSRAM_CORE_CLK_DIV_NUM : R/W; bitpos: [16:9]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PSRAM_CORE_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_PSRAM_CORE_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_PSRAM_CORE_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_PSRAM_CORE_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_PSRAM_CORE_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_PSRAM_CORE_CLK_DIV_NUM_S  9

/** HP_SYS_CLKRST_GPSPI2_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_GPSPI2_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x6c)
/** HP_SYS_CLKRST_REG_GPSPI2_SYS_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_GPSPI2_SYS_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_GPSPI2_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_GPSPI2_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_GPSPI2_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_GPSPI2_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_GPSPI2_SYS_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_GPSPI2_APB_CLK_EN : R/W; bitpos: [1]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_GPSPI2_APB_CLK_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_GPSPI2_APB_CLK_EN_M  (HP_SYS_CLKRST_REG_GPSPI2_APB_CLK_EN_V << HP_SYS_CLKRST_REG_GPSPI2_APB_CLK_EN_S)
#define HP_SYS_CLKRST_REG_GPSPI2_APB_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_GPSPI2_APB_CLK_EN_S  1
/** HP_SYS_CLKRST_REG_GPSPI2_RST_EN : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_GPSPI2_RST_EN    (BIT(2))
#define HP_SYS_CLKRST_REG_GPSPI2_RST_EN_M  (HP_SYS_CLKRST_REG_GPSPI2_RST_EN_V << HP_SYS_CLKRST_REG_GPSPI2_RST_EN_S)
#define HP_SYS_CLKRST_REG_GPSPI2_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_GPSPI2_RST_EN_S  2
/** HP_SYS_CLKRST_REG_GPSPI2_FORCE_NORST : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_GPSPI2_FORCE_NORST    (BIT(3))
#define HP_SYS_CLKRST_REG_GPSPI2_FORCE_NORST_M  (HP_SYS_CLKRST_REG_GPSPI2_FORCE_NORST_V << HP_SYS_CLKRST_REG_GPSPI2_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_GPSPI2_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_GPSPI2_FORCE_NORST_S  3
/** HP_SYS_CLKRST_REG_GPSPI2_CLK_SRC_SEL : R/W; bitpos: [5:4]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_GPSPI2_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_GPSPI2_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_GPSPI2_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_GPSPI2_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_GPSPI2_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_GPSPI2_CLK_SRC_SEL_S  4
/** HP_SYS_CLKRST_REG_GPSPI2_HS_CLK_EN : R/W; bitpos: [6]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_GPSPI2_HS_CLK_EN    (BIT(6))
#define HP_SYS_CLKRST_REG_GPSPI2_HS_CLK_EN_M  (HP_SYS_CLKRST_REG_GPSPI2_HS_CLK_EN_V << HP_SYS_CLKRST_REG_GPSPI2_HS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_GPSPI2_HS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_GPSPI2_HS_CLK_EN_S  6
/** HP_SYS_CLKRST_REG_GPSPI2_HS_CLK_DIV_NUM : R/W; bitpos: [14:7]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_GPSPI2_HS_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_GPSPI2_HS_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_GPSPI2_HS_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_GPSPI2_HS_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_GPSPI2_HS_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_GPSPI2_HS_CLK_DIV_NUM_S  7
/** HP_SYS_CLKRST_REG_GPSPI2_MST_CLK_DIV_NUM : R/W; bitpos: [22:15]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_GPSPI2_MST_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_GPSPI2_MST_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_GPSPI2_MST_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_GPSPI2_MST_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_GPSPI2_MST_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_GPSPI2_MST_CLK_DIV_NUM_S  15
/** HP_SYS_CLKRST_REG_GPSPI2_MST_CLK_EN : R/W; bitpos: [23]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_GPSPI2_MST_CLK_EN    (BIT(23))
#define HP_SYS_CLKRST_REG_GPSPI2_MST_CLK_EN_M  (HP_SYS_CLKRST_REG_GPSPI2_MST_CLK_EN_V << HP_SYS_CLKRST_REG_GPSPI2_MST_CLK_EN_S)
#define HP_SYS_CLKRST_REG_GPSPI2_MST_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_GPSPI2_MST_CLK_EN_S  23

/** HP_SYS_CLKRST_GPSPI3_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_GPSPI3_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x70)
/** HP_SYS_CLKRST_REG_GPSPI3_SYS_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_GPSPI3_SYS_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_GPSPI3_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_GPSPI3_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_GPSPI3_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_GPSPI3_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_GPSPI3_SYS_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_GPSPI3_APB_CLK_EN : R/W; bitpos: [1]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_GPSPI3_APB_CLK_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_GPSPI3_APB_CLK_EN_M  (HP_SYS_CLKRST_REG_GPSPI3_APB_CLK_EN_V << HP_SYS_CLKRST_REG_GPSPI3_APB_CLK_EN_S)
#define HP_SYS_CLKRST_REG_GPSPI3_APB_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_GPSPI3_APB_CLK_EN_S  1
/** HP_SYS_CLKRST_REG_GPSPI3_RST_EN : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_GPSPI3_RST_EN    (BIT(2))
#define HP_SYS_CLKRST_REG_GPSPI3_RST_EN_M  (HP_SYS_CLKRST_REG_GPSPI3_RST_EN_V << HP_SYS_CLKRST_REG_GPSPI3_RST_EN_S)
#define HP_SYS_CLKRST_REG_GPSPI3_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_GPSPI3_RST_EN_S  2
/** HP_SYS_CLKRST_REG_GPSPI3_FORCE_NORST : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_GPSPI3_FORCE_NORST    (BIT(3))
#define HP_SYS_CLKRST_REG_GPSPI3_FORCE_NORST_M  (HP_SYS_CLKRST_REG_GPSPI3_FORCE_NORST_V << HP_SYS_CLKRST_REG_GPSPI3_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_GPSPI3_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_GPSPI3_FORCE_NORST_S  3
/** HP_SYS_CLKRST_REG_GPSPI3_CLK_SRC_SEL : R/W; bitpos: [5:4]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_GPSPI3_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_GPSPI3_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_GPSPI3_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_GPSPI3_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_GPSPI3_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_GPSPI3_CLK_SRC_SEL_S  4
/** HP_SYS_CLKRST_REG_GPSPI3_HS_CLK_EN : R/W; bitpos: [6]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_GPSPI3_HS_CLK_EN    (BIT(6))
#define HP_SYS_CLKRST_REG_GPSPI3_HS_CLK_EN_M  (HP_SYS_CLKRST_REG_GPSPI3_HS_CLK_EN_V << HP_SYS_CLKRST_REG_GPSPI3_HS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_GPSPI3_HS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_GPSPI3_HS_CLK_EN_S  6
/** HP_SYS_CLKRST_REG_GPSPI3_HS_CLK_DIV_NUM : R/W; bitpos: [14:7]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_GPSPI3_HS_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_GPSPI3_HS_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_GPSPI3_HS_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_GPSPI3_HS_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_GPSPI3_HS_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_GPSPI3_HS_CLK_DIV_NUM_S  7
/** HP_SYS_CLKRST_REG_GPSPI3_MST_CLK_DIV_NUM : R/W; bitpos: [22:15]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_GPSPI3_MST_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_GPSPI3_MST_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_GPSPI3_MST_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_GPSPI3_MST_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_GPSPI3_MST_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_GPSPI3_MST_CLK_DIV_NUM_S  15
/** HP_SYS_CLKRST_REG_GPSPI3_MST_CLK_EN : R/W; bitpos: [23]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_GPSPI3_MST_CLK_EN    (BIT(23))
#define HP_SYS_CLKRST_REG_GPSPI3_MST_CLK_EN_M  (HP_SYS_CLKRST_REG_GPSPI3_MST_CLK_EN_V << HP_SYS_CLKRST_REG_GPSPI3_MST_CLK_EN_S)
#define HP_SYS_CLKRST_REG_GPSPI3_MST_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_GPSPI3_MST_CLK_EN_S  23

/** HP_SYS_CLKRST_GDMA_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_GDMA_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x74)
/** HP_SYS_CLKRST_REG_GDMA_SYS_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_GDMA_SYS_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_GDMA_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_GDMA_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_GDMA_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_GDMA_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_GDMA_SYS_CLK_EN_S  0

