espressif/esp-idf/components/soc/esp32s31/register/soc/hp_sys_clkrst_reg.h
/** HP_SYS_CLKRST_AXI_PDMA_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_AXI_PDMA_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x78)
/** HP_SYS_CLKRST_REG_AXI_PDMA_SYS_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_AXI_PDMA_SYS_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_AXI_PDMA_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_AXI_PDMA_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_AXI_PDMA_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_AXI_PDMA_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_AXI_PDMA_SYS_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_AXI_PDMA_RST_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_AXI_PDMA_RST_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_AXI_PDMA_RST_EN_M  (HP_SYS_CLKRST_REG_AXI_PDMA_RST_EN_V << HP_SYS_CLKRST_REG_AXI_PDMA_RST_EN_S)
#define HP_SYS_CLKRST_REG_AXI_PDMA_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_AXI_PDMA_RST_EN_S  1
/** HP_SYS_CLKRST_REG_AXI_PDMA_FORCE_NORST : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_AXI_PDMA_FORCE_NORST    (BIT(2))
#define HP_SYS_CLKRST_REG_AXI_PDMA_FORCE_NORST_M  (HP_SYS_CLKRST_REG_AXI_PDMA_FORCE_NORST_V << HP_SYS_CLKRST_REG_AXI_PDMA_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_AXI_PDMA_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_AXI_PDMA_FORCE_NORST_S  2

/** HP_SYS_CLKRST_AHB_PDMA_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_AHB_PDMA_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x7c)
/** HP_SYS_CLKRST_REG_AHB_PDMA_SYS_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_AHB_PDMA_SYS_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_AHB_PDMA_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_AHB_PDMA_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_AHB_PDMA_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_AHB_PDMA_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_AHB_PDMA_SYS_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_AHB_PDMA_RST_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_AHB_PDMA_RST_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_AHB_PDMA_RST_EN_M  (HP_SYS_CLKRST_REG_AHB_PDMA_RST_EN_V << HP_SYS_CLKRST_REG_AHB_PDMA_RST_EN_S)
#define HP_SYS_CLKRST_REG_AHB_PDMA_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_AHB_PDMA_RST_EN_S  1
/** HP_SYS_CLKRST_REG_AHB_PDMA_FORCE_NORST : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_AHB_PDMA_FORCE_NORST    (BIT(2))
#define HP_SYS_CLKRST_REG_AHB_PDMA_FORCE_NORST_M  (HP_SYS_CLKRST_REG_AHB_PDMA_FORCE_NORST_V << HP_SYS_CLKRST_REG_AHB_PDMA_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_AHB_PDMA_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_AHB_PDMA_FORCE_NORST_S  2

/** HP_SYS_CLKRST_REGDMA_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_REGDMA_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x80)
/** HP_SYS_CLKRST_REG_REGDMA_SYS_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_REGDMA_SYS_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_REGDMA_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_REGDMA_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_REGDMA_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_REGDMA_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_REGDMA_SYS_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_REGDMA_RST_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_REGDMA_RST_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_REGDMA_RST_EN_M  (HP_SYS_CLKRST_REG_REGDMA_RST_EN_V << HP_SYS_CLKRST_REG_REGDMA_RST_EN_S)
#define HP_SYS_CLKRST_REG_REGDMA_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_REGDMA_RST_EN_S  1

/** HP_SYS_CLKRST_UHCI_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_UHCI_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x84)
/** HP_SYS_CLKRST_REG_UHCI_SYS_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UHCI_SYS_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_UHCI_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_UHCI_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_UHCI_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_UHCI_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_UHCI_SYS_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_UHCI_APB_CLK_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UHCI_APB_CLK_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_UHCI_APB_CLK_EN_M  (HP_SYS_CLKRST_REG_UHCI_APB_CLK_EN_V << HP_SYS_CLKRST_REG_UHCI_APB_CLK_EN_S)
#define HP_SYS_CLKRST_REG_UHCI_APB_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_UHCI_APB_CLK_EN_S  1
/** HP_SYS_CLKRST_REG_UHCI_RST_EN : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UHCI_RST_EN    (BIT(2))
#define HP_SYS_CLKRST_REG_UHCI_RST_EN_M  (HP_SYS_CLKRST_REG_UHCI_RST_EN_V << HP_SYS_CLKRST_REG_UHCI_RST_EN_S)
#define HP_SYS_CLKRST_REG_UHCI_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_UHCI_RST_EN_S  2
/** HP_SYS_CLKRST_REG_UHCI_FORCE_NORST : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UHCI_FORCE_NORST    (BIT(3))
#define HP_SYS_CLKRST_REG_UHCI_FORCE_NORST_M  (HP_SYS_CLKRST_REG_UHCI_FORCE_NORST_V << HP_SYS_CLKRST_REG_UHCI_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_UHCI_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_UHCI_FORCE_NORST_S  3

/** HP_SYS_CLKRST_UART0_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_UART0_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x88)
/** HP_SYS_CLKRST_REG_UART0_SYS_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UART0_SYS_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_UART0_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_UART0_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_UART0_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_UART0_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_UART0_SYS_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_UART0_APB_CLK_EN : R/W; bitpos: [1]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UART0_APB_CLK_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_UART0_APB_CLK_EN_M  (HP_SYS_CLKRST_REG_UART0_APB_CLK_EN_V << HP_SYS_CLKRST_REG_UART0_APB_CLK_EN_S)
#define HP_SYS_CLKRST_REG_UART0_APB_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_UART0_APB_CLK_EN_S  1
/** HP_SYS_CLKRST_REG_UART0_CORE_RST_EN : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UART0_CORE_RST_EN    (BIT(2))
#define HP_SYS_CLKRST_REG_UART0_CORE_RST_EN_M  (HP_SYS_CLKRST_REG_UART0_CORE_RST_EN_V << HP_SYS_CLKRST_REG_UART0_CORE_RST_EN_S)
#define HP_SYS_CLKRST_REG_UART0_CORE_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_UART0_CORE_RST_EN_S  2
/** HP_SYS_CLKRST_REG_UART0_APB_RST_EN : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UART0_APB_RST_EN    (BIT(3))
#define HP_SYS_CLKRST_REG_UART0_APB_RST_EN_M  (HP_SYS_CLKRST_REG_UART0_APB_RST_EN_V << HP_SYS_CLKRST_REG_UART0_APB_RST_EN_S)
#define HP_SYS_CLKRST_REG_UART0_APB_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_UART0_APB_RST_EN_S  3
/** HP_SYS_CLKRST_REG_UART0_FORCE_NORST : R/W; bitpos: [4]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UART0_FORCE_NORST    (BIT(4))
#define HP_SYS_CLKRST_REG_UART0_FORCE_NORST_M  (HP_SYS_CLKRST_REG_UART0_FORCE_NORST_V << HP_SYS_CLKRST_REG_UART0_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_UART0_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_UART0_FORCE_NORST_S  4
/** HP_SYS_CLKRST_REG_UART0_CLK_SRC_SEL : R/W; bitpos: [6:5]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UART0_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_UART0_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_UART0_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_UART0_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_UART0_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_UART0_CLK_SRC_SEL_S  5
/** HP_SYS_CLKRST_REG_UART0_CLK_EN : R/W; bitpos: [7]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UART0_CLK_EN    (BIT(7))
#define HP_SYS_CLKRST_REG_UART0_CLK_EN_M  (HP_SYS_CLKRST_REG_UART0_CLK_EN_V << HP_SYS_CLKRST_REG_UART0_CLK_EN_S)
#define HP_SYS_CLKRST_REG_UART0_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_UART0_CLK_EN_S  7
/** HP_SYS_CLKRST_REG_UART0_SCLK_DIV_NUM : R/W; bitpos: [15:8]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UART0_SCLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_UART0_SCLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_UART0_SCLK_DIV_NUM_V << HP_SYS_CLKRST_REG_UART0_SCLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_UART0_SCLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_UART0_SCLK_DIV_NUM_S  8
/** HP_SYS_CLKRST_REG_UART0_SCLK_DIV_NUMERATOR : R/W; bitpos: [23:16]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UART0_SCLK_DIV_NUMERATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_UART0_SCLK_DIV_NUMERATOR_M  (HP_SYS_CLKRST_REG_UART0_SCLK_DIV_NUMERATOR_V << HP_SYS_CLKRST_REG_UART0_SCLK_DIV_NUMERATOR_S)
#define HP_SYS_CLKRST_REG_UART0_SCLK_DIV_NUMERATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_UART0_SCLK_DIV_NUMERATOR_S  16
/** HP_SYS_CLKRST_REG_UART0_SCLK_DIV_DENOMINATOR : R/W; bitpos: [31:24]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UART0_SCLK_DIV_DENOMINATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_UART0_SCLK_DIV_DENOMINATOR_M  (HP_SYS_CLKRST_REG_UART0_SCLK_DIV_DENOMINATOR_V << HP_SYS_CLKRST_REG_UART0_SCLK_DIV_DENOMINATOR_S)
#define HP_SYS_CLKRST_REG_UART0_SCLK_DIV_DENOMINATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_UART0_SCLK_DIV_DENOMINATOR_S  24

/** HP_SYS_CLKRST_UART1_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_UART1_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x8c)
/** HP_SYS_CLKRST_REG_UART1_SYS_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UART1_SYS_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_UART1_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_UART1_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_UART1_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_UART1_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_UART1_SYS_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_UART1_APB_CLK_EN : R/W; bitpos: [1]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UART1_APB_CLK_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_UART1_APB_CLK_EN_M  (HP_SYS_CLKRST_REG_UART1_APB_CLK_EN_V << HP_SYS_CLKRST_REG_UART1_APB_CLK_EN_S)
#define HP_SYS_CLKRST_REG_UART1_APB_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_UART1_APB_CLK_EN_S  1
/** HP_SYS_CLKRST_REG_UART1_CORE_RST_EN : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UART1_CORE_RST_EN    (BIT(2))
#define HP_SYS_CLKRST_REG_UART1_CORE_RST_EN_M  (HP_SYS_CLKRST_REG_UART1_CORE_RST_EN_V << HP_SYS_CLKRST_REG_UART1_CORE_RST_EN_S)
#define HP_SYS_CLKRST_REG_UART1_CORE_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_UART1_CORE_RST_EN_S  2
/** HP_SYS_CLKRST_REG_UART1_APB_RST_EN : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UART1_APB_RST_EN    (BIT(3))
#define HP_SYS_CLKRST_REG_UART1_APB_RST_EN_M  (HP_SYS_CLKRST_REG_UART1_APB_RST_EN_V << HP_SYS_CLKRST_REG_UART1_APB_RST_EN_S)
#define HP_SYS_CLKRST_REG_UART1_APB_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_UART1_APB_RST_EN_S  3
/** HP_SYS_CLKRST_REG_UART1_FORCE_NORST : R/W; bitpos: [4]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UART1_FORCE_NORST    (BIT(4))
#define HP_SYS_CLKRST_REG_UART1_FORCE_NORST_M  (HP_SYS_CLKRST_REG_UART1_FORCE_NORST_V << HP_SYS_CLKRST_REG_UART1_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_UART1_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_UART1_FORCE_NORST_S  4
/** HP_SYS_CLKRST_REG_UART1_CLK_SRC_SEL : R/W; bitpos: [6:5]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UART1_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_UART1_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_UART1_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_UART1_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_UART1_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_UART1_CLK_SRC_SEL_S  5
/** HP_SYS_CLKRST_REG_UART1_CLK_EN : R/W; bitpos: [7]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UART1_CLK_EN    (BIT(7))
#define HP_SYS_CLKRST_REG_UART1_CLK_EN_M  (HP_SYS_CLKRST_REG_UART1_CLK_EN_V << HP_SYS_CLKRST_REG_UART1_CLK_EN_S)
#define HP_SYS_CLKRST_REG_UART1_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_UART1_CLK_EN_S  7
/** HP_SYS_CLKRST_REG_UART1_SCLK_DIV_NUM : R/W; bitpos: [15:8]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UART1_SCLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_UART1_SCLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_UART1_SCLK_DIV_NUM_V << HP_SYS_CLKRST_REG_UART1_SCLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_UART1_SCLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_UART1_SCLK_DIV_NUM_S  8
/** HP_SYS_CLKRST_REG_UART1_SCLK_DIV_NUMERATOR : R/W; bitpos: [23:16]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UART1_SCLK_DIV_NUMERATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_UART1_SCLK_DIV_NUMERATOR_M  (HP_SYS_CLKRST_REG_UART1_SCLK_DIV_NUMERATOR_V << HP_SYS_CLKRST_REG_UART1_SCLK_DIV_NUMERATOR_S)
#define HP_SYS_CLKRST_REG_UART1_SCLK_DIV_NUMERATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_UART1_SCLK_DIV_NUMERATOR_S  16
/** HP_SYS_CLKRST_REG_UART1_SCLK_DIV_DENOMINATOR : R/W; bitpos: [31:24]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UART1_SCLK_DIV_DENOMINATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_UART1_SCLK_DIV_DENOMINATOR_M  (HP_SYS_CLKRST_REG_UART1_SCLK_DIV_DENOMINATOR_V << HP_SYS_CLKRST_REG_UART1_SCLK_DIV_DENOMINATOR_S)
#define HP_SYS_CLKRST_REG_UART1_SCLK_DIV_DENOMINATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_UART1_SCLK_DIV_DENOMINATOR_S  24

/** HP_SYS_CLKRST_UART2_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_UART2_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x90)
/** HP_SYS_CLKRST_REG_UART2_SYS_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UART2_SYS_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_UART2_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_UART2_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_UART2_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_UART2_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_UART2_SYS_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_UART2_APB_CLK_EN : R/W; bitpos: [1]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UART2_APB_CLK_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_UART2_APB_CLK_EN_M  (HP_SYS_CLKRST_REG_UART2_APB_CLK_EN_V << HP_SYS_CLKRST_REG_UART2_APB_CLK_EN_S)
#define HP_SYS_CLKRST_REG_UART2_APB_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_UART2_APB_CLK_EN_S  1
/** HP_SYS_CLKRST_REG_UART2_CORE_RST_EN : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UART2_CORE_RST_EN    (BIT(2))
#define HP_SYS_CLKRST_REG_UART2_CORE_RST_EN_M  (HP_SYS_CLKRST_REG_UART2_CORE_RST_EN_V << HP_SYS_CLKRST_REG_UART2_CORE_RST_EN_S)
#define HP_SYS_CLKRST_REG_UART2_CORE_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_UART2_CORE_RST_EN_S  2
/** HP_SYS_CLKRST_REG_UART2_APB_RST_EN : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UART2_APB_RST_EN    (BIT(3))
#define HP_SYS_CLKRST_REG_UART2_APB_RST_EN_M  (HP_SYS_CLKRST_REG_UART2_APB_RST_EN_V << HP_SYS_CLKRST_REG_UART2_APB_RST_EN_S)
#define HP_SYS_CLKRST_REG_UART2_APB_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_UART2_APB_RST_EN_S  3
/** HP_SYS_CLKRST_REG_UART2_FORCE_NORST : R/W; bitpos: [4]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UART2_FORCE_NORST    (BIT(4))
#define HP_SYS_CLKRST_REG_UART2_FORCE_NORST_M  (HP_SYS_CLKRST_REG_UART2_FORCE_NORST_V << HP_SYS_CLKRST_REG_UART2_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_UART2_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_UART2_FORCE_NORST_S  4
/** HP_SYS_CLKRST_REG_UART2_CLK_SRC_SEL : R/W; bitpos: [6:5]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UART2_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_UART2_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_UART2_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_UART2_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_UART2_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_UART2_CLK_SRC_SEL_S  5
/** HP_SYS_CLKRST_REG_UART2_CLK_EN : R/W; bitpos: [7]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UART2_CLK_EN    (BIT(7))
#define HP_SYS_CLKRST_REG_UART2_CLK_EN_M  (HP_SYS_CLKRST_REG_UART2_CLK_EN_V << HP_SYS_CLKRST_REG_UART2_CLK_EN_S)
#define HP_SYS_CLKRST_REG_UART2_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_UART2_CLK_EN_S  7
/** HP_SYS_CLKRST_REG_UART2_SCLK_DIV_NUM : R/W; bitpos: [15:8]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UART2_SCLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_UART2_SCLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_UART2_SCLK_DIV_NUM_V << HP_SYS_CLKRST_REG_UART2_SCLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_UART2_SCLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_UART2_SCLK_DIV_NUM_S  8
/** HP_SYS_CLKRST_REG_UART2_SCLK_DIV_NUMERATOR : R/W; bitpos: [23:16]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UART2_SCLK_DIV_NUMERATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_UART2_SCLK_DIV_NUMERATOR_M  (HP_SYS_CLKRST_REG_UART2_SCLK_DIV_NUMERATOR_V << HP_SYS_CLKRST_REG_UART2_SCLK_DIV_NUMERATOR_S)
#define HP_SYS_CLKRST_REG_UART2_SCLK_DIV_NUMERATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_UART2_SCLK_DIV_NUMERATOR_S  16
/** HP_SYS_CLKRST_REG_UART2_SCLK_DIV_DENOMINATOR : R/W; bitpos: [31:24]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UART2_SCLK_DIV_DENOMINATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_UART2_SCLK_DIV_DENOMINATOR_M  (HP_SYS_CLKRST_REG_UART2_SCLK_DIV_DENOMINATOR_V << HP_SYS_CLKRST_REG_UART2_SCLK_DIV_DENOMINATOR_S)
#define HP_SYS_CLKRST_REG_UART2_SCLK_DIV_DENOMINATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_UART2_SCLK_DIV_DENOMINATOR_S  24

/** HP_SYS_CLKRST_UART3_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_UART3_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x94)
/** HP_SYS_CLKRST_REG_UART3_SYS_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UART3_SYS_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_UART3_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_UART3_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_UART3_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_UART3_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_UART3_SYS_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_UART3_APB_CLK_EN : R/W; bitpos: [1]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UART3_APB_CLK_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_UART3_APB_CLK_EN_M  (HP_SYS_CLKRST_REG_UART3_APB_CLK_EN_V << HP_SYS_CLKRST_REG_UART3_APB_CLK_EN_S)
#define HP_SYS_CLKRST_REG_UART3_APB_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_UART3_APB_CLK_EN_S  1
/** HP_SYS_CLKRST_REG_UART3_CORE_RST_EN : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UART3_CORE_RST_EN    (BIT(2))
#define HP_SYS_CLKRST_REG_UART3_CORE_RST_EN_M  (HP_SYS_CLKRST_REG_UART3_CORE_RST_EN_V << HP_SYS_CLKRST_REG_UART3_CORE_RST_EN_S)
#define HP_SYS_CLKRST_REG_UART3_CORE_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_UART3_CORE_RST_EN_S  2
/** HP_SYS_CLKRST_REG_UART3_APB_RST_EN : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UART3_APB_RST_EN    (BIT(3))
#define HP_SYS_CLKRST_REG_UART3_APB_RST_EN_M  (HP_SYS_CLKRST_REG_UART3_APB_RST_EN_V << HP_SYS_CLKRST_REG_UART3_APB_RST_EN_S)
#define HP_SYS_CLKRST_REG_UART3_APB_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_UART3_APB_RST_EN_S  3
/** HP_SYS_CLKRST_REG_UART3_FORCE_NORST : R/W; bitpos: [4]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UART3_FORCE_NORST    (BIT(4))
#define HP_SYS_CLKRST_REG_UART3_FORCE_NORST_M  (HP_SYS_CLKRST_REG_UART3_FORCE_NORST_V << HP_SYS_CLKRST_REG_UART3_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_UART3_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_UART3_FORCE_NORST_S  4
/** HP_SYS_CLKRST_REG_UART3_CLK_SRC_SEL : R/W; bitpos: [6:5]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UART3_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_UART3_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_UART3_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_UART3_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_UART3_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_UART3_CLK_SRC_SEL_S  5
/** HP_SYS_CLKRST_REG_UART3_CLK_EN : R/W; bitpos: [7]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UART3_CLK_EN    (BIT(7))
#define HP_SYS_CLKRST_REG_UART3_CLK_EN_M  (HP_SYS_CLKRST_REG_UART3_CLK_EN_V << HP_SYS_CLKRST_REG_UART3_CLK_EN_S)
#define HP_SYS_CLKRST_REG_UART3_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_UART3_CLK_EN_S  7
/** HP_SYS_CLKRST_REG_UART3_SCLK_DIV_NUM : R/W; bitpos: [15:8]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UART3_SCLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_UART3_SCLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_UART3_SCLK_DIV_NUM_V << HP_SYS_CLKRST_REG_UART3_SCLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_UART3_SCLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_UART3_SCLK_DIV_NUM_S  8
/** HP_SYS_CLKRST_REG_UART3_SCLK_DIV_NUMERATOR : R/W; bitpos: [23:16]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UART3_SCLK_DIV_NUMERATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_UART3_SCLK_DIV_NUMERATOR_M  (HP_SYS_CLKRST_REG_UART3_SCLK_DIV_NUMERATOR_V << HP_SYS_CLKRST_REG_UART3_SCLK_DIV_NUMERATOR_S)
#define HP_SYS_CLKRST_REG_UART3_SCLK_DIV_NUMERATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_UART3_SCLK_DIV_NUMERATOR_S  16
/** HP_SYS_CLKRST_REG_UART3_SCLK_DIV_DENOMINATOR : R/W; bitpos: [31:24]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_UART3_SCLK_DIV_DENOMINATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_UART3_SCLK_DIV_DENOMINATOR_M  (HP_SYS_CLKRST_REG_UART3_SCLK_DIV_DENOMINATOR_V << HP_SYS_CLKRST_REG_UART3_SCLK_DIV_DENOMINATOR_S)
#define HP_SYS_CLKRST_REG_UART3_SCLK_DIV_DENOMINATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_UART3_SCLK_DIV_DENOMINATOR_S  24

/** HP_SYS_CLKRST_PARLIO_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_PARLIO_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x98)
/** HP_SYS_CLKRST_REG_PARLIO_SYS_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PARLIO_SYS_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_PARLIO_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_PARLIO_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_PARLIO_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_PARLIO_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PARLIO_SYS_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_PARLIO_APB_CLK_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PARLIO_APB_CLK_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_PARLIO_APB_CLK_EN_M  (HP_SYS_CLKRST_REG_PARLIO_APB_CLK_EN_V << HP_SYS_CLKRST_REG_PARLIO_APB_CLK_EN_S)
#define HP_SYS_CLKRST_REG_PARLIO_APB_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PARLIO_APB_CLK_EN_S  1
/** HP_SYS_CLKRST_REG_PARLIO_RST_EN : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PARLIO_RST_EN    (BIT(2))
#define HP_SYS_CLKRST_REG_PARLIO_RST_EN_M  (HP_SYS_CLKRST_REG_PARLIO_RST_EN_V << HP_SYS_CLKRST_REG_PARLIO_RST_EN_S)
#define HP_SYS_CLKRST_REG_PARLIO_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PARLIO_RST_EN_S  2
/** HP_SYS_CLKRST_REG_PARLIO_FORCE_NORST : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PARLIO_FORCE_NORST    (BIT(3))
#define HP_SYS_CLKRST_REG_PARLIO_FORCE_NORST_M  (HP_SYS_CLKRST_REG_PARLIO_FORCE_NORST_V << HP_SYS_CLKRST_REG_PARLIO_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_PARLIO_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_PARLIO_FORCE_NORST_S  3

