espressif/esp-idf/components/soc/esp32s31/register/soc/hp_sys_clkrst_reg.h
/** HP_SYS_CLKRST_PARLIO_RX_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_PARLIO_RX_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x9c)
/** HP_SYS_CLKRST_REG_PARLIO_RX_RST_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PARLIO_RX_RST_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_PARLIO_RX_RST_EN_M  (HP_SYS_CLKRST_REG_PARLIO_RX_RST_EN_V << HP_SYS_CLKRST_REG_PARLIO_RX_RST_EN_S)
#define HP_SYS_CLKRST_REG_PARLIO_RX_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PARLIO_RX_RST_EN_S  0
/** HP_SYS_CLKRST_REG_PARLIO_RX_FORCE_NORST : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PARLIO_RX_FORCE_NORST    (BIT(1))
#define HP_SYS_CLKRST_REG_PARLIO_RX_FORCE_NORST_M  (HP_SYS_CLKRST_REG_PARLIO_RX_FORCE_NORST_V << HP_SYS_CLKRST_REG_PARLIO_RX_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_PARLIO_RX_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_PARLIO_RX_FORCE_NORST_S  1
/** HP_SYS_CLKRST_REG_PARLIO_RX_CLK_SRC_SEL : R/W; bitpos: [3:2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PARLIO_RX_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_PARLIO_RX_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_PARLIO_RX_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_PARLIO_RX_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_PARLIO_RX_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_PARLIO_RX_CLK_SRC_SEL_S  2
/** HP_SYS_CLKRST_REG_PARLIO_RX_CLK_EN : R/W; bitpos: [4]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PARLIO_RX_CLK_EN    (BIT(4))
#define HP_SYS_CLKRST_REG_PARLIO_RX_CLK_EN_M  (HP_SYS_CLKRST_REG_PARLIO_RX_CLK_EN_V << HP_SYS_CLKRST_REG_PARLIO_RX_CLK_EN_S)
#define HP_SYS_CLKRST_REG_PARLIO_RX_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PARLIO_RX_CLK_EN_S  4
/** HP_SYS_CLKRST_REG_PARLIO_RX_CLK_DIV_NUM : R/W; bitpos: [12:5]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PARLIO_RX_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_PARLIO_RX_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_PARLIO_RX_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_PARLIO_RX_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_PARLIO_RX_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_PARLIO_RX_CLK_DIV_NUM_S  5
/** HP_SYS_CLKRST_REG_PARLIO_RX_CLK_DIV_NUMERATOR : R/W; bitpos: [20:13]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PARLIO_RX_CLK_DIV_NUMERATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_PARLIO_RX_CLK_DIV_NUMERATOR_M  (HP_SYS_CLKRST_REG_PARLIO_RX_CLK_DIV_NUMERATOR_V << HP_SYS_CLKRST_REG_PARLIO_RX_CLK_DIV_NUMERATOR_S)
#define HP_SYS_CLKRST_REG_PARLIO_RX_CLK_DIV_NUMERATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_PARLIO_RX_CLK_DIV_NUMERATOR_S  13
/** HP_SYS_CLKRST_REG_PARLIO_RX_CLK_DIV_DENOMINATOR : R/W; bitpos: [28:21]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PARLIO_RX_CLK_DIV_DENOMINATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_PARLIO_RX_CLK_DIV_DENOMINATOR_M  (HP_SYS_CLKRST_REG_PARLIO_RX_CLK_DIV_DENOMINATOR_V << HP_SYS_CLKRST_REG_PARLIO_RX_CLK_DIV_DENOMINATOR_S)
#define HP_SYS_CLKRST_REG_PARLIO_RX_CLK_DIV_DENOMINATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_PARLIO_RX_CLK_DIV_DENOMINATOR_S  21

/** HP_SYS_CLKRST_PARLIO_TX_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_PARLIO_TX_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0xa0)
/** HP_SYS_CLKRST_REG_PARLIO_TX_RST_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PARLIO_TX_RST_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_PARLIO_TX_RST_EN_M  (HP_SYS_CLKRST_REG_PARLIO_TX_RST_EN_V << HP_SYS_CLKRST_REG_PARLIO_TX_RST_EN_S)
#define HP_SYS_CLKRST_REG_PARLIO_TX_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PARLIO_TX_RST_EN_S  0
/** HP_SYS_CLKRST_REG_PARLIO_TX_FORCE_NORST : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PARLIO_TX_FORCE_NORST    (BIT(1))
#define HP_SYS_CLKRST_REG_PARLIO_TX_FORCE_NORST_M  (HP_SYS_CLKRST_REG_PARLIO_TX_FORCE_NORST_V << HP_SYS_CLKRST_REG_PARLIO_TX_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_PARLIO_TX_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_PARLIO_TX_FORCE_NORST_S  1
/** HP_SYS_CLKRST_REG_PARLIO_TX_CLK_SRC_SEL : R/W; bitpos: [3:2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PARLIO_TX_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_PARLIO_TX_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_PARLIO_TX_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_PARLIO_TX_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_PARLIO_TX_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_PARLIO_TX_CLK_SRC_SEL_S  2
/** HP_SYS_CLKRST_REG_PARLIO_TX_CLK_EN : R/W; bitpos: [4]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PARLIO_TX_CLK_EN    (BIT(4))
#define HP_SYS_CLKRST_REG_PARLIO_TX_CLK_EN_M  (HP_SYS_CLKRST_REG_PARLIO_TX_CLK_EN_V << HP_SYS_CLKRST_REG_PARLIO_TX_CLK_EN_S)
#define HP_SYS_CLKRST_REG_PARLIO_TX_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PARLIO_TX_CLK_EN_S  4
/** HP_SYS_CLKRST_REG_PARLIO_TX_CLK_DIV_NUM : R/W; bitpos: [12:5]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PARLIO_TX_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_PARLIO_TX_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_PARLIO_TX_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_PARLIO_TX_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_PARLIO_TX_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_PARLIO_TX_CLK_DIV_NUM_S  5
/** HP_SYS_CLKRST_REG_PARLIO_TX_CLK_DIV_NUMERATOR : R/W; bitpos: [20:13]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PARLIO_TX_CLK_DIV_NUMERATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_PARLIO_TX_CLK_DIV_NUMERATOR_M  (HP_SYS_CLKRST_REG_PARLIO_TX_CLK_DIV_NUMERATOR_V << HP_SYS_CLKRST_REG_PARLIO_TX_CLK_DIV_NUMERATOR_S)
#define HP_SYS_CLKRST_REG_PARLIO_TX_CLK_DIV_NUMERATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_PARLIO_TX_CLK_DIV_NUMERATOR_S  13
/** HP_SYS_CLKRST_REG_PARLIO_TX_CLK_DIV_DENOMINATOR : R/W; bitpos: [28:21]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PARLIO_TX_CLK_DIV_DENOMINATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_PARLIO_TX_CLK_DIV_DENOMINATOR_M  (HP_SYS_CLKRST_REG_PARLIO_TX_CLK_DIV_DENOMINATOR_V << HP_SYS_CLKRST_REG_PARLIO_TX_CLK_DIV_DENOMINATOR_S)
#define HP_SYS_CLKRST_REG_PARLIO_TX_CLK_DIV_DENOMINATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_PARLIO_TX_CLK_DIV_DENOMINATOR_S  21

/** HP_SYS_CLKRST_BITSCRAMBLER_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_BITSCRAMBLER_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0xa4)
/** HP_SYS_CLKRST_REG_BITSCRAMBLER_SYS_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_SYS_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_BITSCRAMBLER_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_BITSCRAMBLER_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_SYS_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_BITSCRAMBLER_RST_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_RST_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_RST_EN_M  (HP_SYS_CLKRST_REG_BITSCRAMBLER_RST_EN_V << HP_SYS_CLKRST_REG_BITSCRAMBLER_RST_EN_S)
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_RST_EN_S  1
/** HP_SYS_CLKRST_REG_BITSCRAMBLER_FORCE_NORST : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_FORCE_NORST    (BIT(2))
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_FORCE_NORST_M  (HP_SYS_CLKRST_REG_BITSCRAMBLER_FORCE_NORST_V << HP_SYS_CLKRST_REG_BITSCRAMBLER_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_FORCE_NORST_S  2
/** HP_SYS_CLKRST_REG_BITSCRAMBLER_RX_SYS_CLK_EN : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_RX_SYS_CLK_EN    (BIT(3))
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_RX_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_BITSCRAMBLER_RX_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_BITSCRAMBLER_RX_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_RX_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_RX_SYS_CLK_EN_S  3
/** HP_SYS_CLKRST_REG_BITSCRAMBLER_RX_RST_EN : R/W; bitpos: [4]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_RX_RST_EN    (BIT(4))
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_RX_RST_EN_M  (HP_SYS_CLKRST_REG_BITSCRAMBLER_RX_RST_EN_V << HP_SYS_CLKRST_REG_BITSCRAMBLER_RX_RST_EN_S)
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_RX_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_RX_RST_EN_S  4
/** HP_SYS_CLKRST_REG_BITSCRAMBLER_RX_FORCE_NORST : R/W; bitpos: [5]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_RX_FORCE_NORST    (BIT(5))
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_RX_FORCE_NORST_M  (HP_SYS_CLKRST_REG_BITSCRAMBLER_RX_FORCE_NORST_V << HP_SYS_CLKRST_REG_BITSCRAMBLER_RX_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_RX_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_RX_FORCE_NORST_S  5
/** HP_SYS_CLKRST_REG_BITSCRAMBLER_TX_SYS_CLK_EN : R/W; bitpos: [6]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_TX_SYS_CLK_EN    (BIT(6))
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_TX_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_BITSCRAMBLER_TX_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_BITSCRAMBLER_TX_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_TX_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_TX_SYS_CLK_EN_S  6
/** HP_SYS_CLKRST_REG_BITSCRAMBLER_TX_RST_EN : R/W; bitpos: [7]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_TX_RST_EN    (BIT(7))
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_TX_RST_EN_M  (HP_SYS_CLKRST_REG_BITSCRAMBLER_TX_RST_EN_V << HP_SYS_CLKRST_REG_BITSCRAMBLER_TX_RST_EN_S)
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_TX_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_TX_RST_EN_S  7
/** HP_SYS_CLKRST_REG_BITSCRAMBLER_TX_FORCE_NORST : R/W; bitpos: [8]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_TX_FORCE_NORST    (BIT(8))
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_TX_FORCE_NORST_M  (HP_SYS_CLKRST_REG_BITSCRAMBLER_TX_FORCE_NORST_V << HP_SYS_CLKRST_REG_BITSCRAMBLER_TX_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_TX_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_BITSCRAMBLER_TX_FORCE_NORST_S  8

/** HP_SYS_CLKRST_ETM_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_ETM_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0xa8)
/** HP_SYS_CLKRST_REG_ETM_APB_CLK_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_ETM_APB_CLK_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_ETM_APB_CLK_EN_M  (HP_SYS_CLKRST_REG_ETM_APB_CLK_EN_V << HP_SYS_CLKRST_REG_ETM_APB_CLK_EN_S)
#define HP_SYS_CLKRST_REG_ETM_APB_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_ETM_APB_CLK_EN_S  1
/** HP_SYS_CLKRST_REG_ETM_RST_EN : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_ETM_RST_EN    (BIT(2))
#define HP_SYS_CLKRST_REG_ETM_RST_EN_M  (HP_SYS_CLKRST_REG_ETM_RST_EN_V << HP_SYS_CLKRST_REG_ETM_RST_EN_S)
#define HP_SYS_CLKRST_REG_ETM_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_ETM_RST_EN_S  2
/** HP_SYS_CLKRST_REG_ETM_FORCE_NORST : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_ETM_FORCE_NORST    (BIT(3))
#define HP_SYS_CLKRST_REG_ETM_FORCE_NORST_M  (HP_SYS_CLKRST_REG_ETM_FORCE_NORST_V << HP_SYS_CLKRST_REG_ETM_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_ETM_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_ETM_FORCE_NORST_S  3
/** HP_SYS_CLKRST_REG_SOC_ETM_CLK_SEL : R/W; bitpos: [5:4]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_SOC_ETM_CLK_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_SOC_ETM_CLK_SEL_M  (HP_SYS_CLKRST_REG_SOC_ETM_CLK_SEL_V << HP_SYS_CLKRST_REG_SOC_ETM_CLK_SEL_S)
#define HP_SYS_CLKRST_REG_SOC_ETM_CLK_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_SOC_ETM_CLK_SEL_S  4
/** HP_SYS_CLKRST_REG_SOC_ETM_CLK_EN : R/W; bitpos: [6]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_SOC_ETM_CLK_EN    (BIT(6))
#define HP_SYS_CLKRST_REG_SOC_ETM_CLK_EN_M  (HP_SYS_CLKRST_REG_SOC_ETM_CLK_EN_V << HP_SYS_CLKRST_REG_SOC_ETM_CLK_EN_S)
#define HP_SYS_CLKRST_REG_SOC_ETM_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_SOC_ETM_CLK_EN_S  6

/** HP_SYS_CLKRST_USB_OTGHS_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_USB_OTGHS_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0xac)
/** HP_SYS_CLKRST_REG_USB_OTGHS_APB_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_USB_OTGHS_APB_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_USB_OTGHS_APB_CLK_EN_M  (HP_SYS_CLKRST_REG_USB_OTGHS_APB_CLK_EN_V << HP_SYS_CLKRST_REG_USB_OTGHS_APB_CLK_EN_S)
#define HP_SYS_CLKRST_REG_USB_OTGHS_APB_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_USB_OTGHS_APB_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_USB_OTGHS_SYS_CLK_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_USB_OTGHS_SYS_CLK_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_USB_OTGHS_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_USB_OTGHS_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_USB_OTGHS_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_USB_OTGHS_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_USB_OTGHS_SYS_CLK_EN_S  1

/** HP_SYS_CLKRST_DMA2D_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_DMA2D_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0xb0)
/** HP_SYS_CLKRST_REG_DMA2D_SYS_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_DMA2D_SYS_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_DMA2D_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_DMA2D_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_DMA2D_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_DMA2D_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_DMA2D_SYS_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_DMA2D_RST_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_DMA2D_RST_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_DMA2D_RST_EN_M  (HP_SYS_CLKRST_REG_DMA2D_RST_EN_V << HP_SYS_CLKRST_REG_DMA2D_RST_EN_S)
#define HP_SYS_CLKRST_REG_DMA2D_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_DMA2D_RST_EN_S  1
/** HP_SYS_CLKRST_REG_DMA2D_FORCE_NORST : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_DMA2D_FORCE_NORST    (BIT(2))
#define HP_SYS_CLKRST_REG_DMA2D_FORCE_NORST_M  (HP_SYS_CLKRST_REG_DMA2D_FORCE_NORST_V << HP_SYS_CLKRST_REG_DMA2D_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_DMA2D_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_DMA2D_FORCE_NORST_S  2

