espressif/esp-idf/components/soc/esp32s31/register/soc/hp_sys_clkrst_reg.h
/** HP_SYS_CLKRST_PPA_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_PPA_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0xb4)
/** HP_SYS_CLKRST_REG_PPA_SYS_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PPA_SYS_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_PPA_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_PPA_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_PPA_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_PPA_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PPA_SYS_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_PPA_RST_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PPA_RST_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_PPA_RST_EN_M  (HP_SYS_CLKRST_REG_PPA_RST_EN_V << HP_SYS_CLKRST_REG_PPA_RST_EN_S)
#define HP_SYS_CLKRST_REG_PPA_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PPA_RST_EN_S  1
/** HP_SYS_CLKRST_REG_PPA_FORCE_NORST : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PPA_FORCE_NORST    (BIT(2))
#define HP_SYS_CLKRST_REG_PPA_FORCE_NORST_M  (HP_SYS_CLKRST_REG_PPA_FORCE_NORST_V << HP_SYS_CLKRST_REG_PPA_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_PPA_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_PPA_FORCE_NORST_S  2

/** HP_SYS_CLKRST_JPEG_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_JPEG_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0xb8)
/** HP_SYS_CLKRST_REG_JPEG_SYS_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_JPEG_SYS_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_JPEG_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_JPEG_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_JPEG_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_JPEG_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_JPEG_SYS_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_JPEG_RST_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_JPEG_RST_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_JPEG_RST_EN_M  (HP_SYS_CLKRST_REG_JPEG_RST_EN_V << HP_SYS_CLKRST_REG_JPEG_RST_EN_S)
#define HP_SYS_CLKRST_REG_JPEG_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_JPEG_RST_EN_S  1
/** HP_SYS_CLKRST_REG_JPEG_FORCE_NORST : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_JPEG_FORCE_NORST    (BIT(2))
#define HP_SYS_CLKRST_REG_JPEG_FORCE_NORST_M  (HP_SYS_CLKRST_REG_JPEG_FORCE_NORST_V << HP_SYS_CLKRST_REG_JPEG_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_JPEG_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_JPEG_FORCE_NORST_S  2

/** HP_SYS_CLKRST_RMT_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_RMT_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0xbc)
/** HP_SYS_CLKRST_REG_RMT_SYS_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_RMT_SYS_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_RMT_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_RMT_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_RMT_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_RMT_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_RMT_SYS_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_RMT_RST_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_RMT_RST_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_RMT_RST_EN_M  (HP_SYS_CLKRST_REG_RMT_RST_EN_V << HP_SYS_CLKRST_REG_RMT_RST_EN_S)
#define HP_SYS_CLKRST_REG_RMT_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_RMT_RST_EN_S  1
/** HP_SYS_CLKRST_REG_RMT_FORCE_NORST : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_RMT_FORCE_NORST    (BIT(2))
#define HP_SYS_CLKRST_REG_RMT_FORCE_NORST_M  (HP_SYS_CLKRST_REG_RMT_FORCE_NORST_V << HP_SYS_CLKRST_REG_RMT_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_RMT_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_RMT_FORCE_NORST_S  2
/** HP_SYS_CLKRST_REG_RMT_CLK_SRC_SEL : R/W; bitpos: [4:3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_RMT_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_RMT_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_RMT_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_RMT_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_RMT_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_RMT_CLK_SRC_SEL_S  3
/** HP_SYS_CLKRST_REG_RMT_CLK_EN : R/W; bitpos: [5]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_RMT_CLK_EN    (BIT(5))
#define HP_SYS_CLKRST_REG_RMT_CLK_EN_M  (HP_SYS_CLKRST_REG_RMT_CLK_EN_V << HP_SYS_CLKRST_REG_RMT_CLK_EN_S)
#define HP_SYS_CLKRST_REG_RMT_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_RMT_CLK_EN_S  5
/** HP_SYS_CLKRST_REG_RMT_CLK_DIV_NUM : R/W; bitpos: [13:6]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_RMT_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_RMT_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_RMT_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_RMT_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_RMT_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_RMT_CLK_DIV_NUM_S  6
/** HP_SYS_CLKRST_REG_RMT_CLK_DIV_NUMERATOR : R/W; bitpos: [21:14]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_RMT_CLK_DIV_NUMERATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_RMT_CLK_DIV_NUMERATOR_M  (HP_SYS_CLKRST_REG_RMT_CLK_DIV_NUMERATOR_V << HP_SYS_CLKRST_REG_RMT_CLK_DIV_NUMERATOR_S)
#define HP_SYS_CLKRST_REG_RMT_CLK_DIV_NUMERATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_RMT_CLK_DIV_NUMERATOR_S  14
/** HP_SYS_CLKRST_REG_RMT_CLK_DIV_DENOMINATOR : R/W; bitpos: [29:22]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_RMT_CLK_DIV_DENOMINATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_RMT_CLK_DIV_DENOMINATOR_M  (HP_SYS_CLKRST_REG_RMT_CLK_DIV_DENOMINATOR_V << HP_SYS_CLKRST_REG_RMT_CLK_DIV_DENOMINATOR_S)
#define HP_SYS_CLKRST_REG_RMT_CLK_DIV_DENOMINATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_RMT_CLK_DIV_DENOMINATOR_S  22

/** HP_SYS_CLKRST_SDIO_HOST_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_SDIO_HOST_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0xc0)
/** HP_SYS_CLKRST_REG_SDMMC_SYS_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_SDMMC_SYS_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_SDMMC_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_SDMMC_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_SDMMC_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_SDMMC_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_SDMMC_SYS_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_SDIO_HS_MODE : R/W; bitpos: [1]; default: 0;
 *  reserved
 */
#define HP_SYS_CLKRST_REG_SDIO_HS_MODE    (BIT(1))
#define HP_SYS_CLKRST_REG_SDIO_HS_MODE_M  (HP_SYS_CLKRST_REG_SDIO_HS_MODE_V << HP_SYS_CLKRST_REG_SDIO_HS_MODE_S)
#define HP_SYS_CLKRST_REG_SDIO_HS_MODE_V  0x00000001U
#define HP_SYS_CLKRST_REG_SDIO_HS_MODE_S  1
/** HP_SYS_CLKRST_REG_SDIO_LS_CLK_SRC_SEL : R/W; bitpos: [2]; default: 0;
 *  reserved
 */
#define HP_SYS_CLKRST_REG_SDIO_LS_CLK_SRC_SEL    (BIT(2))
#define HP_SYS_CLKRST_REG_SDIO_LS_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_SDIO_LS_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_SDIO_LS_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_SDIO_LS_CLK_SRC_SEL_V  0x00000001U
#define HP_SYS_CLKRST_REG_SDIO_LS_CLK_SRC_SEL_S  2
/** HP_SYS_CLKRST_REG_SDIO_LS_CLK_EN : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_SDIO_LS_CLK_EN    (BIT(3))
#define HP_SYS_CLKRST_REG_SDIO_LS_CLK_EN_M  (HP_SYS_CLKRST_REG_SDIO_LS_CLK_EN_V << HP_SYS_CLKRST_REG_SDIO_LS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_SDIO_LS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_SDIO_LS_CLK_EN_S  3
/** HP_SYS_CLKRST_REG_SDIO_LS_CLK_DIV_NUM : R/W; bitpos: [11:4]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_SDIO_LS_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_SDIO_LS_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_SDIO_LS_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_SDIO_LS_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_SDIO_LS_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_SDIO_LS_CLK_DIV_NUM_S  4

/** HP_SYS_CLKRST_SDIO_HOST_FUNC_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_SDIO_HOST_FUNC_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0xc4)
/** HP_SYS_CLKRST_REG_SDIO_LS_CLK_EDGE_CFG_UPDATE : WT; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_SDIO_LS_CLK_EDGE_CFG_UPDATE    (BIT(0))
#define HP_SYS_CLKRST_REG_SDIO_LS_CLK_EDGE_CFG_UPDATE_M  (HP_SYS_CLKRST_REG_SDIO_LS_CLK_EDGE_CFG_UPDATE_V << HP_SYS_CLKRST_REG_SDIO_LS_CLK_EDGE_CFG_UPDATE_S)
#define HP_SYS_CLKRST_REG_SDIO_LS_CLK_EDGE_CFG_UPDATE_V  0x00000001U
#define HP_SYS_CLKRST_REG_SDIO_LS_CLK_EDGE_CFG_UPDATE_S  0
/** HP_SYS_CLKRST_REG_SDIO_LS_CLK_EDGE_L : R/W; bitpos: [4:1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_SDIO_LS_CLK_EDGE_L    0x0000000FU
#define HP_SYS_CLKRST_REG_SDIO_LS_CLK_EDGE_L_M  (HP_SYS_CLKRST_REG_SDIO_LS_CLK_EDGE_L_V << HP_SYS_CLKRST_REG_SDIO_LS_CLK_EDGE_L_S)
#define HP_SYS_CLKRST_REG_SDIO_LS_CLK_EDGE_L_V  0x0000000FU
#define HP_SYS_CLKRST_REG_SDIO_LS_CLK_EDGE_L_S  1
/** HP_SYS_CLKRST_REG_SDIO_LS_CLK_EDGE_H : R/W; bitpos: [8:5]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_SDIO_LS_CLK_EDGE_H    0x0000000FU
#define HP_SYS_CLKRST_REG_SDIO_LS_CLK_EDGE_H_M  (HP_SYS_CLKRST_REG_SDIO_LS_CLK_EDGE_H_V << HP_SYS_CLKRST_REG_SDIO_LS_CLK_EDGE_H_S)
#define HP_SYS_CLKRST_REG_SDIO_LS_CLK_EDGE_H_V  0x0000000FU
#define HP_SYS_CLKRST_REG_SDIO_LS_CLK_EDGE_H_S  5
/** HP_SYS_CLKRST_REG_SDIO_LS_CLK_EDGE_N : R/W; bitpos: [12:9]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_SDIO_LS_CLK_EDGE_N    0x0000000FU
#define HP_SYS_CLKRST_REG_SDIO_LS_CLK_EDGE_N_M  (HP_SYS_CLKRST_REG_SDIO_LS_CLK_EDGE_N_V << HP_SYS_CLKRST_REG_SDIO_LS_CLK_EDGE_N_S)
#define HP_SYS_CLKRST_REG_SDIO_LS_CLK_EDGE_N_V  0x0000000FU
#define HP_SYS_CLKRST_REG_SDIO_LS_CLK_EDGE_N_S  9
/** HP_SYS_CLKRST_REG_SDIO_LS_SLF_CLK_EDGE_SEL : R/W; bitpos: [15:13]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_SDIO_LS_SLF_CLK_EDGE_SEL    0x00000007U
#define HP_SYS_CLKRST_REG_SDIO_LS_SLF_CLK_EDGE_SEL_M  (HP_SYS_CLKRST_REG_SDIO_LS_SLF_CLK_EDGE_SEL_V << HP_SYS_CLKRST_REG_SDIO_LS_SLF_CLK_EDGE_SEL_S)
#define HP_SYS_CLKRST_REG_SDIO_LS_SLF_CLK_EDGE_SEL_V  0x00000007U
#define HP_SYS_CLKRST_REG_SDIO_LS_SLF_CLK_EDGE_SEL_S  13
/** HP_SYS_CLKRST_REG_SDIO_LS_DRV_CLK_EDGE_SEL : R/W; bitpos: [18:16]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_SDIO_LS_DRV_CLK_EDGE_SEL    0x00000007U
#define HP_SYS_CLKRST_REG_SDIO_LS_DRV_CLK_EDGE_SEL_M  (HP_SYS_CLKRST_REG_SDIO_LS_DRV_CLK_EDGE_SEL_V << HP_SYS_CLKRST_REG_SDIO_LS_DRV_CLK_EDGE_SEL_S)
#define HP_SYS_CLKRST_REG_SDIO_LS_DRV_CLK_EDGE_SEL_V  0x00000007U
#define HP_SYS_CLKRST_REG_SDIO_LS_DRV_CLK_EDGE_SEL_S  16
/** HP_SYS_CLKRST_REG_SDIO_LS_SAM_CLK_EDGE_SEL : R/W; bitpos: [21:19]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_SDIO_LS_SAM_CLK_EDGE_SEL    0x00000007U
#define HP_SYS_CLKRST_REG_SDIO_LS_SAM_CLK_EDGE_SEL_M  (HP_SYS_CLKRST_REG_SDIO_LS_SAM_CLK_EDGE_SEL_V << HP_SYS_CLKRST_REG_SDIO_LS_SAM_CLK_EDGE_SEL_S)
#define HP_SYS_CLKRST_REG_SDIO_LS_SAM_CLK_EDGE_SEL_V  0x00000007U
#define HP_SYS_CLKRST_REG_SDIO_LS_SAM_CLK_EDGE_SEL_S  19
/** HP_SYS_CLKRST_REG_SDIO_LS_SLF_CLK_EN : R/W; bitpos: [22]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_SDIO_LS_SLF_CLK_EN    (BIT(22))
#define HP_SYS_CLKRST_REG_SDIO_LS_SLF_CLK_EN_M  (HP_SYS_CLKRST_REG_SDIO_LS_SLF_CLK_EN_V << HP_SYS_CLKRST_REG_SDIO_LS_SLF_CLK_EN_S)
#define HP_SYS_CLKRST_REG_SDIO_LS_SLF_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_SDIO_LS_SLF_CLK_EN_S  22
/** HP_SYS_CLKRST_REG_SDIO_LS_DRV_CLK_EN : R/W; bitpos: [23]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_SDIO_LS_DRV_CLK_EN    (BIT(23))
#define HP_SYS_CLKRST_REG_SDIO_LS_DRV_CLK_EN_M  (HP_SYS_CLKRST_REG_SDIO_LS_DRV_CLK_EN_V << HP_SYS_CLKRST_REG_SDIO_LS_DRV_CLK_EN_S)
#define HP_SYS_CLKRST_REG_SDIO_LS_DRV_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_SDIO_LS_DRV_CLK_EN_S  23
/** HP_SYS_CLKRST_REG_SDIO_LS_SAM_CLK_EN : R/W; bitpos: [24]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_SDIO_LS_SAM_CLK_EN    (BIT(24))
#define HP_SYS_CLKRST_REG_SDIO_LS_SAM_CLK_EN_M  (HP_SYS_CLKRST_REG_SDIO_LS_SAM_CLK_EN_V << HP_SYS_CLKRST_REG_SDIO_LS_SAM_CLK_EN_S)
#define HP_SYS_CLKRST_REG_SDIO_LS_SAM_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_SDIO_LS_SAM_CLK_EN_S  24

/** HP_SYS_CLKRST_EMAC_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_EMAC_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0xc8)
/** HP_SYS_CLKRST_REG_EMAC_SYS_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_EMAC_SYS_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_EMAC_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_EMAC_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_EMAC_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_EMAC_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_EMAC_SYS_CLK_EN_S  0

