espressif/esp-idf/components/soc/esp32s31/register/soc/hp_sys_clkrst_reg.h
/** HP_SYS_CLKRST_DSI_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_DSI_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0xcc)
/** HP_SYS_CLKRST_REG_DSI_SYS_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_DSI_SYS_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_DSI_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_DSI_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_DSI_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_DSI_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_DSI_SYS_CLK_EN_S  0

/** HP_SYS_CLKRST_DSI_PHY_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_DSI_PHY_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0xd0)
/** HP_SYS_CLKRST_REG_MIPI_DSI_DPHY_CLK_SRC_SEL : R/W; bitpos: [1:0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_MIPI_DSI_DPHY_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_MIPI_DSI_DPHY_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_MIPI_DSI_DPHY_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_MIPI_DSI_DPHY_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_MIPI_DSI_DPHY_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_MIPI_DSI_DPHY_CLK_SRC_SEL_S  0
/** HP_SYS_CLKRST_REG_MIPI_DSI_DPHY_CFG_CLK_EN : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_MIPI_DSI_DPHY_CFG_CLK_EN    (BIT(2))
#define HP_SYS_CLKRST_REG_MIPI_DSI_DPHY_CFG_CLK_EN_M  (HP_SYS_CLKRST_REG_MIPI_DSI_DPHY_CFG_CLK_EN_V << HP_SYS_CLKRST_REG_MIPI_DSI_DPHY_CFG_CLK_EN_S)
#define HP_SYS_CLKRST_REG_MIPI_DSI_DPHY_CFG_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_MIPI_DSI_DPHY_CFG_CLK_EN_S  2
/** HP_SYS_CLKRST_REG_MIPI_DSI_DPHY_PLL_REFCLK_EN : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_MIPI_DSI_DPHY_PLL_REFCLK_EN    (BIT(3))
#define HP_SYS_CLKRST_REG_MIPI_DSI_DPHY_PLL_REFCLK_EN_M  (HP_SYS_CLKRST_REG_MIPI_DSI_DPHY_PLL_REFCLK_EN_V << HP_SYS_CLKRST_REG_MIPI_DSI_DPHY_PLL_REFCLK_EN_S)
#define HP_SYS_CLKRST_REG_MIPI_DSI_DPHY_PLL_REFCLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_MIPI_DSI_DPHY_PLL_REFCLK_EN_S  3

/** HP_SYS_CLKRST_DSI_DPI_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_DSI_DPI_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0xd4)
/** HP_SYS_CLKRST_REG_MIPI_DSI_DPICLK_SRC_SEL : R/W; bitpos: [1:0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_MIPI_DSI_DPICLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_MIPI_DSI_DPICLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_MIPI_DSI_DPICLK_SRC_SEL_V << HP_SYS_CLKRST_REG_MIPI_DSI_DPICLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_MIPI_DSI_DPICLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_MIPI_DSI_DPICLK_SRC_SEL_S  0
/** HP_SYS_CLKRST_REG_MIPI_DSI_DPICLK_EN : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_MIPI_DSI_DPICLK_EN    (BIT(2))
#define HP_SYS_CLKRST_REG_MIPI_DSI_DPICLK_EN_M  (HP_SYS_CLKRST_REG_MIPI_DSI_DPICLK_EN_V << HP_SYS_CLKRST_REG_MIPI_DSI_DPICLK_EN_S)
#define HP_SYS_CLKRST_REG_MIPI_DSI_DPICLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_MIPI_DSI_DPICLK_EN_S  2
/** HP_SYS_CLKRST_REG_MIPI_DSI_DPICLK_DIV_NUM : R/W; bitpos: [10:3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_MIPI_DSI_DPICLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_MIPI_DSI_DPICLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_MIPI_DSI_DPICLK_DIV_NUM_V << HP_SYS_CLKRST_REG_MIPI_DSI_DPICLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_MIPI_DSI_DPICLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_MIPI_DSI_DPICLK_DIV_NUM_S  3

/** HP_SYS_CLKRST_MSPI_PAD_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_MSPI_PAD_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0xd8)
/** HP_SYS_CLKRST_REG_MSPI_PAD_CTRL_APB_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_MSPI_PAD_CTRL_APB_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_MSPI_PAD_CTRL_APB_CLK_EN_M  (HP_SYS_CLKRST_REG_MSPI_PAD_CTRL_APB_CLK_EN_V << HP_SYS_CLKRST_REG_MSPI_PAD_CTRL_APB_CLK_EN_S)
#define HP_SYS_CLKRST_REG_MSPI_PAD_CTRL_APB_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_MSPI_PAD_CTRL_APB_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_MSPI_PAD_CTRL_RST_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_MSPI_PAD_CTRL_RST_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_MSPI_PAD_CTRL_RST_EN_M  (HP_SYS_CLKRST_REG_MSPI_PAD_CTRL_RST_EN_V << HP_SYS_CLKRST_REG_MSPI_PAD_CTRL_RST_EN_S)
#define HP_SYS_CLKRST_REG_MSPI_PAD_CTRL_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_MSPI_PAD_CTRL_RST_EN_S  1
/** HP_SYS_CLKRST_REG_MSPI_PAD_CTRL_FORCE_NORST : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_MSPI_PAD_CTRL_FORCE_NORST    (BIT(2))
#define HP_SYS_CLKRST_REG_MSPI_PAD_CTRL_FORCE_NORST_M  (HP_SYS_CLKRST_REG_MSPI_PAD_CTRL_FORCE_NORST_V << HP_SYS_CLKRST_REG_MSPI_PAD_CTRL_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_MSPI_PAD_CTRL_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_MSPI_PAD_CTRL_FORCE_NORST_S  2

/** HP_SYS_CLKRST_I2C0_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_I2C0_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0xdc)
/** HP_SYS_CLKRST_REG_I2C0_APB_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2C0_APB_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_I2C0_APB_CLK_EN_M  (HP_SYS_CLKRST_REG_I2C0_APB_CLK_EN_V << HP_SYS_CLKRST_REG_I2C0_APB_CLK_EN_S)
#define HP_SYS_CLKRST_REG_I2C0_APB_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_I2C0_APB_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_I2C0_RST_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2C0_RST_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_I2C0_RST_EN_M  (HP_SYS_CLKRST_REG_I2C0_RST_EN_V << HP_SYS_CLKRST_REG_I2C0_RST_EN_S)
#define HP_SYS_CLKRST_REG_I2C0_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_I2C0_RST_EN_S  1
/** HP_SYS_CLKRST_REG_I2C0_FORCE_NORST : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2C0_FORCE_NORST    (BIT(2))
#define HP_SYS_CLKRST_REG_I2C0_FORCE_NORST_M  (HP_SYS_CLKRST_REG_I2C0_FORCE_NORST_V << HP_SYS_CLKRST_REG_I2C0_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_I2C0_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_I2C0_FORCE_NORST_S  2
/** HP_SYS_CLKRST_REG_I2C0_CLK_SRC_SEL : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2C0_CLK_SRC_SEL    (BIT(3))
#define HP_SYS_CLKRST_REG_I2C0_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_I2C0_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_I2C0_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_I2C0_CLK_SRC_SEL_V  0x00000001U
#define HP_SYS_CLKRST_REG_I2C0_CLK_SRC_SEL_S  3
/** HP_SYS_CLKRST_REG_I2C0_CLK_EN : R/W; bitpos: [4]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2C0_CLK_EN    (BIT(4))
#define HP_SYS_CLKRST_REG_I2C0_CLK_EN_M  (HP_SYS_CLKRST_REG_I2C0_CLK_EN_V << HP_SYS_CLKRST_REG_I2C0_CLK_EN_S)
#define HP_SYS_CLKRST_REG_I2C0_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_I2C0_CLK_EN_S  4
/** HP_SYS_CLKRST_REG_I2C0_CLK_DIV_NUM : R/W; bitpos: [12:5]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2C0_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_I2C0_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_I2C0_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_I2C0_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_I2C0_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_I2C0_CLK_DIV_NUM_S  5
/** HP_SYS_CLKRST_REG_I2C0_CLK_DIV_NUMERATOR : R/W; bitpos: [20:13]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2C0_CLK_DIV_NUMERATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_I2C0_CLK_DIV_NUMERATOR_M  (HP_SYS_CLKRST_REG_I2C0_CLK_DIV_NUMERATOR_V << HP_SYS_CLKRST_REG_I2C0_CLK_DIV_NUMERATOR_S)
#define HP_SYS_CLKRST_REG_I2C0_CLK_DIV_NUMERATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_I2C0_CLK_DIV_NUMERATOR_S  13
/** HP_SYS_CLKRST_REG_I2C0_CLK_DIV_DENOMINATOR : R/W; bitpos: [28:21]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2C0_CLK_DIV_DENOMINATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_I2C0_CLK_DIV_DENOMINATOR_M  (HP_SYS_CLKRST_REG_I2C0_CLK_DIV_DENOMINATOR_V << HP_SYS_CLKRST_REG_I2C0_CLK_DIV_DENOMINATOR_S)
#define HP_SYS_CLKRST_REG_I2C0_CLK_DIV_DENOMINATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_I2C0_CLK_DIV_DENOMINATOR_S  21

/** HP_SYS_CLKRST_I2C1_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_I2C1_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0xe0)
/** HP_SYS_CLKRST_REG_I2C1_APB_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2C1_APB_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_I2C1_APB_CLK_EN_M  (HP_SYS_CLKRST_REG_I2C1_APB_CLK_EN_V << HP_SYS_CLKRST_REG_I2C1_APB_CLK_EN_S)
#define HP_SYS_CLKRST_REG_I2C1_APB_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_I2C1_APB_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_I2C1_RST_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2C1_RST_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_I2C1_RST_EN_M  (HP_SYS_CLKRST_REG_I2C1_RST_EN_V << HP_SYS_CLKRST_REG_I2C1_RST_EN_S)
#define HP_SYS_CLKRST_REG_I2C1_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_I2C1_RST_EN_S  1
/** HP_SYS_CLKRST_REG_I2C1_FORCE_NORST : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2C1_FORCE_NORST    (BIT(2))
#define HP_SYS_CLKRST_REG_I2C1_FORCE_NORST_M  (HP_SYS_CLKRST_REG_I2C1_FORCE_NORST_V << HP_SYS_CLKRST_REG_I2C1_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_I2C1_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_I2C1_FORCE_NORST_S  2
/** HP_SYS_CLKRST_REG_I2C1_CLK_SRC_SEL : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2C1_CLK_SRC_SEL    (BIT(3))
#define HP_SYS_CLKRST_REG_I2C1_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_I2C1_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_I2C1_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_I2C1_CLK_SRC_SEL_V  0x00000001U
#define HP_SYS_CLKRST_REG_I2C1_CLK_SRC_SEL_S  3
/** HP_SYS_CLKRST_REG_I2C1_CLK_EN : R/W; bitpos: [4]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2C1_CLK_EN    (BIT(4))
#define HP_SYS_CLKRST_REG_I2C1_CLK_EN_M  (HP_SYS_CLKRST_REG_I2C1_CLK_EN_V << HP_SYS_CLKRST_REG_I2C1_CLK_EN_S)
#define HP_SYS_CLKRST_REG_I2C1_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_I2C1_CLK_EN_S  4
/** HP_SYS_CLKRST_REG_I2C1_CLK_DIV_NUM : R/W; bitpos: [12:5]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2C1_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_I2C1_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_I2C1_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_I2C1_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_I2C1_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_I2C1_CLK_DIV_NUM_S  5
/** HP_SYS_CLKRST_REG_I2C1_CLK_DIV_NUMERATOR : R/W; bitpos: [20:13]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2C1_CLK_DIV_NUMERATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_I2C1_CLK_DIV_NUMERATOR_M  (HP_SYS_CLKRST_REG_I2C1_CLK_DIV_NUMERATOR_V << HP_SYS_CLKRST_REG_I2C1_CLK_DIV_NUMERATOR_S)
#define HP_SYS_CLKRST_REG_I2C1_CLK_DIV_NUMERATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_I2C1_CLK_DIV_NUMERATOR_S  13
/** HP_SYS_CLKRST_REG_I2C1_CLK_DIV_DENOMINATOR : R/W; bitpos: [28:21]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2C1_CLK_DIV_DENOMINATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_I2C1_CLK_DIV_DENOMINATOR_M  (HP_SYS_CLKRST_REG_I2C1_CLK_DIV_DENOMINATOR_V << HP_SYS_CLKRST_REG_I2C1_CLK_DIV_DENOMINATOR_S)
#define HP_SYS_CLKRST_REG_I2C1_CLK_DIV_DENOMINATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_I2C1_CLK_DIV_DENOMINATOR_S  21

/** HP_SYS_CLKRST_I2S0_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_I2S0_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0xe4)
/** HP_SYS_CLKRST_REG_I2S0_APB_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2S0_APB_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_I2S0_APB_CLK_EN_M  (HP_SYS_CLKRST_REG_I2S0_APB_CLK_EN_V << HP_SYS_CLKRST_REG_I2S0_APB_CLK_EN_S)
#define HP_SYS_CLKRST_REG_I2S0_APB_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_I2S0_APB_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_I2S0_APB_RST_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2S0_APB_RST_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_I2S0_APB_RST_EN_M  (HP_SYS_CLKRST_REG_I2S0_APB_RST_EN_V << HP_SYS_CLKRST_REG_I2S0_APB_RST_EN_S)
#define HP_SYS_CLKRST_REG_I2S0_APB_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_I2S0_APB_RST_EN_S  1
/** HP_SYS_CLKRST_REG_I2S0_FORCE_NORST : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2S0_FORCE_NORST    (BIT(2))
#define HP_SYS_CLKRST_REG_I2S0_FORCE_NORST_M  (HP_SYS_CLKRST_REG_I2S0_FORCE_NORST_V << HP_SYS_CLKRST_REG_I2S0_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_I2S0_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_I2S0_FORCE_NORST_S  2

/** HP_SYS_CLKRST_I2S0_RX_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_I2S0_RX_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0xe8)
/** HP_SYS_CLKRST_REG_I2S0_RX_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2S0_RX_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_I2S0_RX_CLK_EN_M  (HP_SYS_CLKRST_REG_I2S0_RX_CLK_EN_V << HP_SYS_CLKRST_REG_I2S0_RX_CLK_EN_S)
#define HP_SYS_CLKRST_REG_I2S0_RX_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_I2S0_RX_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_I2S0_RX_CLK_SRC_SEL : R/W; bitpos: [2:1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2S0_RX_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_I2S0_RX_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_I2S0_RX_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_I2S0_RX_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_I2S0_RX_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_I2S0_RX_CLK_SRC_SEL_S  1
/** HP_SYS_CLKRST_REG_I2S0_RX_DIV_N : R/W; bitpos: [10:3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2S0_RX_DIV_N    0x000000FFU
#define HP_SYS_CLKRST_REG_I2S0_RX_DIV_N_M  (HP_SYS_CLKRST_REG_I2S0_RX_DIV_N_V << HP_SYS_CLKRST_REG_I2S0_RX_DIV_N_S)
#define HP_SYS_CLKRST_REG_I2S0_RX_DIV_N_V  0x000000FFU
#define HP_SYS_CLKRST_REG_I2S0_RX_DIV_N_S  3
/** HP_SYS_CLKRST_REG_I2S0_MST_CLK_SEL : R/W; bitpos: [11]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2S0_MST_CLK_SEL    (BIT(11))
#define HP_SYS_CLKRST_REG_I2S0_MST_CLK_SEL_M  (HP_SYS_CLKRST_REG_I2S0_MST_CLK_SEL_V << HP_SYS_CLKRST_REG_I2S0_MST_CLK_SEL_S)
#define HP_SYS_CLKRST_REG_I2S0_MST_CLK_SEL_V  0x00000001U
#define HP_SYS_CLKRST_REG_I2S0_MST_CLK_SEL_S  11

/** HP_SYS_CLKRST_I2S0_RX_DIV_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_I2S0_RX_DIV_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0xec)
/** HP_SYS_CLKRST_REG_I2S0_RX_DIV_X : R/W; bitpos: [8:0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2S0_RX_DIV_X    0x000001FFU
#define HP_SYS_CLKRST_REG_I2S0_RX_DIV_X_M  (HP_SYS_CLKRST_REG_I2S0_RX_DIV_X_V << HP_SYS_CLKRST_REG_I2S0_RX_DIV_X_S)
#define HP_SYS_CLKRST_REG_I2S0_RX_DIV_X_V  0x000001FFU
#define HP_SYS_CLKRST_REG_I2S0_RX_DIV_X_S  0
/** HP_SYS_CLKRST_REG_I2S0_RX_DIV_Y : R/W; bitpos: [17:9]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2S0_RX_DIV_Y    0x000001FFU
#define HP_SYS_CLKRST_REG_I2S0_RX_DIV_Y_M  (HP_SYS_CLKRST_REG_I2S0_RX_DIV_Y_V << HP_SYS_CLKRST_REG_I2S0_RX_DIV_Y_S)
#define HP_SYS_CLKRST_REG_I2S0_RX_DIV_Y_V  0x000001FFU
#define HP_SYS_CLKRST_REG_I2S0_RX_DIV_Y_S  9
/** HP_SYS_CLKRST_REG_I2S0_RX_DIV_Z : R/W; bitpos: [26:18]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2S0_RX_DIV_Z    0x000001FFU
#define HP_SYS_CLKRST_REG_I2S0_RX_DIV_Z_M  (HP_SYS_CLKRST_REG_I2S0_RX_DIV_Z_V << HP_SYS_CLKRST_REG_I2S0_RX_DIV_Z_S)
#define HP_SYS_CLKRST_REG_I2S0_RX_DIV_Z_V  0x000001FFU
#define HP_SYS_CLKRST_REG_I2S0_RX_DIV_Z_S  18
/** HP_SYS_CLKRST_REG_I2S0_RX_DIV_YN1 : R/W; bitpos: [27]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2S0_RX_DIV_YN1    (BIT(27))
#define HP_SYS_CLKRST_REG_I2S0_RX_DIV_YN1_M  (HP_SYS_CLKRST_REG_I2S0_RX_DIV_YN1_V << HP_SYS_CLKRST_REG_I2S0_RX_DIV_YN1_S)
#define HP_SYS_CLKRST_REG_I2S0_RX_DIV_YN1_V  0x00000001U
#define HP_SYS_CLKRST_REG_I2S0_RX_DIV_YN1_S  27

/** HP_SYS_CLKRST_I2S0_TX_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_I2S0_TX_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0xf0)
/** HP_SYS_CLKRST_REG_I2S0_TX_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2S0_TX_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_I2S0_TX_CLK_EN_M  (HP_SYS_CLKRST_REG_I2S0_TX_CLK_EN_V << HP_SYS_CLKRST_REG_I2S0_TX_CLK_EN_S)
#define HP_SYS_CLKRST_REG_I2S0_TX_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_I2S0_TX_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_I2S0_TX_CLK_SRC_SEL : R/W; bitpos: [2:1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2S0_TX_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_I2S0_TX_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_I2S0_TX_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_I2S0_TX_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_I2S0_TX_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_I2S0_TX_CLK_SRC_SEL_S  1
/** HP_SYS_CLKRST_REG_I2S0_TX_DIV_N : R/W; bitpos: [10:3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2S0_TX_DIV_N    0x000000FFU
#define HP_SYS_CLKRST_REG_I2S0_TX_DIV_N_M  (HP_SYS_CLKRST_REG_I2S0_TX_DIV_N_V << HP_SYS_CLKRST_REG_I2S0_TX_DIV_N_S)
#define HP_SYS_CLKRST_REG_I2S0_TX_DIV_N_V  0x000000FFU
#define HP_SYS_CLKRST_REG_I2S0_TX_DIV_N_S  3

/** HP_SYS_CLKRST_I2S0_TX_DIV_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_I2S0_TX_DIV_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0xf4)
/** HP_SYS_CLKRST_REG_I2S0_TX_DIV_X : R/W; bitpos: [8:0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2S0_TX_DIV_X    0x000001FFU
#define HP_SYS_CLKRST_REG_I2S0_TX_DIV_X_M  (HP_SYS_CLKRST_REG_I2S0_TX_DIV_X_V << HP_SYS_CLKRST_REG_I2S0_TX_DIV_X_S)
#define HP_SYS_CLKRST_REG_I2S0_TX_DIV_X_V  0x000001FFU
#define HP_SYS_CLKRST_REG_I2S0_TX_DIV_X_S  0
/** HP_SYS_CLKRST_REG_I2S0_TX_DIV_Y : R/W; bitpos: [17:9]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2S0_TX_DIV_Y    0x000001FFU
#define HP_SYS_CLKRST_REG_I2S0_TX_DIV_Y_M  (HP_SYS_CLKRST_REG_I2S0_TX_DIV_Y_V << HP_SYS_CLKRST_REG_I2S0_TX_DIV_Y_S)
#define HP_SYS_CLKRST_REG_I2S0_TX_DIV_Y_V  0x000001FFU
#define HP_SYS_CLKRST_REG_I2S0_TX_DIV_Y_S  9
/** HP_SYS_CLKRST_REG_I2S0_TX_DIV_Z : R/W; bitpos: [26:18]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2S0_TX_DIV_Z    0x000001FFU
#define HP_SYS_CLKRST_REG_I2S0_TX_DIV_Z_M  (HP_SYS_CLKRST_REG_I2S0_TX_DIV_Z_V << HP_SYS_CLKRST_REG_I2S0_TX_DIV_Z_S)
#define HP_SYS_CLKRST_REG_I2S0_TX_DIV_Z_V  0x000001FFU
#define HP_SYS_CLKRST_REG_I2S0_TX_DIV_Z_S  18
/** HP_SYS_CLKRST_REG_I2S0_TX_DIV_YN1 : R/W; bitpos: [27]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2S0_TX_DIV_YN1    (BIT(27))
#define HP_SYS_CLKRST_REG_I2S0_TX_DIV_YN1_M  (HP_SYS_CLKRST_REG_I2S0_TX_DIV_YN1_V << HP_SYS_CLKRST_REG_I2S0_TX_DIV_YN1_S)
#define HP_SYS_CLKRST_REG_I2S0_TX_DIV_YN1_V  0x00000001U
#define HP_SYS_CLKRST_REG_I2S0_TX_DIV_YN1_S  27

/** HP_SYS_CLKRST_I2S1_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_I2S1_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0xf8)
/** HP_SYS_CLKRST_REG_I2S1_APB_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2S1_APB_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_I2S1_APB_CLK_EN_M  (HP_SYS_CLKRST_REG_I2S1_APB_CLK_EN_V << HP_SYS_CLKRST_REG_I2S1_APB_CLK_EN_S)
#define HP_SYS_CLKRST_REG_I2S1_APB_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_I2S1_APB_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_I2S1_APB_RST_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2S1_APB_RST_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_I2S1_APB_RST_EN_M  (HP_SYS_CLKRST_REG_I2S1_APB_RST_EN_V << HP_SYS_CLKRST_REG_I2S1_APB_RST_EN_S)
#define HP_SYS_CLKRST_REG_I2S1_APB_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_I2S1_APB_RST_EN_S  1
/** HP_SYS_CLKRST_REG_I2S1_FORCE_NORST : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2S1_FORCE_NORST    (BIT(2))
#define HP_SYS_CLKRST_REG_I2S1_FORCE_NORST_M  (HP_SYS_CLKRST_REG_I2S1_FORCE_NORST_V << HP_SYS_CLKRST_REG_I2S1_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_I2S1_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_I2S1_FORCE_NORST_S  2

/** HP_SYS_CLKRST_I2S1_RX_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_I2S1_RX_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0xfc)
/** HP_SYS_CLKRST_REG_I2S1_RX_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2S1_RX_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_I2S1_RX_CLK_EN_M  (HP_SYS_CLKRST_REG_I2S1_RX_CLK_EN_V << HP_SYS_CLKRST_REG_I2S1_RX_CLK_EN_S)
#define HP_SYS_CLKRST_REG_I2S1_RX_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_I2S1_RX_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_I2S1_RX_CLK_SRC_SEL : R/W; bitpos: [2:1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2S1_RX_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_I2S1_RX_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_I2S1_RX_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_I2S1_RX_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_I2S1_RX_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_I2S1_RX_CLK_SRC_SEL_S  1
/** HP_SYS_CLKRST_REG_I2S1_RX_DIV_N : R/W; bitpos: [10:3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2S1_RX_DIV_N    0x000000FFU
#define HP_SYS_CLKRST_REG_I2S1_RX_DIV_N_M  (HP_SYS_CLKRST_REG_I2S1_RX_DIV_N_V << HP_SYS_CLKRST_REG_I2S1_RX_DIV_N_S)
#define HP_SYS_CLKRST_REG_I2S1_RX_DIV_N_V  0x000000FFU
#define HP_SYS_CLKRST_REG_I2S1_RX_DIV_N_S  3
/** HP_SYS_CLKRST_REG_I2S1_MST_CLK_SEL : R/W; bitpos: [11]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2S1_MST_CLK_SEL    (BIT(11))
#define HP_SYS_CLKRST_REG_I2S1_MST_CLK_SEL_M  (HP_SYS_CLKRST_REG_I2S1_MST_CLK_SEL_V << HP_SYS_CLKRST_REG_I2S1_MST_CLK_SEL_S)
#define HP_SYS_CLKRST_REG_I2S1_MST_CLK_SEL_V  0x00000001U
#define HP_SYS_CLKRST_REG_I2S1_MST_CLK_SEL_S  11

