espressif/esp-idf/components/soc/esp32s31/register/soc/hp_sys_clkrst_reg.h
/** HP_SYS_CLKRST_I2S1_RX_DIV_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_I2S1_RX_DIV_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x100)
/** HP_SYS_CLKRST_REG_I2S1_RX_DIV_X : R/W; bitpos: [8:0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2S1_RX_DIV_X    0x000001FFU
#define HP_SYS_CLKRST_REG_I2S1_RX_DIV_X_M  (HP_SYS_CLKRST_REG_I2S1_RX_DIV_X_V << HP_SYS_CLKRST_REG_I2S1_RX_DIV_X_S)
#define HP_SYS_CLKRST_REG_I2S1_RX_DIV_X_V  0x000001FFU
#define HP_SYS_CLKRST_REG_I2S1_RX_DIV_X_S  0
/** HP_SYS_CLKRST_REG_I2S1_RX_DIV_Y : R/W; bitpos: [17:9]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2S1_RX_DIV_Y    0x000001FFU
#define HP_SYS_CLKRST_REG_I2S1_RX_DIV_Y_M  (HP_SYS_CLKRST_REG_I2S1_RX_DIV_Y_V << HP_SYS_CLKRST_REG_I2S1_RX_DIV_Y_S)
#define HP_SYS_CLKRST_REG_I2S1_RX_DIV_Y_V  0x000001FFU
#define HP_SYS_CLKRST_REG_I2S1_RX_DIV_Y_S  9
/** HP_SYS_CLKRST_REG_I2S1_RX_DIV_Z : R/W; bitpos: [26:18]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2S1_RX_DIV_Z    0x000001FFU
#define HP_SYS_CLKRST_REG_I2S1_RX_DIV_Z_M  (HP_SYS_CLKRST_REG_I2S1_RX_DIV_Z_V << HP_SYS_CLKRST_REG_I2S1_RX_DIV_Z_S)
#define HP_SYS_CLKRST_REG_I2S1_RX_DIV_Z_V  0x000001FFU
#define HP_SYS_CLKRST_REG_I2S1_RX_DIV_Z_S  18
/** HP_SYS_CLKRST_REG_I2S1_RX_DIV_YN1 : R/W; bitpos: [27]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2S1_RX_DIV_YN1    (BIT(27))
#define HP_SYS_CLKRST_REG_I2S1_RX_DIV_YN1_M  (HP_SYS_CLKRST_REG_I2S1_RX_DIV_YN1_V << HP_SYS_CLKRST_REG_I2S1_RX_DIV_YN1_S)
#define HP_SYS_CLKRST_REG_I2S1_RX_DIV_YN1_V  0x00000001U
#define HP_SYS_CLKRST_REG_I2S1_RX_DIV_YN1_S  27

/** HP_SYS_CLKRST_I2S1_TX_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_I2S1_TX_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x104)
/** HP_SYS_CLKRST_REG_I2S1_TX_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2S1_TX_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_I2S1_TX_CLK_EN_M  (HP_SYS_CLKRST_REG_I2S1_TX_CLK_EN_V << HP_SYS_CLKRST_REG_I2S1_TX_CLK_EN_S)
#define HP_SYS_CLKRST_REG_I2S1_TX_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_I2S1_TX_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_I2S1_TX_CLK_SRC_SEL : R/W; bitpos: [2:1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2S1_TX_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_I2S1_TX_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_I2S1_TX_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_I2S1_TX_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_I2S1_TX_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_I2S1_TX_CLK_SRC_SEL_S  1
/** HP_SYS_CLKRST_REG_I2S1_TX_DIV_N : R/W; bitpos: [10:3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2S1_TX_DIV_N    0x000000FFU
#define HP_SYS_CLKRST_REG_I2S1_TX_DIV_N_M  (HP_SYS_CLKRST_REG_I2S1_TX_DIV_N_V << HP_SYS_CLKRST_REG_I2S1_TX_DIV_N_S)
#define HP_SYS_CLKRST_REG_I2S1_TX_DIV_N_V  0x000000FFU
#define HP_SYS_CLKRST_REG_I2S1_TX_DIV_N_S  3

/** HP_SYS_CLKRST_I2S1_TX_DIV_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_I2S1_TX_DIV_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x108)
/** HP_SYS_CLKRST_REG_I2S1_TX_DIV_X : R/W; bitpos: [8:0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2S1_TX_DIV_X    0x000001FFU
#define HP_SYS_CLKRST_REG_I2S1_TX_DIV_X_M  (HP_SYS_CLKRST_REG_I2S1_TX_DIV_X_V << HP_SYS_CLKRST_REG_I2S1_TX_DIV_X_S)
#define HP_SYS_CLKRST_REG_I2S1_TX_DIV_X_V  0x000001FFU
#define HP_SYS_CLKRST_REG_I2S1_TX_DIV_X_S  0
/** HP_SYS_CLKRST_REG_I2S1_TX_DIV_Y : R/W; bitpos: [17:9]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2S1_TX_DIV_Y    0x000001FFU
#define HP_SYS_CLKRST_REG_I2S1_TX_DIV_Y_M  (HP_SYS_CLKRST_REG_I2S1_TX_DIV_Y_V << HP_SYS_CLKRST_REG_I2S1_TX_DIV_Y_S)
#define HP_SYS_CLKRST_REG_I2S1_TX_DIV_Y_V  0x000001FFU
#define HP_SYS_CLKRST_REG_I2S1_TX_DIV_Y_S  9
/** HP_SYS_CLKRST_REG_I2S1_TX_DIV_Z : R/W; bitpos: [26:18]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2S1_TX_DIV_Z    0x000001FFU
#define HP_SYS_CLKRST_REG_I2S1_TX_DIV_Z_M  (HP_SYS_CLKRST_REG_I2S1_TX_DIV_Z_V << HP_SYS_CLKRST_REG_I2S1_TX_DIV_Z_S)
#define HP_SYS_CLKRST_REG_I2S1_TX_DIV_Z_V  0x000001FFU
#define HP_SYS_CLKRST_REG_I2S1_TX_DIV_Z_S  18
/** HP_SYS_CLKRST_REG_I2S1_TX_DIV_YN1 : R/W; bitpos: [27]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_I2S1_TX_DIV_YN1    (BIT(27))
#define HP_SYS_CLKRST_REG_I2S1_TX_DIV_YN1_M  (HP_SYS_CLKRST_REG_I2S1_TX_DIV_YN1_V << HP_SYS_CLKRST_REG_I2S1_TX_DIV_YN1_S)
#define HP_SYS_CLKRST_REG_I2S1_TX_DIV_YN1_V  0x00000001U
#define HP_SYS_CLKRST_REG_I2S1_TX_DIV_YN1_S  27

/** HP_SYS_CLKRST_TWAI0_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_TWAI0_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x10c)
/** HP_SYS_CLKRST_REG_TWAI0_APB_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TWAI0_APB_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_TWAI0_APB_CLK_EN_M  (HP_SYS_CLKRST_REG_TWAI0_APB_CLK_EN_V << HP_SYS_CLKRST_REG_TWAI0_APB_CLK_EN_S)
#define HP_SYS_CLKRST_REG_TWAI0_APB_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TWAI0_APB_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_TWAI0_CLK_SRC_SEL : R/W; bitpos: [2:1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TWAI0_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_TWAI0_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_TWAI0_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_TWAI0_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_TWAI0_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_TWAI0_CLK_SRC_SEL_S  1
/** HP_SYS_CLKRST_REG_TWAI0_CLK_EN : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TWAI0_CLK_EN    (BIT(3))
#define HP_SYS_CLKRST_REG_TWAI0_CLK_EN_M  (HP_SYS_CLKRST_REG_TWAI0_CLK_EN_V << HP_SYS_CLKRST_REG_TWAI0_CLK_EN_S)
#define HP_SYS_CLKRST_REG_TWAI0_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TWAI0_CLK_EN_S  3
/** HP_SYS_CLKRST_REG_TWAI0_RST_EN : R/W; bitpos: [4]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TWAI0_RST_EN    (BIT(4))
#define HP_SYS_CLKRST_REG_TWAI0_RST_EN_M  (HP_SYS_CLKRST_REG_TWAI0_RST_EN_V << HP_SYS_CLKRST_REG_TWAI0_RST_EN_S)
#define HP_SYS_CLKRST_REG_TWAI0_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TWAI0_RST_EN_S  4
/** HP_SYS_CLKRST_REG_TWAI0_FORCE_NORST : R/W; bitpos: [5]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TWAI0_FORCE_NORST    (BIT(5))
#define HP_SYS_CLKRST_REG_TWAI0_FORCE_NORST_M  (HP_SYS_CLKRST_REG_TWAI0_FORCE_NORST_V << HP_SYS_CLKRST_REG_TWAI0_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_TWAI0_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_TWAI0_FORCE_NORST_S  5

