espressif/esp-idf/components/soc/esp32s31/register/soc/hp_sys_clkrst_reg.h
/** HP_SYS_CLKRST_TWAI1_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_TWAI1_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x110)
/** HP_SYS_CLKRST_REG_TWAI1_APB_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TWAI1_APB_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_TWAI1_APB_CLK_EN_M  (HP_SYS_CLKRST_REG_TWAI1_APB_CLK_EN_V << HP_SYS_CLKRST_REG_TWAI1_APB_CLK_EN_S)
#define HP_SYS_CLKRST_REG_TWAI1_APB_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TWAI1_APB_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_TWAI1_CLK_SRC_SEL : R/W; bitpos: [2:1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TWAI1_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_TWAI1_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_TWAI1_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_TWAI1_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_TWAI1_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_TWAI1_CLK_SRC_SEL_S  1
/** HP_SYS_CLKRST_REG_TWAI1_CLK_EN : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TWAI1_CLK_EN    (BIT(3))
#define HP_SYS_CLKRST_REG_TWAI1_CLK_EN_M  (HP_SYS_CLKRST_REG_TWAI1_CLK_EN_V << HP_SYS_CLKRST_REG_TWAI1_CLK_EN_S)
#define HP_SYS_CLKRST_REG_TWAI1_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TWAI1_CLK_EN_S  3
/** HP_SYS_CLKRST_REG_TWAI1_RST_EN : R/W; bitpos: [4]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TWAI1_RST_EN    (BIT(4))
#define HP_SYS_CLKRST_REG_TWAI1_RST_EN_M  (HP_SYS_CLKRST_REG_TWAI1_RST_EN_V << HP_SYS_CLKRST_REG_TWAI1_RST_EN_S)
#define HP_SYS_CLKRST_REG_TWAI1_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TWAI1_RST_EN_S  4
/** HP_SYS_CLKRST_REG_TWAI1_FORCE_NORST : R/W; bitpos: [5]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TWAI1_FORCE_NORST    (BIT(5))
#define HP_SYS_CLKRST_REG_TWAI1_FORCE_NORST_M  (HP_SYS_CLKRST_REG_TWAI1_FORCE_NORST_V << HP_SYS_CLKRST_REG_TWAI1_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_TWAI1_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_TWAI1_FORCE_NORST_S  5

/** HP_SYS_CLKRST_TIMERGRP0_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_TIMERGRP0_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x114)
/** HP_SYS_CLKRST_REG_TIMERGRP0_APB_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TIMERGRP0_APB_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_TIMERGRP0_APB_CLK_EN_M  (HP_SYS_CLKRST_REG_TIMERGRP0_APB_CLK_EN_V << HP_SYS_CLKRST_REG_TIMERGRP0_APB_CLK_EN_S)
#define HP_SYS_CLKRST_REG_TIMERGRP0_APB_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TIMERGRP0_APB_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_TIMERGRP0_RST_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TIMERGRP0_RST_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_TIMERGRP0_RST_EN_M  (HP_SYS_CLKRST_REG_TIMERGRP0_RST_EN_V << HP_SYS_CLKRST_REG_TIMERGRP0_RST_EN_S)
#define HP_SYS_CLKRST_REG_TIMERGRP0_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TIMERGRP0_RST_EN_S  1
/** HP_SYS_CLKRST_REG_TIMERGRP0_FORCE_NORST : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TIMERGRP0_FORCE_NORST    (BIT(2))
#define HP_SYS_CLKRST_REG_TIMERGRP0_FORCE_NORST_M  (HP_SYS_CLKRST_REG_TIMERGRP0_FORCE_NORST_V << HP_SYS_CLKRST_REG_TIMERGRP0_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_TIMERGRP0_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_TIMERGRP0_FORCE_NORST_S  2
/** HP_SYS_CLKRST_REG_TIMERGRP0_T0_SRC_SEL : R/W; bitpos: [4:3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TIMERGRP0_T0_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_TIMERGRP0_T0_SRC_SEL_M  (HP_SYS_CLKRST_REG_TIMERGRP0_T0_SRC_SEL_V << HP_SYS_CLKRST_REG_TIMERGRP0_T0_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_TIMERGRP0_T0_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_TIMERGRP0_T0_SRC_SEL_S  3
/** HP_SYS_CLKRST_REG_TIMERGRP0_T0_CLK_EN : R/W; bitpos: [5]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TIMERGRP0_T0_CLK_EN    (BIT(5))
#define HP_SYS_CLKRST_REG_TIMERGRP0_T0_CLK_EN_M  (HP_SYS_CLKRST_REG_TIMERGRP0_T0_CLK_EN_V << HP_SYS_CLKRST_REG_TIMERGRP0_T0_CLK_EN_S)
#define HP_SYS_CLKRST_REG_TIMERGRP0_T0_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TIMERGRP0_T0_CLK_EN_S  5
/** HP_SYS_CLKRST_REG_TIMERGRP0_T1_SRC_SEL : R/W; bitpos: [7:6]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TIMERGRP0_T1_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_TIMERGRP0_T1_SRC_SEL_M  (HP_SYS_CLKRST_REG_TIMERGRP0_T1_SRC_SEL_V << HP_SYS_CLKRST_REG_TIMERGRP0_T1_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_TIMERGRP0_T1_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_TIMERGRP0_T1_SRC_SEL_S  6
/** HP_SYS_CLKRST_REG_TIMERGRP0_T1_CLK_EN : R/W; bitpos: [8]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TIMERGRP0_T1_CLK_EN    (BIT(8))
#define HP_SYS_CLKRST_REG_TIMERGRP0_T1_CLK_EN_M  (HP_SYS_CLKRST_REG_TIMERGRP0_T1_CLK_EN_V << HP_SYS_CLKRST_REG_TIMERGRP0_T1_CLK_EN_S)
#define HP_SYS_CLKRST_REG_TIMERGRP0_T1_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TIMERGRP0_T1_CLK_EN_S  8
/** HP_SYS_CLKRST_REG_TIMERGRP0_WDT_SRC_SEL : R/W; bitpos: [10:9]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TIMERGRP0_WDT_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_TIMERGRP0_WDT_SRC_SEL_M  (HP_SYS_CLKRST_REG_TIMERGRP0_WDT_SRC_SEL_V << HP_SYS_CLKRST_REG_TIMERGRP0_WDT_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_TIMERGRP0_WDT_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_TIMERGRP0_WDT_SRC_SEL_S  9
/** HP_SYS_CLKRST_REG_TIMERGRP0_WDT_CLK_EN : R/W; bitpos: [11]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TIMERGRP0_WDT_CLK_EN    (BIT(11))
#define HP_SYS_CLKRST_REG_TIMERGRP0_WDT_CLK_EN_M  (HP_SYS_CLKRST_REG_TIMERGRP0_WDT_CLK_EN_V << HP_SYS_CLKRST_REG_TIMERGRP0_WDT_CLK_EN_S)
#define HP_SYS_CLKRST_REG_TIMERGRP0_WDT_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TIMERGRP0_WDT_CLK_EN_S  11

/** HP_SYS_CLKRST_TIMERGRP0_TGRT_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_TIMERGRP0_TGRT_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x118)
/** HP_SYS_CLKRST_REG_TIMERGRP0_TGRT_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TIMERGRP0_TGRT_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_TIMERGRP0_TGRT_CLK_EN_M  (HP_SYS_CLKRST_REG_TIMERGRP0_TGRT_CLK_EN_V << HP_SYS_CLKRST_REG_TIMERGRP0_TGRT_CLK_EN_S)
#define HP_SYS_CLKRST_REG_TIMERGRP0_TGRT_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TIMERGRP0_TGRT_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_TIMERGRP0_TGRT_CLK_SRC_SEL : R/W; bitpos: [4:1]; default: 8;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TIMERGRP0_TGRT_CLK_SRC_SEL    0x0000000FU
#define HP_SYS_CLKRST_REG_TIMERGRP0_TGRT_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_TIMERGRP0_TGRT_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_TIMERGRP0_TGRT_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_TIMERGRP0_TGRT_CLK_SRC_SEL_V  0x0000000FU
#define HP_SYS_CLKRST_REG_TIMERGRP0_TGRT_CLK_SRC_SEL_S  1
/** HP_SYS_CLKRST_REG_TIMERGRP0_TGRT_CLK_DIV_NUM : R/W; bitpos: [20:5]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TIMERGRP0_TGRT_CLK_DIV_NUM    0x0000FFFFU
#define HP_SYS_CLKRST_REG_TIMERGRP0_TGRT_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_TIMERGRP0_TGRT_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_TIMERGRP0_TGRT_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_TIMERGRP0_TGRT_CLK_DIV_NUM_V  0x0000FFFFU
#define HP_SYS_CLKRST_REG_TIMERGRP0_TGRT_CLK_DIV_NUM_S  5

