espressif/esp-idf/components/soc/esp32s31/register/soc/hp_sys_clkrst_reg.h
/** HP_SYS_CLKRST_TIMERGRP1_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_TIMERGRP1_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x11c)
/** HP_SYS_CLKRST_REG_TIMERGRP1_APB_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TIMERGRP1_APB_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_TIMERGRP1_APB_CLK_EN_M  (HP_SYS_CLKRST_REG_TIMERGRP1_APB_CLK_EN_V << HP_SYS_CLKRST_REG_TIMERGRP1_APB_CLK_EN_S)
#define HP_SYS_CLKRST_REG_TIMERGRP1_APB_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TIMERGRP1_APB_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_TIMERGRP1_RST_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TIMERGRP1_RST_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_TIMERGRP1_RST_EN_M  (HP_SYS_CLKRST_REG_TIMERGRP1_RST_EN_V << HP_SYS_CLKRST_REG_TIMERGRP1_RST_EN_S)
#define HP_SYS_CLKRST_REG_TIMERGRP1_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TIMERGRP1_RST_EN_S  1
/** HP_SYS_CLKRST_REG_TIMERGRP1_FORCE_NORST : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TIMERGRP1_FORCE_NORST    (BIT(2))
#define HP_SYS_CLKRST_REG_TIMERGRP1_FORCE_NORST_M  (HP_SYS_CLKRST_REG_TIMERGRP1_FORCE_NORST_V << HP_SYS_CLKRST_REG_TIMERGRP1_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_TIMERGRP1_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_TIMERGRP1_FORCE_NORST_S  2
/** HP_SYS_CLKRST_REG_TIMERGRP1_T0_SRC_SEL : R/W; bitpos: [4:3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TIMERGRP1_T0_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_TIMERGRP1_T0_SRC_SEL_M  (HP_SYS_CLKRST_REG_TIMERGRP1_T0_SRC_SEL_V << HP_SYS_CLKRST_REG_TIMERGRP1_T0_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_TIMERGRP1_T0_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_TIMERGRP1_T0_SRC_SEL_S  3
/** HP_SYS_CLKRST_REG_TIMERGRP1_T0_CLK_EN : R/W; bitpos: [5]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TIMERGRP1_T0_CLK_EN    (BIT(5))
#define HP_SYS_CLKRST_REG_TIMERGRP1_T0_CLK_EN_M  (HP_SYS_CLKRST_REG_TIMERGRP1_T0_CLK_EN_V << HP_SYS_CLKRST_REG_TIMERGRP1_T0_CLK_EN_S)
#define HP_SYS_CLKRST_REG_TIMERGRP1_T0_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TIMERGRP1_T0_CLK_EN_S  5
/** HP_SYS_CLKRST_REG_TIMERGRP1_T1_SRC_SEL : R/W; bitpos: [7:6]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TIMERGRP1_T1_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_TIMERGRP1_T1_SRC_SEL_M  (HP_SYS_CLKRST_REG_TIMERGRP1_T1_SRC_SEL_V << HP_SYS_CLKRST_REG_TIMERGRP1_T1_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_TIMERGRP1_T1_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_TIMERGRP1_T1_SRC_SEL_S  6
/** HP_SYS_CLKRST_REG_TIMERGRP1_T1_CLK_EN : R/W; bitpos: [8]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TIMERGRP1_T1_CLK_EN    (BIT(8))
#define HP_SYS_CLKRST_REG_TIMERGRP1_T1_CLK_EN_M  (HP_SYS_CLKRST_REG_TIMERGRP1_T1_CLK_EN_V << HP_SYS_CLKRST_REG_TIMERGRP1_T1_CLK_EN_S)
#define HP_SYS_CLKRST_REG_TIMERGRP1_T1_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TIMERGRP1_T1_CLK_EN_S  8
/** HP_SYS_CLKRST_REG_TIMERGRP1_WDT_SRC_SEL : R/W; bitpos: [10:9]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TIMERGRP1_WDT_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_TIMERGRP1_WDT_SRC_SEL_M  (HP_SYS_CLKRST_REG_TIMERGRP1_WDT_SRC_SEL_V << HP_SYS_CLKRST_REG_TIMERGRP1_WDT_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_TIMERGRP1_WDT_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_TIMERGRP1_WDT_SRC_SEL_S  9
/** HP_SYS_CLKRST_REG_TIMERGRP1_WDT_CLK_EN : R/W; bitpos: [11]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TIMERGRP1_WDT_CLK_EN    (BIT(11))
#define HP_SYS_CLKRST_REG_TIMERGRP1_WDT_CLK_EN_M  (HP_SYS_CLKRST_REG_TIMERGRP1_WDT_CLK_EN_V << HP_SYS_CLKRST_REG_TIMERGRP1_WDT_CLK_EN_S)
#define HP_SYS_CLKRST_REG_TIMERGRP1_WDT_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TIMERGRP1_WDT_CLK_EN_S  11

/** HP_SYS_CLKRST_SYSTIMER_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_SYSTIMER_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x120)
/** HP_SYS_CLKRST_REG_SYSTIMER_APB_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_SYSTIMER_APB_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_SYSTIMER_APB_CLK_EN_M  (HP_SYS_CLKRST_REG_SYSTIMER_APB_CLK_EN_V << HP_SYS_CLKRST_REG_SYSTIMER_APB_CLK_EN_S)
#define HP_SYS_CLKRST_REG_SYSTIMER_APB_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_SYSTIMER_APB_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_SYSTIMER_RST_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_SYSTIMER_RST_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_SYSTIMER_RST_EN_M  (HP_SYS_CLKRST_REG_SYSTIMER_RST_EN_V << HP_SYS_CLKRST_REG_SYSTIMER_RST_EN_S)
#define HP_SYS_CLKRST_REG_SYSTIMER_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_SYSTIMER_RST_EN_S  1
/** HP_SYS_CLKRST_REG_SYSTIMER_FORCE_NORST : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_SYSTIMER_FORCE_NORST    (BIT(2))
#define HP_SYS_CLKRST_REG_SYSTIMER_FORCE_NORST_M  (HP_SYS_CLKRST_REG_SYSTIMER_FORCE_NORST_V << HP_SYS_CLKRST_REG_SYSTIMER_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_SYSTIMER_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_SYSTIMER_FORCE_NORST_S  2
/** HP_SYS_CLKRST_REG_SYSTIMER_CLK_SRC_SEL : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_SYSTIMER_CLK_SRC_SEL    (BIT(3))
#define HP_SYS_CLKRST_REG_SYSTIMER_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_SYSTIMER_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_SYSTIMER_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_SYSTIMER_CLK_SRC_SEL_V  0x00000001U
#define HP_SYS_CLKRST_REG_SYSTIMER_CLK_SRC_SEL_S  3
/** HP_SYS_CLKRST_REG_SYSTIMER_CLK_EN : R/W; bitpos: [4]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_SYSTIMER_CLK_EN    (BIT(4))
#define HP_SYS_CLKRST_REG_SYSTIMER_CLK_EN_M  (HP_SYS_CLKRST_REG_SYSTIMER_CLK_EN_V << HP_SYS_CLKRST_REG_SYSTIMER_CLK_EN_S)
#define HP_SYS_CLKRST_REG_SYSTIMER_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_SYSTIMER_CLK_EN_S  4

/** HP_SYS_CLKRST_MCPWM0_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_MCPWM0_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x124)
/** HP_SYS_CLKRST_REG_MCPWM0_APB_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_MCPWM0_APB_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_MCPWM0_APB_CLK_EN_M  (HP_SYS_CLKRST_REG_MCPWM0_APB_CLK_EN_V << HP_SYS_CLKRST_REG_MCPWM0_APB_CLK_EN_S)
#define HP_SYS_CLKRST_REG_MCPWM0_APB_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_MCPWM0_APB_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_MCPWM0_RST_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_MCPWM0_RST_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_MCPWM0_RST_EN_M  (HP_SYS_CLKRST_REG_MCPWM0_RST_EN_V << HP_SYS_CLKRST_REG_MCPWM0_RST_EN_S)
#define HP_SYS_CLKRST_REG_MCPWM0_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_MCPWM0_RST_EN_S  1
/** HP_SYS_CLKRST_REG_MCPWM0_FORCE_NORST : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_MCPWM0_FORCE_NORST    (BIT(2))
#define HP_SYS_CLKRST_REG_MCPWM0_FORCE_NORST_M  (HP_SYS_CLKRST_REG_MCPWM0_FORCE_NORST_V << HP_SYS_CLKRST_REG_MCPWM0_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_MCPWM0_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_MCPWM0_FORCE_NORST_S  2
/** HP_SYS_CLKRST_REG_MCPWM0_CLK_SRC_SEL : R/W; bitpos: [4:3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_MCPWM0_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_MCPWM0_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_MCPWM0_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_MCPWM0_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_MCPWM0_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_MCPWM0_CLK_SRC_SEL_S  3
/** HP_SYS_CLKRST_REG_MCPWM0_CLK_EN : R/W; bitpos: [5]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_MCPWM0_CLK_EN    (BIT(5))
#define HP_SYS_CLKRST_REG_MCPWM0_CLK_EN_M  (HP_SYS_CLKRST_REG_MCPWM0_CLK_EN_V << HP_SYS_CLKRST_REG_MCPWM0_CLK_EN_S)
#define HP_SYS_CLKRST_REG_MCPWM0_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_MCPWM0_CLK_EN_S  5
/** HP_SYS_CLKRST_REG_MCPWM0_CLK_DIV_NUM : R/W; bitpos: [13:6]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_MCPWM0_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_MCPWM0_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_MCPWM0_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_MCPWM0_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_MCPWM0_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_MCPWM0_CLK_DIV_NUM_S  6

