espressif/esp-idf/components/soc/esp32s31/register/soc/hp_sys_clkrst_reg.h
/** HP_SYS_CLKRST_MCPWM1_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_MCPWM1_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x128)
/** HP_SYS_CLKRST_REG_MCPWM1_APB_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_MCPWM1_APB_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_MCPWM1_APB_CLK_EN_M  (HP_SYS_CLKRST_REG_MCPWM1_APB_CLK_EN_V << HP_SYS_CLKRST_REG_MCPWM1_APB_CLK_EN_S)
#define HP_SYS_CLKRST_REG_MCPWM1_APB_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_MCPWM1_APB_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_MCPWM1_RST_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_MCPWM1_RST_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_MCPWM1_RST_EN_M  (HP_SYS_CLKRST_REG_MCPWM1_RST_EN_V << HP_SYS_CLKRST_REG_MCPWM1_RST_EN_S)
#define HP_SYS_CLKRST_REG_MCPWM1_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_MCPWM1_RST_EN_S  1
/** HP_SYS_CLKRST_REG_MCPWM1_FORCE_NORST : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_MCPWM1_FORCE_NORST    (BIT(2))
#define HP_SYS_CLKRST_REG_MCPWM1_FORCE_NORST_M  (HP_SYS_CLKRST_REG_MCPWM1_FORCE_NORST_V << HP_SYS_CLKRST_REG_MCPWM1_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_MCPWM1_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_MCPWM1_FORCE_NORST_S  2
/** HP_SYS_CLKRST_REG_MCPWM1_CLK_SRC_SEL : R/W; bitpos: [4:3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_MCPWM1_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_MCPWM1_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_MCPWM1_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_MCPWM1_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_MCPWM1_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_MCPWM1_CLK_SRC_SEL_S  3
/** HP_SYS_CLKRST_REG_MCPWM1_CLK_EN : R/W; bitpos: [5]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_MCPWM1_CLK_EN    (BIT(5))
#define HP_SYS_CLKRST_REG_MCPWM1_CLK_EN_M  (HP_SYS_CLKRST_REG_MCPWM1_CLK_EN_V << HP_SYS_CLKRST_REG_MCPWM1_CLK_EN_S)
#define HP_SYS_CLKRST_REG_MCPWM1_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_MCPWM1_CLK_EN_S  5
/** HP_SYS_CLKRST_REG_MCPWM1_CLK_DIV_NUM : R/W; bitpos: [13:6]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_MCPWM1_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_MCPWM1_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_MCPWM1_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_MCPWM1_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_MCPWM1_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_MCPWM1_CLK_DIV_NUM_S  6

/** HP_SYS_CLKRST_MCPWM2_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_MCPWM2_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x12c)
/** HP_SYS_CLKRST_REG_MCPWM2_APB_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_MCPWM2_APB_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_MCPWM2_APB_CLK_EN_M  (HP_SYS_CLKRST_REG_MCPWM2_APB_CLK_EN_V << HP_SYS_CLKRST_REG_MCPWM2_APB_CLK_EN_S)
#define HP_SYS_CLKRST_REG_MCPWM2_APB_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_MCPWM2_APB_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_MCPWM2_RST_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_MCPWM2_RST_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_MCPWM2_RST_EN_M  (HP_SYS_CLKRST_REG_MCPWM2_RST_EN_V << HP_SYS_CLKRST_REG_MCPWM2_RST_EN_S)
#define HP_SYS_CLKRST_REG_MCPWM2_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_MCPWM2_RST_EN_S  1
/** HP_SYS_CLKRST_REG_MCPWM2_FORCE_NORST : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_MCPWM2_FORCE_NORST    (BIT(2))
#define HP_SYS_CLKRST_REG_MCPWM2_FORCE_NORST_M  (HP_SYS_CLKRST_REG_MCPWM2_FORCE_NORST_V << HP_SYS_CLKRST_REG_MCPWM2_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_MCPWM2_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_MCPWM2_FORCE_NORST_S  2
/** HP_SYS_CLKRST_REG_MCPWM2_CLK_SRC_SEL : R/W; bitpos: [4:3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_MCPWM2_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_MCPWM2_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_MCPWM2_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_MCPWM2_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_MCPWM2_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_MCPWM2_CLK_SRC_SEL_S  3
/** HP_SYS_CLKRST_REG_MCPWM2_CLK_EN : R/W; bitpos: [5]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_MCPWM2_CLK_EN    (BIT(5))
#define HP_SYS_CLKRST_REG_MCPWM2_CLK_EN_M  (HP_SYS_CLKRST_REG_MCPWM2_CLK_EN_V << HP_SYS_CLKRST_REG_MCPWM2_CLK_EN_S)
#define HP_SYS_CLKRST_REG_MCPWM2_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_MCPWM2_CLK_EN_S  5
/** HP_SYS_CLKRST_REG_MCPWM2_CLK_DIV_NUM : R/W; bitpos: [13:6]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_MCPWM2_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_MCPWM2_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_MCPWM2_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_MCPWM2_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_MCPWM2_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_MCPWM2_CLK_DIV_NUM_S  6

/** HP_SYS_CLKRST_MCPWM3_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_MCPWM3_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x130)
/** HP_SYS_CLKRST_REG_MCPWM3_APB_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_MCPWM3_APB_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_MCPWM3_APB_CLK_EN_M  (HP_SYS_CLKRST_REG_MCPWM3_APB_CLK_EN_V << HP_SYS_CLKRST_REG_MCPWM3_APB_CLK_EN_S)
#define HP_SYS_CLKRST_REG_MCPWM3_APB_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_MCPWM3_APB_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_MCPWM3_RST_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_MCPWM3_RST_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_MCPWM3_RST_EN_M  (HP_SYS_CLKRST_REG_MCPWM3_RST_EN_V << HP_SYS_CLKRST_REG_MCPWM3_RST_EN_S)
#define HP_SYS_CLKRST_REG_MCPWM3_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_MCPWM3_RST_EN_S  1
/** HP_SYS_CLKRST_REG_MCPWM3_FORCE_NORST : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_MCPWM3_FORCE_NORST    (BIT(2))
#define HP_SYS_CLKRST_REG_MCPWM3_FORCE_NORST_M  (HP_SYS_CLKRST_REG_MCPWM3_FORCE_NORST_V << HP_SYS_CLKRST_REG_MCPWM3_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_MCPWM3_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_MCPWM3_FORCE_NORST_S  2
/** HP_SYS_CLKRST_REG_MCPWM3_CLK_SRC_SEL : R/W; bitpos: [4:3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_MCPWM3_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_MCPWM3_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_MCPWM3_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_MCPWM3_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_MCPWM3_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_MCPWM3_CLK_SRC_SEL_S  3
/** HP_SYS_CLKRST_REG_MCPWM3_CLK_EN : R/W; bitpos: [5]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_MCPWM3_CLK_EN    (BIT(5))
#define HP_SYS_CLKRST_REG_MCPWM3_CLK_EN_M  (HP_SYS_CLKRST_REG_MCPWM3_CLK_EN_V << HP_SYS_CLKRST_REG_MCPWM3_CLK_EN_S)
#define HP_SYS_CLKRST_REG_MCPWM3_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_MCPWM3_CLK_EN_S  5
/** HP_SYS_CLKRST_REG_MCPWM3_CLK_DIV_NUM : R/W; bitpos: [13:6]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_MCPWM3_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_MCPWM3_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_MCPWM3_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_MCPWM3_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_MCPWM3_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_MCPWM3_CLK_DIV_NUM_S  6

/** HP_SYS_CLKRST_INTRMTX_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_INTRMTX_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x134)
/** HP_SYS_CLKRST_REG_INTRMTX_APB_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_INTRMTX_APB_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_INTRMTX_APB_CLK_EN_M  (HP_SYS_CLKRST_REG_INTRMTX_APB_CLK_EN_V << HP_SYS_CLKRST_REG_INTRMTX_APB_CLK_EN_S)
#define HP_SYS_CLKRST_REG_INTRMTX_APB_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_INTRMTX_APB_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_INTRMTX_RST_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_INTRMTX_RST_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_INTRMTX_RST_EN_M  (HP_SYS_CLKRST_REG_INTRMTX_RST_EN_V << HP_SYS_CLKRST_REG_INTRMTX_RST_EN_S)
#define HP_SYS_CLKRST_REG_INTRMTX_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_INTRMTX_RST_EN_S  1
/** HP_SYS_CLKRST_REG_INTRMTX_FORCE_NORST : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_INTRMTX_FORCE_NORST    (BIT(2))
#define HP_SYS_CLKRST_REG_INTRMTX_FORCE_NORST_M  (HP_SYS_CLKRST_REG_INTRMTX_FORCE_NORST_V << HP_SYS_CLKRST_REG_INTRMTX_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_INTRMTX_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_INTRMTX_FORCE_NORST_S  2

/** HP_SYS_CLKRST_PCNT_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_PCNT_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x138)
/** HP_SYS_CLKRST_REG_PCNT0_APB_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PCNT0_APB_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_PCNT0_APB_CLK_EN_M  (HP_SYS_CLKRST_REG_PCNT0_APB_CLK_EN_V << HP_SYS_CLKRST_REG_PCNT0_APB_CLK_EN_S)
#define HP_SYS_CLKRST_REG_PCNT0_APB_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PCNT0_APB_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_PCNT0_RST_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PCNT0_RST_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_PCNT0_RST_EN_M  (HP_SYS_CLKRST_REG_PCNT0_RST_EN_V << HP_SYS_CLKRST_REG_PCNT0_RST_EN_S)
#define HP_SYS_CLKRST_REG_PCNT0_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PCNT0_RST_EN_S  1
/** HP_SYS_CLKRST_REG_PCNT0_FORCE_NORST : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PCNT0_FORCE_NORST    (BIT(2))
#define HP_SYS_CLKRST_REG_PCNT0_FORCE_NORST_M  (HP_SYS_CLKRST_REG_PCNT0_FORCE_NORST_V << HP_SYS_CLKRST_REG_PCNT0_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_PCNT0_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_PCNT0_FORCE_NORST_S  2
/** HP_SYS_CLKRST_REG_PCNT1_APB_CLK_EN : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PCNT1_APB_CLK_EN    (BIT(3))
#define HP_SYS_CLKRST_REG_PCNT1_APB_CLK_EN_M  (HP_SYS_CLKRST_REG_PCNT1_APB_CLK_EN_V << HP_SYS_CLKRST_REG_PCNT1_APB_CLK_EN_S)
#define HP_SYS_CLKRST_REG_PCNT1_APB_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PCNT1_APB_CLK_EN_S  3
/** HP_SYS_CLKRST_REG_PCNT1_RST_EN : R/W; bitpos: [4]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PCNT1_RST_EN    (BIT(4))
#define HP_SYS_CLKRST_REG_PCNT1_RST_EN_M  (HP_SYS_CLKRST_REG_PCNT1_RST_EN_V << HP_SYS_CLKRST_REG_PCNT1_RST_EN_S)
#define HP_SYS_CLKRST_REG_PCNT1_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_PCNT1_RST_EN_S  4
/** HP_SYS_CLKRST_REG_PCNT1_FORCE_NORST : R/W; bitpos: [5]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PCNT1_FORCE_NORST    (BIT(5))
#define HP_SYS_CLKRST_REG_PCNT1_FORCE_NORST_M  (HP_SYS_CLKRST_REG_PCNT1_FORCE_NORST_V << HP_SYS_CLKRST_REG_PCNT1_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_PCNT1_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_PCNT1_FORCE_NORST_S  5

/** HP_SYS_CLKRST_USB_DEVICE_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_USB_DEVICE_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x144)
/** HP_SYS_CLKRST_REG_USB_DEVICE_APB_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_USB_DEVICE_APB_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_USB_DEVICE_APB_CLK_EN_M  (HP_SYS_CLKRST_REG_USB_DEVICE_APB_CLK_EN_V << HP_SYS_CLKRST_REG_USB_DEVICE_APB_CLK_EN_S)
#define HP_SYS_CLKRST_REG_USB_DEVICE_APB_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_USB_DEVICE_APB_CLK_EN_S  0

/** HP_SYS_CLKRST_LEDC_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_LEDC_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x148)
/** HP_SYS_CLKRST_REG_LEDC0_APB_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_LEDC0_APB_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_LEDC0_APB_CLK_EN_M  (HP_SYS_CLKRST_REG_LEDC0_APB_CLK_EN_V << HP_SYS_CLKRST_REG_LEDC0_APB_CLK_EN_S)
#define HP_SYS_CLKRST_REG_LEDC0_APB_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_LEDC0_APB_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_LEDC0_RST_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_LEDC0_RST_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_LEDC0_RST_EN_M  (HP_SYS_CLKRST_REG_LEDC0_RST_EN_V << HP_SYS_CLKRST_REG_LEDC0_RST_EN_S)
#define HP_SYS_CLKRST_REG_LEDC0_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_LEDC0_RST_EN_S  1
/** HP_SYS_CLKRST_REG_LEDC0_FORCE_NORST : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_LEDC0_FORCE_NORST    (BIT(2))
#define HP_SYS_CLKRST_REG_LEDC0_FORCE_NORST_M  (HP_SYS_CLKRST_REG_LEDC0_FORCE_NORST_V << HP_SYS_CLKRST_REG_LEDC0_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_LEDC0_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_LEDC0_FORCE_NORST_S  2
/** HP_SYS_CLKRST_REG_LEDC0_CLK_SRC_SEL : R/W; bitpos: [4:3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_LEDC0_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_LEDC0_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_LEDC0_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_LEDC0_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_LEDC0_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_LEDC0_CLK_SRC_SEL_S  3
/** HP_SYS_CLKRST_REG_LEDC0_CLK_EN : R/W; bitpos: [5]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_LEDC0_CLK_EN    (BIT(5))
#define HP_SYS_CLKRST_REG_LEDC0_CLK_EN_M  (HP_SYS_CLKRST_REG_LEDC0_CLK_EN_V << HP_SYS_CLKRST_REG_LEDC0_CLK_EN_S)
#define HP_SYS_CLKRST_REG_LEDC0_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_LEDC0_CLK_EN_S  5
/** HP_SYS_CLKRST_REG_LEDC1_APB_CLK_EN : R/W; bitpos: [6]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_LEDC1_APB_CLK_EN    (BIT(6))
#define HP_SYS_CLKRST_REG_LEDC1_APB_CLK_EN_M  (HP_SYS_CLKRST_REG_LEDC1_APB_CLK_EN_V << HP_SYS_CLKRST_REG_LEDC1_APB_CLK_EN_S)
#define HP_SYS_CLKRST_REG_LEDC1_APB_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_LEDC1_APB_CLK_EN_S  6
/** HP_SYS_CLKRST_REG_LEDC1_RST_EN : R/W; bitpos: [7]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_LEDC1_RST_EN    (BIT(7))
#define HP_SYS_CLKRST_REG_LEDC1_RST_EN_M  (HP_SYS_CLKRST_REG_LEDC1_RST_EN_V << HP_SYS_CLKRST_REG_LEDC1_RST_EN_S)
#define HP_SYS_CLKRST_REG_LEDC1_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_LEDC1_RST_EN_S  7
/** HP_SYS_CLKRST_REG_LEDC1_FORCE_NORST : R/W; bitpos: [8]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_LEDC1_FORCE_NORST    (BIT(8))
#define HP_SYS_CLKRST_REG_LEDC1_FORCE_NORST_M  (HP_SYS_CLKRST_REG_LEDC1_FORCE_NORST_V << HP_SYS_CLKRST_REG_LEDC1_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_LEDC1_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_LEDC1_FORCE_NORST_S  8
/** HP_SYS_CLKRST_REG_LEDC1_CLK_SRC_SEL : R/W; bitpos: [10:9]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_LEDC1_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_LEDC1_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_LEDC1_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_LEDC1_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_LEDC1_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_LEDC1_CLK_SRC_SEL_S  9
/** HP_SYS_CLKRST_REG_LEDC1_CLK_EN : R/W; bitpos: [11]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_LEDC1_CLK_EN    (BIT(11))
#define HP_SYS_CLKRST_REG_LEDC1_CLK_EN_M  (HP_SYS_CLKRST_REG_LEDC1_CLK_EN_V << HP_SYS_CLKRST_REG_LEDC1_CLK_EN_S)
#define HP_SYS_CLKRST_REG_LEDC1_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_LEDC1_CLK_EN_S  11

/** HP_SYS_CLKRST_LCDCAM_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_LCDCAM_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x14c)
/** HP_SYS_CLKRST_REG_LCDCAM_APB_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_LCDCAM_APB_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_LCDCAM_APB_CLK_EN_M  (HP_SYS_CLKRST_REG_LCDCAM_APB_CLK_EN_V << HP_SYS_CLKRST_REG_LCDCAM_APB_CLK_EN_S)
#define HP_SYS_CLKRST_REG_LCDCAM_APB_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_LCDCAM_APB_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_LCDCAM_APB_RST_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_LCDCAM_APB_RST_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_LCDCAM_APB_RST_EN_M  (HP_SYS_CLKRST_REG_LCDCAM_APB_RST_EN_V << HP_SYS_CLKRST_REG_LCDCAM_APB_RST_EN_S)
#define HP_SYS_CLKRST_REG_LCDCAM_APB_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_LCDCAM_APB_RST_EN_S  1
/** HP_SYS_CLKRST_REG_LCDCAM_SYS_CLK_EN : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_LCDCAM_SYS_CLK_EN    (BIT(2))
#define HP_SYS_CLKRST_REG_LCDCAM_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_LCDCAM_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_LCDCAM_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_LCDCAM_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_LCDCAM_SYS_CLK_EN_S  2
/** HP_SYS_CLKRST_REG_LCDCAM_RST_EN : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_LCDCAM_RST_EN    (BIT(3))
#define HP_SYS_CLKRST_REG_LCDCAM_RST_EN_M  (HP_SYS_CLKRST_REG_LCDCAM_RST_EN_V << HP_SYS_CLKRST_REG_LCDCAM_RST_EN_S)
#define HP_SYS_CLKRST_REG_LCDCAM_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_LCDCAM_RST_EN_S  3
/** HP_SYS_CLKRST_REG_LCDCAM_FORCE_NORST : R/W; bitpos: [4]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_LCDCAM_FORCE_NORST    (BIT(4))
#define HP_SYS_CLKRST_REG_LCDCAM_FORCE_NORST_M  (HP_SYS_CLKRST_REG_LCDCAM_FORCE_NORST_V << HP_SYS_CLKRST_REG_LCDCAM_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_LCDCAM_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_LCDCAM_FORCE_NORST_S  4

