espressif/esp-idf/components/soc/esp32s31/register/soc/hp_sys_clkrst_reg.h
/** HP_SYS_CLKRST_LCDCAM_LCD_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_LCDCAM_LCD_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x150)
/** HP_SYS_CLKRST_REG_LCD_CLK_SRC_SEL : R/W; bitpos: [1:0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_LCD_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_LCD_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_LCD_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_LCD_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_LCD_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_LCD_CLK_SRC_SEL_S  0
/** HP_SYS_CLKRST_REG_LCD_CLK_EN : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_LCD_CLK_EN    (BIT(2))
#define HP_SYS_CLKRST_REG_LCD_CLK_EN_M  (HP_SYS_CLKRST_REG_LCD_CLK_EN_V << HP_SYS_CLKRST_REG_LCD_CLK_EN_S)
#define HP_SYS_CLKRST_REG_LCD_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_LCD_CLK_EN_S  2
/** HP_SYS_CLKRST_REG_LCD_CLK_DIV_NUM : R/W; bitpos: [10:3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_LCD_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_LCD_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_LCD_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_LCD_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_LCD_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_LCD_CLK_DIV_NUM_S  3
/** HP_SYS_CLKRST_REG_LCD_CLK_DIV_NUMERATOR : R/W; bitpos: [18:11]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_LCD_CLK_DIV_NUMERATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_LCD_CLK_DIV_NUMERATOR_M  (HP_SYS_CLKRST_REG_LCD_CLK_DIV_NUMERATOR_V << HP_SYS_CLKRST_REG_LCD_CLK_DIV_NUMERATOR_S)
#define HP_SYS_CLKRST_REG_LCD_CLK_DIV_NUMERATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_LCD_CLK_DIV_NUMERATOR_S  11
/** HP_SYS_CLKRST_REG_LCD_CLK_DIV_DENOMINATOR : R/W; bitpos: [26:19]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_LCD_CLK_DIV_DENOMINATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_LCD_CLK_DIV_DENOMINATOR_M  (HP_SYS_CLKRST_REG_LCD_CLK_DIV_DENOMINATOR_V << HP_SYS_CLKRST_REG_LCD_CLK_DIV_DENOMINATOR_S)
#define HP_SYS_CLKRST_REG_LCD_CLK_DIV_DENOMINATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_LCD_CLK_DIV_DENOMINATOR_S  19

/** HP_SYS_CLKRST_LCDCAM_LCDCAM_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_LCDCAM_LCDCAM_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x154)
/** HP_SYS_CLKRST_REG_LCDCAM_CLK_SRC_SEL : R/W; bitpos: [1:0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_LCDCAM_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_LCDCAM_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_LCDCAM_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_LCDCAM_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_LCDCAM_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_LCDCAM_CLK_SRC_SEL_S  0
/** HP_SYS_CLKRST_REG_LCDCAM_CLK_EN : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_LCDCAM_CLK_EN    (BIT(2))
#define HP_SYS_CLKRST_REG_LCDCAM_CLK_EN_M  (HP_SYS_CLKRST_REG_LCDCAM_CLK_EN_V << HP_SYS_CLKRST_REG_LCDCAM_CLK_EN_S)
#define HP_SYS_CLKRST_REG_LCDCAM_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_LCDCAM_CLK_EN_S  2
/** HP_SYS_CLKRST_REG_LCDCAM_CLK_DIV_NUM : R/W; bitpos: [10:3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_LCDCAM_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_LCDCAM_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_LCDCAM_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_LCDCAM_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_LCDCAM_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_LCDCAM_CLK_DIV_NUM_S  3
/** HP_SYS_CLKRST_REG_LCDCAM_CLK_DIV_NUMERATOR : R/W; bitpos: [18:11]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_LCDCAM_CLK_DIV_NUMERATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_LCDCAM_CLK_DIV_NUMERATOR_M  (HP_SYS_CLKRST_REG_LCDCAM_CLK_DIV_NUMERATOR_V << HP_SYS_CLKRST_REG_LCDCAM_CLK_DIV_NUMERATOR_S)
#define HP_SYS_CLKRST_REG_LCDCAM_CLK_DIV_NUMERATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_LCDCAM_CLK_DIV_NUMERATOR_S  11
/** HP_SYS_CLKRST_REG_LCDCAM_CLK_DIV_DENOMINATOR : R/W; bitpos: [26:19]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_LCDCAM_CLK_DIV_DENOMINATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_LCDCAM_CLK_DIV_DENOMINATOR_M  (HP_SYS_CLKRST_REG_LCDCAM_CLK_DIV_DENOMINATOR_V << HP_SYS_CLKRST_REG_LCDCAM_CLK_DIV_DENOMINATOR_S)
#define HP_SYS_CLKRST_REG_LCDCAM_CLK_DIV_DENOMINATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_LCDCAM_CLK_DIV_DENOMINATOR_S  19

/** HP_SYS_CLKRST_LCDCAM_CAM_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_LCDCAM_CAM_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x158)
/** HP_SYS_CLKRST_REG_CAM_CLK_SRC_SEL : R/W; bitpos: [1:0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CAM_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_CAM_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_CAM_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_CAM_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_CAM_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_CAM_CLK_SRC_SEL_S  0
/** HP_SYS_CLKRST_REG_CAM_CLK_EN : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CAM_CLK_EN    (BIT(2))
#define HP_SYS_CLKRST_REG_CAM_CLK_EN_M  (HP_SYS_CLKRST_REG_CAM_CLK_EN_V << HP_SYS_CLKRST_REG_CAM_CLK_EN_S)
#define HP_SYS_CLKRST_REG_CAM_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CAM_CLK_EN_S  2
/** HP_SYS_CLKRST_REG_CAM_CLK_DIV_NUM : R/W; bitpos: [10:3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CAM_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_CAM_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_CAM_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_CAM_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_CAM_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_CAM_CLK_DIV_NUM_S  3
/** HP_SYS_CLKRST_REG_CAM_CLK_DIV_NUMERATOR : R/W; bitpos: [18:11]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CAM_CLK_DIV_NUMERATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_CAM_CLK_DIV_NUMERATOR_M  (HP_SYS_CLKRST_REG_CAM_CLK_DIV_NUMERATOR_V << HP_SYS_CLKRST_REG_CAM_CLK_DIV_NUMERATOR_S)
#define HP_SYS_CLKRST_REG_CAM_CLK_DIV_NUMERATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_CAM_CLK_DIV_NUMERATOR_S  11
/** HP_SYS_CLKRST_REG_CAM_CLK_DIV_DENOMINATOR : R/W; bitpos: [26:19]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CAM_CLK_DIV_DENOMINATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_CAM_CLK_DIV_DENOMINATOR_M  (HP_SYS_CLKRST_REG_CAM_CLK_DIV_DENOMINATOR_V << HP_SYS_CLKRST_REG_CAM_CLK_DIV_DENOMINATOR_S)
#define HP_SYS_CLKRST_REG_CAM_CLK_DIV_DENOMINATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_CAM_CLK_DIV_DENOMINATOR_S  19

/** HP_SYS_CLKRST_IOMUX_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_IOMUX_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x15c)
/** HP_SYS_CLKRST_REG_IOMUX_APB_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_IOMUX_APB_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_IOMUX_APB_CLK_EN_M  (HP_SYS_CLKRST_REG_IOMUX_APB_CLK_EN_V << HP_SYS_CLKRST_REG_IOMUX_APB_CLK_EN_S)
#define HP_SYS_CLKRST_REG_IOMUX_APB_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_IOMUX_APB_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_IOMUX_RST_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_IOMUX_RST_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_IOMUX_RST_EN_M  (HP_SYS_CLKRST_REG_IOMUX_RST_EN_V << HP_SYS_CLKRST_REG_IOMUX_RST_EN_S)
#define HP_SYS_CLKRST_REG_IOMUX_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_IOMUX_RST_EN_S  1
/** HP_SYS_CLKRST_REG_IOMUX_FORCE_NORST : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_IOMUX_FORCE_NORST    (BIT(2))
#define HP_SYS_CLKRST_REG_IOMUX_FORCE_NORST_M  (HP_SYS_CLKRST_REG_IOMUX_FORCE_NORST_V << HP_SYS_CLKRST_REG_IOMUX_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_IOMUX_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_IOMUX_FORCE_NORST_S  2
/** HP_SYS_CLKRST_REG_IOMUX_CLK_SRC_SEL : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_IOMUX_CLK_SRC_SEL    (BIT(3))
#define HP_SYS_CLKRST_REG_IOMUX_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_IOMUX_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_IOMUX_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_IOMUX_CLK_SRC_SEL_V  0x00000001U
#define HP_SYS_CLKRST_REG_IOMUX_CLK_SRC_SEL_S  3
/** HP_SYS_CLKRST_REG_IOMUX_CLK_EN : R/W; bitpos: [4]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_IOMUX_CLK_EN    (BIT(4))
#define HP_SYS_CLKRST_REG_IOMUX_CLK_EN_M  (HP_SYS_CLKRST_REG_IOMUX_CLK_EN_V << HP_SYS_CLKRST_REG_IOMUX_CLK_EN_S)
#define HP_SYS_CLKRST_REG_IOMUX_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_IOMUX_CLK_EN_S  4
/** HP_SYS_CLKRST_REG_IOMUX_CLK_DIV_NUM : R/W; bitpos: [12:5]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_IOMUX_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_IOMUX_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_IOMUX_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_IOMUX_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_IOMUX_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_IOMUX_CLK_DIV_NUM_S  5

