espressif/esp-idf/components/soc/esp32s31/register/soc/hp_sys_clkrst_reg.h
/** HP_SYS_CLKRST_HPWDT_CORE0_RST_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_HPWDT_CORE0_RST_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x160)
/** HP_SYS_CLKRST_REG_HPCORE0_STALL_EN : R/W; bitpos: [0]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_HPCORE0_STALL_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_HPCORE0_STALL_EN_M  (HP_SYS_CLKRST_REG_HPCORE0_STALL_EN_V << HP_SYS_CLKRST_REG_HPCORE0_STALL_EN_S)
#define HP_SYS_CLKRST_REG_HPCORE0_STALL_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_HPCORE0_STALL_EN_S  0
/** HP_SYS_CLKRST_REG_HPCORE0_STALL_WAIT_NUM : R/W; bitpos: [8:1]; default: 8;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_HPCORE0_STALL_WAIT_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_HPCORE0_STALL_WAIT_NUM_M  (HP_SYS_CLKRST_REG_HPCORE0_STALL_WAIT_NUM_V << HP_SYS_CLKRST_REG_HPCORE0_STALL_WAIT_NUM_S)
#define HP_SYS_CLKRST_REG_HPCORE0_STALL_WAIT_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_HPCORE0_STALL_WAIT_NUM_S  1
/** HP_SYS_CLKRST_REG_WDT_HPCORE0_RST_LEN : R/W; bitpos: [16:9]; default: 8;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_WDT_HPCORE0_RST_LEN    0x000000FFU
#define HP_SYS_CLKRST_REG_WDT_HPCORE0_RST_LEN_M  (HP_SYS_CLKRST_REG_WDT_HPCORE0_RST_LEN_V << HP_SYS_CLKRST_REG_WDT_HPCORE0_RST_LEN_S)
#define HP_SYS_CLKRST_REG_WDT_HPCORE0_RST_LEN_V  0x000000FFU
#define HP_SYS_CLKRST_REG_WDT_HPCORE0_RST_LEN_S  9

/** HP_SYS_CLKRST_HPWDT_CORE1_RST_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_HPWDT_CORE1_RST_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x164)
/** HP_SYS_CLKRST_REG_HPCORE1_STALL_EN : R/W; bitpos: [0]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_HPCORE1_STALL_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_HPCORE1_STALL_EN_M  (HP_SYS_CLKRST_REG_HPCORE1_STALL_EN_V << HP_SYS_CLKRST_REG_HPCORE1_STALL_EN_S)
#define HP_SYS_CLKRST_REG_HPCORE1_STALL_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_HPCORE1_STALL_EN_S  0
/** HP_SYS_CLKRST_REG_HPCORE1_STALL_WAIT_NUM : R/W; bitpos: [8:1]; default: 8;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_HPCORE1_STALL_WAIT_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_HPCORE1_STALL_WAIT_NUM_M  (HP_SYS_CLKRST_REG_HPCORE1_STALL_WAIT_NUM_V << HP_SYS_CLKRST_REG_HPCORE1_STALL_WAIT_NUM_S)
#define HP_SYS_CLKRST_REG_HPCORE1_STALL_WAIT_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_HPCORE1_STALL_WAIT_NUM_S  1
/** HP_SYS_CLKRST_REG_WDT_HPCORE1_RST_LEN : R/W; bitpos: [16:9]; default: 8;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_WDT_HPCORE1_RST_LEN    0x000000FFU
#define HP_SYS_CLKRST_REG_WDT_HPCORE1_RST_LEN_M  (HP_SYS_CLKRST_REG_WDT_HPCORE1_RST_LEN_V << HP_SYS_CLKRST_REG_WDT_HPCORE1_RST_LEN_S)
#define HP_SYS_CLKRST_REG_WDT_HPCORE1_RST_LEN_V  0x000000FFU
#define HP_SYS_CLKRST_REG_WDT_HPCORE1_RST_LEN_S  9

/** HP_SYS_CLKRST_CPU_SRC_FREQ0_REG register
 *  CPU Source Frequency
 */
#define HP_SYS_CLKRST_CPU_SRC_FREQ0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x168)
/** HP_SYS_CLKRST_REG_CPU_SRC_FREQ : RO; bitpos: [31:0]; default: 0;
 *  cpu source clock frequency, step by 0.25MHz
 */
#define HP_SYS_CLKRST_REG_CPU_SRC_FREQ    0xFFFFFFFFU
#define HP_SYS_CLKRST_REG_CPU_SRC_FREQ_M  (HP_SYS_CLKRST_REG_CPU_SRC_FREQ_V << HP_SYS_CLKRST_REG_CPU_SRC_FREQ_S)
#define HP_SYS_CLKRST_REG_CPU_SRC_FREQ_V  0xFFFFFFFFU
#define HP_SYS_CLKRST_REG_CPU_SRC_FREQ_S  0

/** HP_SYS_CLKRST_CPU_CLK_STATUS0_REG register
 *  CPU Clock Status
 */
#define HP_SYS_CLKRST_CPU_CLK_STATUS0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x16c)
/** HP_SYS_CLKRST_REG_ASIC_OR_FPGA : RO; bitpos: [0]; default: 0;
 *  0: ASIC mode, 1: FPGA mode
 */
#define HP_SYS_CLKRST_REG_ASIC_OR_FPGA    (BIT(0))
#define HP_SYS_CLKRST_REG_ASIC_OR_FPGA_M  (HP_SYS_CLKRST_REG_ASIC_OR_FPGA_V << HP_SYS_CLKRST_REG_ASIC_OR_FPGA_S)
#define HP_SYS_CLKRST_REG_ASIC_OR_FPGA_V  0x00000001U
#define HP_SYS_CLKRST_REG_ASIC_OR_FPGA_S  0
/** HP_SYS_CLKRST_REG_CPU_DIV_EFFECT : RO; bitpos: [1]; default: 0;
 *  0: Divider bypass, 1: Divider takes effect
 */
#define HP_SYS_CLKRST_REG_CPU_DIV_EFFECT    (BIT(1))
#define HP_SYS_CLKRST_REG_CPU_DIV_EFFECT_M  (HP_SYS_CLKRST_REG_CPU_DIV_EFFECT_V << HP_SYS_CLKRST_REG_CPU_DIV_EFFECT_S)
#define HP_SYS_CLKRST_REG_CPU_DIV_EFFECT_V  0x00000001U
#define HP_SYS_CLKRST_REG_CPU_DIV_EFFECT_S  1
/** HP_SYS_CLKRST_REG_CPU_SRC_IS_CPLL : RO; bitpos: [2]; default: 0;
 *  0: CPU source isn't cpll_400m, 1: CPU Source is cll_400m
 */
#define HP_SYS_CLKRST_REG_CPU_SRC_IS_CPLL    (BIT(2))
#define HP_SYS_CLKRST_REG_CPU_SRC_IS_CPLL_M  (HP_SYS_CLKRST_REG_CPU_SRC_IS_CPLL_V << HP_SYS_CLKRST_REG_CPU_SRC_IS_CPLL_S)
#define HP_SYS_CLKRST_REG_CPU_SRC_IS_CPLL_V  0x00000001U
#define HP_SYS_CLKRST_REG_CPU_SRC_IS_CPLL_S  2
/** HP_SYS_CLKRST_REG_CPU_DIV_NUM_CUR : RO; bitpos: [10:3]; default: 0;
 *  cpu current div number
 */
#define HP_SYS_CLKRST_REG_CPU_DIV_NUM_CUR    0x000000FFU
#define HP_SYS_CLKRST_REG_CPU_DIV_NUM_CUR_M  (HP_SYS_CLKRST_REG_CPU_DIV_NUM_CUR_V << HP_SYS_CLKRST_REG_CPU_DIV_NUM_CUR_S)
#define HP_SYS_CLKRST_REG_CPU_DIV_NUM_CUR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_CPU_DIV_NUM_CUR_S  3
/** HP_SYS_CLKRST_REG_CPU_DIV_NUMERATOR_CUR : RO; bitpos: [13:11]; default: 0;
 *  cpu current div numerator
 */
#define HP_SYS_CLKRST_REG_CPU_DIV_NUMERATOR_CUR    0x00000007U
#define HP_SYS_CLKRST_REG_CPU_DIV_NUMERATOR_CUR_M  (HP_SYS_CLKRST_REG_CPU_DIV_NUMERATOR_CUR_V << HP_SYS_CLKRST_REG_CPU_DIV_NUMERATOR_CUR_S)
#define HP_SYS_CLKRST_REG_CPU_DIV_NUMERATOR_CUR_V  0x00000007U
#define HP_SYS_CLKRST_REG_CPU_DIV_NUMERATOR_CUR_S  11
/** HP_SYS_CLKRST_REG_CPU_DIV_DENOMINATOR_CUR : RO; bitpos: [16:14]; default: 0;
 *  cpu current div denominator
 */
#define HP_SYS_CLKRST_REG_CPU_DIV_DENOMINATOR_CUR    0x00000007U
#define HP_SYS_CLKRST_REG_CPU_DIV_DENOMINATOR_CUR_M  (HP_SYS_CLKRST_REG_CPU_DIV_DENOMINATOR_CUR_V << HP_SYS_CLKRST_REG_CPU_DIV_DENOMINATOR_CUR_S)
#define HP_SYS_CLKRST_REG_CPU_DIV_DENOMINATOR_CUR_V  0x00000007U
#define HP_SYS_CLKRST_REG_CPU_DIV_DENOMINATOR_CUR_S  14

/** HP_SYS_CLKRST_HPCORE_WDT_RESET_SOURCE0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_HPCORE_WDT_RESET_SOURCE0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x170)
/** HP_SYS_CLKRST_REG_HPCORE0_WDT_RESET_SOURCE_SEL : R/W; bitpos: [0]; default: 0;
 *  1'b0: use wdt0 to reset hpcore0, 1'b1: use wdt1 to reset hpcore0
 */
#define HP_SYS_CLKRST_REG_HPCORE0_WDT_RESET_SOURCE_SEL    (BIT(0))
#define HP_SYS_CLKRST_REG_HPCORE0_WDT_RESET_SOURCE_SEL_M  (HP_SYS_CLKRST_REG_HPCORE0_WDT_RESET_SOURCE_SEL_V << HP_SYS_CLKRST_REG_HPCORE0_WDT_RESET_SOURCE_SEL_S)
#define HP_SYS_CLKRST_REG_HPCORE0_WDT_RESET_SOURCE_SEL_V  0x00000001U
#define HP_SYS_CLKRST_REG_HPCORE0_WDT_RESET_SOURCE_SEL_S  0
/** HP_SYS_CLKRST_REG_HPCORE1_WDT_RESET_SOURCE_SEL : R/W; bitpos: [1]; default: 1;
 *  1'b0: use wdt0 to reset hpcore1, 1'b1: use wdt1 to reset hpcore1
 */
#define HP_SYS_CLKRST_REG_HPCORE1_WDT_RESET_SOURCE_SEL    (BIT(1))
#define HP_SYS_CLKRST_REG_HPCORE1_WDT_RESET_SOURCE_SEL_M  (HP_SYS_CLKRST_REG_HPCORE1_WDT_RESET_SOURCE_SEL_V << HP_SYS_CLKRST_REG_HPCORE1_WDT_RESET_SOURCE_SEL_S)
#define HP_SYS_CLKRST_REG_HPCORE1_WDT_RESET_SOURCE_SEL_V  0x00000001U
#define HP_SYS_CLKRST_REG_HPCORE1_WDT_RESET_SOURCE_SEL_S  1

