espressif/esp-idf/components/soc/esp32s31/register/soc/hp_sys_clkrst_reg.h
/** HP_SYS_CLKRST_ANA_PLL_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_ANA_PLL_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x174)
/** HP_SYS_CLKRST_REG_PLLA_CAL_END : RO; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PLLA_CAL_END    (BIT(0))
#define HP_SYS_CLKRST_REG_PLLA_CAL_END_M  (HP_SYS_CLKRST_REG_PLLA_CAL_END_V << HP_SYS_CLKRST_REG_PLLA_CAL_END_S)
#define HP_SYS_CLKRST_REG_PLLA_CAL_END_V  0x00000001U
#define HP_SYS_CLKRST_REG_PLLA_CAL_END_S  0
/** HP_SYS_CLKRST_REG_PLLA_CAL_STOP : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PLLA_CAL_STOP    (BIT(1))
#define HP_SYS_CLKRST_REG_PLLA_CAL_STOP_M  (HP_SYS_CLKRST_REG_PLLA_CAL_STOP_V << HP_SYS_CLKRST_REG_PLLA_CAL_STOP_S)
#define HP_SYS_CLKRST_REG_PLLA_CAL_STOP_V  0x00000001U
#define HP_SYS_CLKRST_REG_PLLA_CAL_STOP_S  1
/** HP_SYS_CLKRST_REG_CPU_PLL_CAL_END : RO; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CPU_PLL_CAL_END    (BIT(2))
#define HP_SYS_CLKRST_REG_CPU_PLL_CAL_END_M  (HP_SYS_CLKRST_REG_CPU_PLL_CAL_END_V << HP_SYS_CLKRST_REG_CPU_PLL_CAL_END_S)
#define HP_SYS_CLKRST_REG_CPU_PLL_CAL_END_V  0x00000001U
#define HP_SYS_CLKRST_REG_CPU_PLL_CAL_END_S  2
/** HP_SYS_CLKRST_REG_CPU_PLL_CAL_STOP : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CPU_PLL_CAL_STOP    (BIT(3))
#define HP_SYS_CLKRST_REG_CPU_PLL_CAL_STOP_M  (HP_SYS_CLKRST_REG_CPU_PLL_CAL_STOP_V << HP_SYS_CLKRST_REG_CPU_PLL_CAL_STOP_S)
#define HP_SYS_CLKRST_REG_CPU_PLL_CAL_STOP_V  0x00000001U
#define HP_SYS_CLKRST_REG_CPU_PLL_CAL_STOP_S  3
/** HP_SYS_CLKRST_REG_SDIO_PLL_CAL_END : RO; bitpos: [4]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_SDIO_PLL_CAL_END    (BIT(4))
#define HP_SYS_CLKRST_REG_SDIO_PLL_CAL_END_M  (HP_SYS_CLKRST_REG_SDIO_PLL_CAL_END_V << HP_SYS_CLKRST_REG_SDIO_PLL_CAL_END_S)
#define HP_SYS_CLKRST_REG_SDIO_PLL_CAL_END_V  0x00000001U
#define HP_SYS_CLKRST_REG_SDIO_PLL_CAL_END_S  4
/** HP_SYS_CLKRST_REG_SDIO_PLL_CAL_STOP : R/W; bitpos: [5]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_SDIO_PLL_CAL_STOP    (BIT(5))
#define HP_SYS_CLKRST_REG_SDIO_PLL_CAL_STOP_M  (HP_SYS_CLKRST_REG_SDIO_PLL_CAL_STOP_V << HP_SYS_CLKRST_REG_SDIO_PLL_CAL_STOP_S)
#define HP_SYS_CLKRST_REG_SDIO_PLL_CAL_STOP_V  0x00000001U
#define HP_SYS_CLKRST_REG_SDIO_PLL_CAL_STOP_S  5
/** HP_SYS_CLKRST_REG_BBPLL_CAL_END : RO; bitpos: [6]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_BBPLL_CAL_END    (BIT(6))
#define HP_SYS_CLKRST_REG_BBPLL_CAL_END_M  (HP_SYS_CLKRST_REG_BBPLL_CAL_END_V << HP_SYS_CLKRST_REG_BBPLL_CAL_END_S)
#define HP_SYS_CLKRST_REG_BBPLL_CAL_END_V  0x00000001U
#define HP_SYS_CLKRST_REG_BBPLL_CAL_END_S  6
/** HP_SYS_CLKRST_REG_BBPLL_CAL_STOP : R/W; bitpos: [7]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_BBPLL_CAL_STOP    (BIT(7))
#define HP_SYS_CLKRST_REG_BBPLL_CAL_STOP_M  (HP_SYS_CLKRST_REG_BBPLL_CAL_STOP_V << HP_SYS_CLKRST_REG_BBPLL_CAL_STOP_S)
#define HP_SYS_CLKRST_REG_BBPLL_CAL_STOP_V  0x00000001U
#define HP_SYS_CLKRST_REG_BBPLL_CAL_STOP_S  7
/** HP_SYS_CLKRST_REG_MSPI_CAL_END : RO; bitpos: [8]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_MSPI_CAL_END    (BIT(8))
#define HP_SYS_CLKRST_REG_MSPI_CAL_END_M  (HP_SYS_CLKRST_REG_MSPI_CAL_END_V << HP_SYS_CLKRST_REG_MSPI_CAL_END_S)
#define HP_SYS_CLKRST_REG_MSPI_CAL_END_V  0x00000001U
#define HP_SYS_CLKRST_REG_MSPI_CAL_END_S  8
/** HP_SYS_CLKRST_REG_MSPI_CAL_STOP : R/W; bitpos: [9]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_MSPI_CAL_STOP    (BIT(9))
#define HP_SYS_CLKRST_REG_MSPI_CAL_STOP_M  (HP_SYS_CLKRST_REG_MSPI_CAL_STOP_V << HP_SYS_CLKRST_REG_MSPI_CAL_STOP_S)
#define HP_SYS_CLKRST_REG_MSPI_CAL_STOP_V  0x00000001U
#define HP_SYS_CLKRST_REG_MSPI_CAL_STOP_S  9
/** HP_SYS_CLKRST_REG_PLL_CAL_END : RO; bitpos: [10]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_PLL_CAL_END    (BIT(10))
#define HP_SYS_CLKRST_REG_PLL_CAL_END_M  (HP_SYS_CLKRST_REG_PLL_CAL_END_V << HP_SYS_CLKRST_REG_PLL_CAL_END_S)
#define HP_SYS_CLKRST_REG_PLL_CAL_END_V  0x00000001U
#define HP_SYS_CLKRST_REG_PLL_CAL_END_S  10

/** HP_SYS_CLKRST_REF_500M_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_REF_500M_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x178)
/** HP_SYS_CLKRST_REG_REF_500M_SEL : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_REF_500M_SEL    (BIT(0))
#define HP_SYS_CLKRST_REG_REF_500M_SEL_M  (HP_SYS_CLKRST_REG_REF_500M_SEL_V << HP_SYS_CLKRST_REG_REF_500M_SEL_S)
#define HP_SYS_CLKRST_REG_REF_500M_SEL_V  0x00000001U
#define HP_SYS_CLKRST_REG_REF_500M_SEL_S  0

/** HP_SYS_CLKRST_REF_240M_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_REF_240M_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x17c)
/** HP_SYS_CLKRST_REG_REF_240M_CLK_DIV_NUM : R/W; bitpos: [7:0]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_REF_240M_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_REF_240M_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_REF_240M_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_REF_240M_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_REF_240M_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_REF_240M_CLK_DIV_NUM_S  0
/** HP_SYS_CLKRST_REG_REF_240M_CLK_EN : R/W; bitpos: [8]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_REF_240M_CLK_EN    (BIT(8))
#define HP_SYS_CLKRST_REG_REF_240M_CLK_EN_M  (HP_SYS_CLKRST_REG_REF_240M_CLK_EN_V << HP_SYS_CLKRST_REG_REF_240M_CLK_EN_S)
#define HP_SYS_CLKRST_REG_REF_240M_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_REF_240M_CLK_EN_S  8

/** HP_SYS_CLKRST_REF_160M_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_REF_160M_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x180)
/** HP_SYS_CLKRST_REG_REF_160M_CLK_DIV_NUM : R/W; bitpos: [7:0]; default: 2;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_REF_160M_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_REF_160M_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_REF_160M_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_REF_160M_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_REF_160M_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_REF_160M_CLK_DIV_NUM_S  0
/** HP_SYS_CLKRST_REG_REF_160M_CLK_EN : R/W; bitpos: [8]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_REF_160M_CLK_EN    (BIT(8))
#define HP_SYS_CLKRST_REG_REF_160M_CLK_EN_M  (HP_SYS_CLKRST_REG_REF_160M_CLK_EN_V << HP_SYS_CLKRST_REG_REF_160M_CLK_EN_S)
#define HP_SYS_CLKRST_REG_REF_160M_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_REF_160M_CLK_EN_S  8

