espressif/esp-idf/components/soc/esp32s31/register/soc/hp_sys_clkrst_reg.h
/** HP_SYS_CLKRST_REF_120M_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_REF_120M_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x184)
/** HP_SYS_CLKRST_REG_REF_120M_CLK_DIV_NUM : R/W; bitpos: [7:0]; default: 3;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_REF_120M_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_REF_120M_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_REF_120M_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_REF_120M_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_REF_120M_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_REF_120M_CLK_DIV_NUM_S  0
/** HP_SYS_CLKRST_REG_REF_120M_CLK_EN : R/W; bitpos: [8]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_REF_120M_CLK_EN    (BIT(8))
#define HP_SYS_CLKRST_REG_REF_120M_CLK_EN_M  (HP_SYS_CLKRST_REG_REF_120M_CLK_EN_V << HP_SYS_CLKRST_REG_REF_120M_CLK_EN_S)
#define HP_SYS_CLKRST_REG_REF_120M_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_REF_120M_CLK_EN_S  8

/** HP_SYS_CLKRST_REF_80M_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_REF_80M_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x188)
/** HP_SYS_CLKRST_REG_REF_80M_CLK_DIV_NUM : R/W; bitpos: [7:0]; default: 5;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_REF_80M_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_REF_80M_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_REF_80M_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_REF_80M_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_REF_80M_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_REF_80M_CLK_DIV_NUM_S  0
/** HP_SYS_CLKRST_REG_REF_80M_CLK_EN : R/W; bitpos: [8]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_REF_80M_CLK_EN    (BIT(8))
#define HP_SYS_CLKRST_REG_REF_80M_CLK_EN_M  (HP_SYS_CLKRST_REG_REF_80M_CLK_EN_V << HP_SYS_CLKRST_REG_REF_80M_CLK_EN_S)
#define HP_SYS_CLKRST_REG_REF_80M_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_REF_80M_CLK_EN_S  8
/** HP_SYS_CLKRST_REG_REF_80M_SEL : R/W; bitpos: [9]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_REF_80M_SEL    (BIT(9))
#define HP_SYS_CLKRST_REG_REF_80M_SEL_M  (HP_SYS_CLKRST_REG_REF_80M_SEL_V << HP_SYS_CLKRST_REG_REF_80M_SEL_S)
#define HP_SYS_CLKRST_REG_REF_80M_SEL_V  0x00000001U
#define HP_SYS_CLKRST_REG_REF_80M_SEL_S  9
/** HP_SYS_CLKRST_REG_REF_80M_MUX_CLK_EN : R/W; bitpos: [10]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_REF_80M_MUX_CLK_EN    (BIT(10))
#define HP_SYS_CLKRST_REG_REF_80M_MUX_CLK_EN_M  (HP_SYS_CLKRST_REG_REF_80M_MUX_CLK_EN_V << HP_SYS_CLKRST_REG_REF_80M_MUX_CLK_EN_S)
#define HP_SYS_CLKRST_REG_REF_80M_MUX_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_REF_80M_MUX_CLK_EN_S  10

/** HP_SYS_CLKRST_REF_60M_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_REF_60M_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x18c)
/** HP_SYS_CLKRST_REG_REF_60M_CLK_DIV_NUM : R/W; bitpos: [7:0]; default: 7;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_REF_60M_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_REF_60M_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_REF_60M_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_REF_60M_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_REF_60M_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_REF_60M_CLK_DIV_NUM_S  0
/** HP_SYS_CLKRST_REG_REF_60M_CLK_EN : R/W; bitpos: [8]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_REF_60M_CLK_EN    (BIT(8))
#define HP_SYS_CLKRST_REG_REF_60M_CLK_EN_M  (HP_SYS_CLKRST_REG_REF_60M_CLK_EN_V << HP_SYS_CLKRST_REG_REF_60M_CLK_EN_S)
#define HP_SYS_CLKRST_REG_REF_60M_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_REF_60M_CLK_EN_S  8

/** HP_SYS_CLKRST_REF_20M_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_REF_20M_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x190)
/** HP_SYS_CLKRST_REG_REF_20M_CLK_DIV_NUM : R/W; bitpos: [7:0]; default: 23;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_REF_20M_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_REF_20M_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_REF_20M_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_REF_20M_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_REF_20M_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_REF_20M_CLK_DIV_NUM_S  0
/** HP_SYS_CLKRST_REG_REF_20M_CLK_EN : R/W; bitpos: [8]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_REF_20M_CLK_EN    (BIT(8))
#define HP_SYS_CLKRST_REG_REF_20M_CLK_EN_M  (HP_SYS_CLKRST_REG_REF_20M_CLK_EN_V << HP_SYS_CLKRST_REG_REF_20M_CLK_EN_S)
#define HP_SYS_CLKRST_REG_REF_20M_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_REF_20M_CLK_EN_S  8

/** HP_SYS_CLKRST_REF_50M_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_REF_50M_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x194)
/** HP_SYS_CLKRST_REG_REF_50M_CLK_DIV_NUM : R/W; bitpos: [7:0]; default: 5;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_REF_50M_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_REF_50M_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_REF_50M_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_REF_50M_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_REF_50M_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_REF_50M_CLK_DIV_NUM_S  0
/** HP_SYS_CLKRST_REG_REF_50M_CLK_EN : R/W; bitpos: [8]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_REF_50M_CLK_EN    (BIT(8))
#define HP_SYS_CLKRST_REG_REF_50M_CLK_EN_M  (HP_SYS_CLKRST_REG_REF_50M_CLK_EN_V << HP_SYS_CLKRST_REG_REF_50M_CLK_EN_S)
#define HP_SYS_CLKRST_REG_REF_50M_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_REF_50M_CLK_EN_S  8

/** HP_SYS_CLKRST_REF_25M_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_REF_25M_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x198)
/** HP_SYS_CLKRST_REG_REF_25M_CLK_DIV_NUM : R/W; bitpos: [7:0]; default: 11;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_REF_25M_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_REF_25M_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_REF_25M_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_REF_25M_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_REF_25M_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_REF_25M_CLK_DIV_NUM_S  0
/** HP_SYS_CLKRST_REG_REF_25M_CLK_EN : R/W; bitpos: [8]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_REF_25M_CLK_EN    (BIT(8))
#define HP_SYS_CLKRST_REG_REF_25M_CLK_EN_M  (HP_SYS_CLKRST_REG_REF_25M_CLK_EN_V << HP_SYS_CLKRST_REG_REF_25M_CLK_EN_S)
#define HP_SYS_CLKRST_REG_REF_25M_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_REF_25M_CLK_EN_S  8

