espressif/esp-idf/components/soc/esp32s31/register/soc/hp_sys_clkrst_reg.h
/** HP_SYS_CLKRST_TM_CLK_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_TM_CLK_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x19c)
/** HP_SYS_CLKRST_REG_TM_480M_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TM_480M_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_TM_480M_CLK_EN_M  (HP_SYS_CLKRST_REG_TM_480M_CLK_EN_V << HP_SYS_CLKRST_REG_TM_480M_CLK_EN_S)
#define HP_SYS_CLKRST_REG_TM_480M_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TM_480M_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_TM_240M_CLK_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TM_240M_CLK_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_TM_240M_CLK_EN_M  (HP_SYS_CLKRST_REG_TM_240M_CLK_EN_V << HP_SYS_CLKRST_REG_TM_240M_CLK_EN_S)
#define HP_SYS_CLKRST_REG_TM_240M_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TM_240M_CLK_EN_S  1
/** HP_SYS_CLKRST_REG_TM_160M_CLK_EN : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TM_160M_CLK_EN    (BIT(2))
#define HP_SYS_CLKRST_REG_TM_160M_CLK_EN_M  (HP_SYS_CLKRST_REG_TM_160M_CLK_EN_V << HP_SYS_CLKRST_REG_TM_160M_CLK_EN_S)
#define HP_SYS_CLKRST_REG_TM_160M_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TM_160M_CLK_EN_S  2
/** HP_SYS_CLKRST_REG_TM_120M_CLK_EN : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TM_120M_CLK_EN    (BIT(3))
#define HP_SYS_CLKRST_REG_TM_120M_CLK_EN_M  (HP_SYS_CLKRST_REG_TM_120M_CLK_EN_V << HP_SYS_CLKRST_REG_TM_120M_CLK_EN_S)
#define HP_SYS_CLKRST_REG_TM_120M_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TM_120M_CLK_EN_S  3
/** HP_SYS_CLKRST_REG_TM_80M_CLK_EN : R/W; bitpos: [4]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TM_80M_CLK_EN    (BIT(4))
#define HP_SYS_CLKRST_REG_TM_80M_CLK_EN_M  (HP_SYS_CLKRST_REG_TM_80M_CLK_EN_V << HP_SYS_CLKRST_REG_TM_80M_CLK_EN_S)
#define HP_SYS_CLKRST_REG_TM_80M_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TM_80M_CLK_EN_S  4
/** HP_SYS_CLKRST_REG_TM_60M_CLK_EN : R/W; bitpos: [5]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TM_60M_CLK_EN    (BIT(5))
#define HP_SYS_CLKRST_REG_TM_60M_CLK_EN_M  (HP_SYS_CLKRST_REG_TM_60M_CLK_EN_V << HP_SYS_CLKRST_REG_TM_60M_CLK_EN_S)
#define HP_SYS_CLKRST_REG_TM_60M_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TM_60M_CLK_EN_S  5
/** HP_SYS_CLKRST_REG_TM_48M_CLK_EN : R/W; bitpos: [6]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TM_48M_CLK_EN    (BIT(6))
#define HP_SYS_CLKRST_REG_TM_48M_CLK_EN_M  (HP_SYS_CLKRST_REG_TM_48M_CLK_EN_V << HP_SYS_CLKRST_REG_TM_48M_CLK_EN_S)
#define HP_SYS_CLKRST_REG_TM_48M_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TM_48M_CLK_EN_S  6
/** HP_SYS_CLKRST_REG_TM_20M_CLK_EN : R/W; bitpos: [7]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TM_20M_CLK_EN    (BIT(7))
#define HP_SYS_CLKRST_REG_TM_20M_CLK_EN_M  (HP_SYS_CLKRST_REG_TM_20M_CLK_EN_V << HP_SYS_CLKRST_REG_TM_20M_CLK_EN_S)
#define HP_SYS_CLKRST_REG_TM_20M_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TM_20M_CLK_EN_S  7
/** HP_SYS_CLKRST_REG_TM_250M_CLK_EN : R/W; bitpos: [8]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_TM_250M_CLK_EN    (BIT(8))
#define HP_SYS_CLKRST_REG_TM_250M_CLK_EN_M  (HP_SYS_CLKRST_REG_TM_250M_CLK_EN_V << HP_SYS_CLKRST_REG_TM_250M_CLK_EN_S)
#define HP_SYS_CLKRST_REG_TM_250M_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_TM_250M_CLK_EN_S  8

/** HP_SYS_CLKRST_DBG0_CLK_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_DBG0_CLK_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x1a0)
/** HP_SYS_CLKRST_REG_DBG_CH0_SEL : R/W; bitpos: [7:0]; default: 255;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_DBG_CH0_SEL    0x000000FFU
#define HP_SYS_CLKRST_REG_DBG_CH0_SEL_M  (HP_SYS_CLKRST_REG_DBG_CH0_SEL_V << HP_SYS_CLKRST_REG_DBG_CH0_SEL_S)
#define HP_SYS_CLKRST_REG_DBG_CH0_SEL_V  0x000000FFU
#define HP_SYS_CLKRST_REG_DBG_CH0_SEL_S  0
/** HP_SYS_CLKRST_REG_DBG_CH0_DIV_NUM : R/W; bitpos: [15:8]; default: 3;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_DBG_CH0_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_DBG_CH0_DIV_NUM_M  (HP_SYS_CLKRST_REG_DBG_CH0_DIV_NUM_V << HP_SYS_CLKRST_REG_DBG_CH0_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_DBG_CH0_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_DBG_CH0_DIV_NUM_S  8
/** HP_SYS_CLKRST_REG_DBG_CH0_EN : R/W; bitpos: [16]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_DBG_CH0_EN    (BIT(16))
#define HP_SYS_CLKRST_REG_DBG_CH0_EN_M  (HP_SYS_CLKRST_REG_DBG_CH0_EN_V << HP_SYS_CLKRST_REG_DBG_CH0_EN_S)
#define HP_SYS_CLKRST_REG_DBG_CH0_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_DBG_CH0_EN_S  16

/** HP_SYS_CLKRST_DBG1_CLK_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_DBG1_CLK_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x1a4)
/** HP_SYS_CLKRST_REG_DBG_CH1_SEL : R/W; bitpos: [7:0]; default: 255;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_DBG_CH1_SEL    0x000000FFU
#define HP_SYS_CLKRST_REG_DBG_CH1_SEL_M  (HP_SYS_CLKRST_REG_DBG_CH1_SEL_V << HP_SYS_CLKRST_REG_DBG_CH1_SEL_S)
#define HP_SYS_CLKRST_REG_DBG_CH1_SEL_V  0x000000FFU
#define HP_SYS_CLKRST_REG_DBG_CH1_SEL_S  0
/** HP_SYS_CLKRST_REG_DBG_CH1_DIV_NUM : R/W; bitpos: [15:8]; default: 3;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_DBG_CH1_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_DBG_CH1_DIV_NUM_M  (HP_SYS_CLKRST_REG_DBG_CH1_DIV_NUM_V << HP_SYS_CLKRST_REG_DBG_CH1_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_DBG_CH1_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_DBG_CH1_DIV_NUM_S  8
/** HP_SYS_CLKRST_REG_DBG_CH1_EN : R/W; bitpos: [16]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_DBG_CH1_EN    (BIT(16))
#define HP_SYS_CLKRST_REG_DBG_CH1_EN_M  (HP_SYS_CLKRST_REG_DBG_CH1_EN_V << HP_SYS_CLKRST_REG_DBG_CH1_EN_S)
#define HP_SYS_CLKRST_REG_DBG_CH1_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_DBG_CH1_EN_S  16

/** HP_SYS_CLKRST_DBG2_CLK_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_DBG2_CLK_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x1a8)
/** HP_SYS_CLKRST_REG_DBG_CH2_SEL : R/W; bitpos: [7:0]; default: 255;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_DBG_CH2_SEL    0x000000FFU
#define HP_SYS_CLKRST_REG_DBG_CH2_SEL_M  (HP_SYS_CLKRST_REG_DBG_CH2_SEL_V << HP_SYS_CLKRST_REG_DBG_CH2_SEL_S)
#define HP_SYS_CLKRST_REG_DBG_CH2_SEL_V  0x000000FFU
#define HP_SYS_CLKRST_REG_DBG_CH2_SEL_S  0
/** HP_SYS_CLKRST_REG_DBG_CH2_DIV_NUM : R/W; bitpos: [15:8]; default: 3;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_DBG_CH2_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_DBG_CH2_DIV_NUM_M  (HP_SYS_CLKRST_REG_DBG_CH2_DIV_NUM_V << HP_SYS_CLKRST_REG_DBG_CH2_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_DBG_CH2_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_DBG_CH2_DIV_NUM_S  8
/** HP_SYS_CLKRST_REG_DBG_CH2_EN : R/W; bitpos: [16]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_DBG_CH2_EN    (BIT(16))
#define HP_SYS_CLKRST_REG_DBG_CH2_EN_M  (HP_SYS_CLKRST_REG_DBG_CH2_EN_V << HP_SYS_CLKRST_REG_DBG_CH2_EN_S)
#define HP_SYS_CLKRST_REG_DBG_CH2_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_DBG_CH2_EN_S  16

/** HP_SYS_CLKRST_LP_CLK_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_LP_CLK_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x1ac)
/** HP_SYS_CLKRST_REG_LPAON_FOSC_CLK_FORCE_ON : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_LPAON_FOSC_CLK_FORCE_ON    (BIT(0))
#define HP_SYS_CLKRST_REG_LPAON_FOSC_CLK_FORCE_ON_M  (HP_SYS_CLKRST_REG_LPAON_FOSC_CLK_FORCE_ON_V << HP_SYS_CLKRST_REG_LPAON_FOSC_CLK_FORCE_ON_S)
#define HP_SYS_CLKRST_REG_LPAON_FOSC_CLK_FORCE_ON_V  0x00000001U
#define HP_SYS_CLKRST_REG_LPAON_FOSC_CLK_FORCE_ON_S  0
/** HP_SYS_CLKRST_REG_LPAON_XTAL_CLK_FORCE_ON : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_LPAON_XTAL_CLK_FORCE_ON    (BIT(1))
#define HP_SYS_CLKRST_REG_LPAON_XTAL_CLK_FORCE_ON_M  (HP_SYS_CLKRST_REG_LPAON_XTAL_CLK_FORCE_ON_V << HP_SYS_CLKRST_REG_LPAON_XTAL_CLK_FORCE_ON_S)
#define HP_SYS_CLKRST_REG_LPAON_XTAL_CLK_FORCE_ON_V  0x00000001U
#define HP_SYS_CLKRST_REG_LPAON_XTAL_CLK_FORCE_ON_S  1
/** HP_SYS_CLKRST_REG_LPAON_PLL80M_CLK_FORCE_ON : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_LPAON_PLL80M_CLK_FORCE_ON    (BIT(2))
#define HP_SYS_CLKRST_REG_LPAON_PLL80M_CLK_FORCE_ON_M  (HP_SYS_CLKRST_REG_LPAON_PLL80M_CLK_FORCE_ON_V << HP_SYS_CLKRST_REG_LPAON_PLL80M_CLK_FORCE_ON_S)
#define HP_SYS_CLKRST_REG_LPAON_PLL80M_CLK_FORCE_ON_V  0x00000001U
#define HP_SYS_CLKRST_REG_LPAON_PLL80M_CLK_FORCE_ON_S  2

/** HP_SYS_CLKRST_AHB_ASRC_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_AHB_ASRC_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x1b0)
/** HP_SYS_CLKRST_REG_AHB_ASRC_SYS_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_AHB_ASRC_SYS_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_AHB_ASRC_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_AHB_ASRC_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_AHB_ASRC_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_AHB_ASRC_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_AHB_ASRC_SYS_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_AHB_ASRC_RST_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_AHB_ASRC_RST_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_AHB_ASRC_RST_EN_M  (HP_SYS_CLKRST_REG_AHB_ASRC_RST_EN_V << HP_SYS_CLKRST_REG_AHB_ASRC_RST_EN_S)
#define HP_SYS_CLKRST_REG_AHB_ASRC_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_AHB_ASRC_RST_EN_S  1
/** HP_SYS_CLKRST_REG_AHB_ASRC_FORCE_NORST : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_AHB_ASRC_FORCE_NORST    (BIT(2))
#define HP_SYS_CLKRST_REG_AHB_ASRC_FORCE_NORST_M  (HP_SYS_CLKRST_REG_AHB_ASRC_FORCE_NORST_V << HP_SYS_CLKRST_REG_AHB_ASRC_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_AHB_ASRC_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_AHB_ASRC_FORCE_NORST_S  2

/** HP_SYS_CLKRST_CORDIC_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_CORDIC_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x1b4)
/** HP_SYS_CLKRST_REG_CORDIC_APB_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CORDIC_APB_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_CORDIC_APB_CLK_EN_M  (HP_SYS_CLKRST_REG_CORDIC_APB_CLK_EN_V << HP_SYS_CLKRST_REG_CORDIC_APB_CLK_EN_S)
#define HP_SYS_CLKRST_REG_CORDIC_APB_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CORDIC_APB_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_CORDIC_APB_RST_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CORDIC_APB_RST_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_CORDIC_APB_RST_EN_M  (HP_SYS_CLKRST_REG_CORDIC_APB_RST_EN_V << HP_SYS_CLKRST_REG_CORDIC_APB_RST_EN_S)
#define HP_SYS_CLKRST_REG_CORDIC_APB_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CORDIC_APB_RST_EN_S  1
/** HP_SYS_CLKRST_REG_CORDIC_SYS_CLK_EN : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CORDIC_SYS_CLK_EN    (BIT(2))
#define HP_SYS_CLKRST_REG_CORDIC_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_CORDIC_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_CORDIC_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_CORDIC_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CORDIC_SYS_CLK_EN_S  2
/** HP_SYS_CLKRST_REG_CORDIC_SYS_RST_EN : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CORDIC_SYS_RST_EN    (BIT(3))
#define HP_SYS_CLKRST_REG_CORDIC_SYS_RST_EN_M  (HP_SYS_CLKRST_REG_CORDIC_SYS_RST_EN_V << HP_SYS_CLKRST_REG_CORDIC_SYS_RST_EN_S)
#define HP_SYS_CLKRST_REG_CORDIC_SYS_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CORDIC_SYS_RST_EN_S  3
/** HP_SYS_CLKRST_REG_CORDIC_CLK_EN : R/W; bitpos: [4]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CORDIC_CLK_EN    (BIT(4))
#define HP_SYS_CLKRST_REG_CORDIC_CLK_EN_M  (HP_SYS_CLKRST_REG_CORDIC_CLK_EN_V << HP_SYS_CLKRST_REG_CORDIC_CLK_EN_S)
#define HP_SYS_CLKRST_REG_CORDIC_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CORDIC_CLK_EN_S  4
/** HP_SYS_CLKRST_REG_CORDIC_CORE_RST_EN : R/W; bitpos: [5]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CORDIC_CORE_RST_EN    (BIT(5))
#define HP_SYS_CLKRST_REG_CORDIC_CORE_RST_EN_M  (HP_SYS_CLKRST_REG_CORDIC_CORE_RST_EN_V << HP_SYS_CLKRST_REG_CORDIC_CORE_RST_EN_S)
#define HP_SYS_CLKRST_REG_CORDIC_CORE_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CORDIC_CORE_RST_EN_S  5
/** HP_SYS_CLKRST_REG_CORDIC_FORCE_NORST : R/W; bitpos: [6]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CORDIC_FORCE_NORST    (BIT(6))
#define HP_SYS_CLKRST_REG_CORDIC_FORCE_NORST_M  (HP_SYS_CLKRST_REG_CORDIC_FORCE_NORST_V << HP_SYS_CLKRST_REG_CORDIC_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_CORDIC_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_CORDIC_FORCE_NORST_S  6
/** HP_SYS_CLKRST_REG_CORDIC_CLK_SRC_SEL : R/W; bitpos: [8:7]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CORDIC_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_CORDIC_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_CORDIC_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_CORDIC_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_CORDIC_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_CORDIC_CLK_SRC_SEL_S  7

/** HP_SYS_CLKRST_ZERO_DET_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_ZERO_DET_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x1b8)
/** HP_SYS_CLKRST_REG_ZERO_DET_APB_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_ZERO_DET_APB_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_ZERO_DET_APB_CLK_EN_M  (HP_SYS_CLKRST_REG_ZERO_DET_APB_CLK_EN_V << HP_SYS_CLKRST_REG_ZERO_DET_APB_CLK_EN_S)
#define HP_SYS_CLKRST_REG_ZERO_DET_APB_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_ZERO_DET_APB_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_ZERO_DET_APB_RST_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_ZERO_DET_APB_RST_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_ZERO_DET_APB_RST_EN_M  (HP_SYS_CLKRST_REG_ZERO_DET_APB_RST_EN_V << HP_SYS_CLKRST_REG_ZERO_DET_APB_RST_EN_S)
#define HP_SYS_CLKRST_REG_ZERO_DET_APB_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_ZERO_DET_APB_RST_EN_S  1
/** HP_SYS_CLKRST_REG_ZERO_DET_CLK_EN : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_ZERO_DET_CLK_EN    (BIT(2))
#define HP_SYS_CLKRST_REG_ZERO_DET_CLK_EN_M  (HP_SYS_CLKRST_REG_ZERO_DET_CLK_EN_V << HP_SYS_CLKRST_REG_ZERO_DET_CLK_EN_S)
#define HP_SYS_CLKRST_REG_ZERO_DET_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_ZERO_DET_CLK_EN_S  2
/** HP_SYS_CLKRST_REG_ZERO_DET_CORE_RST_EN : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_ZERO_DET_CORE_RST_EN    (BIT(3))
#define HP_SYS_CLKRST_REG_ZERO_DET_CORE_RST_EN_M  (HP_SYS_CLKRST_REG_ZERO_DET_CORE_RST_EN_V << HP_SYS_CLKRST_REG_ZERO_DET_CORE_RST_EN_S)
#define HP_SYS_CLKRST_REG_ZERO_DET_CORE_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_ZERO_DET_CORE_RST_EN_S  3
/** HP_SYS_CLKRST_REG_ZERO_DET_FORCE_NORST : R/W; bitpos: [4]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_ZERO_DET_FORCE_NORST    (BIT(4))
#define HP_SYS_CLKRST_REG_ZERO_DET_FORCE_NORST_M  (HP_SYS_CLKRST_REG_ZERO_DET_FORCE_NORST_V << HP_SYS_CLKRST_REG_ZERO_DET_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_ZERO_DET_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_ZERO_DET_FORCE_NORST_S  4
/** HP_SYS_CLKRST_REG_ZERO_DET_CLK_SRC_SEL : R/W; bitpos: [6:5]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_ZERO_DET_CLK_SRC_SEL    0x00000003U
#define HP_SYS_CLKRST_REG_ZERO_DET_CLK_SRC_SEL_M  (HP_SYS_CLKRST_REG_ZERO_DET_CLK_SRC_SEL_V << HP_SYS_CLKRST_REG_ZERO_DET_CLK_SRC_SEL_S)
#define HP_SYS_CLKRST_REG_ZERO_DET_CLK_SRC_SEL_V  0x00000003U
#define HP_SYS_CLKRST_REG_ZERO_DET_CLK_SRC_SEL_S  5
/** HP_SYS_CLKRST_REG_ZERO_DET_CLK_DIV_NUM : R/W; bitpos: [14:7]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_ZERO_DET_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_ZERO_DET_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_ZERO_DET_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_ZERO_DET_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_ZERO_DET_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_ZERO_DET_CLK_DIV_NUM_S  7

/** HP_SYS_CLKRST_CORDIC_CTRL1_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_CORDIC_CTRL1_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x1bc)
/** HP_SYS_CLKRST_REG_CORDIC_CLK_DIV_NUM : R/W; bitpos: [7:0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CORDIC_CLK_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_CORDIC_CLK_DIV_NUM_M  (HP_SYS_CLKRST_REG_CORDIC_CLK_DIV_NUM_V << HP_SYS_CLKRST_REG_CORDIC_CLK_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_CORDIC_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_CORDIC_CLK_DIV_NUM_S  0
/** HP_SYS_CLKRST_REG_CORDIC_CLK_DIV_NUMERATOR : R/W; bitpos: [15:8]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CORDIC_CLK_DIV_NUMERATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_CORDIC_CLK_DIV_NUMERATOR_M  (HP_SYS_CLKRST_REG_CORDIC_CLK_DIV_NUMERATOR_V << HP_SYS_CLKRST_REG_CORDIC_CLK_DIV_NUMERATOR_S)
#define HP_SYS_CLKRST_REG_CORDIC_CLK_DIV_NUMERATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_CORDIC_CLK_DIV_NUMERATOR_S  8
/** HP_SYS_CLKRST_REG_CORDIC_CLK_DIV_DENONIMATOR : R/W; bitpos: [23:16]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CORDIC_CLK_DIV_DENONIMATOR    0x000000FFU
#define HP_SYS_CLKRST_REG_CORDIC_CLK_DIV_DENONIMATOR_M  (HP_SYS_CLKRST_REG_CORDIC_CLK_DIV_DENONIMATOR_V << HP_SYS_CLKRST_REG_CORDIC_CLK_DIV_DENONIMATOR_S)
#define HP_SYS_CLKRST_REG_CORDIC_CLK_DIV_DENONIMATOR_V  0x000000FFU
#define HP_SYS_CLKRST_REG_CORDIC_CLK_DIV_DENONIMATOR_S  16

