espressif/esp-idf/components/soc/esp32s31/register/soc/hp_sys_clkrst_reg.h
/** HP_SYS_CLKRST_CLK_PWR_DECREASE_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_CLK_PWR_DECREASE_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x1c8)
/** HP_SYS_CLKRST_REG_APB_HW_DECREASE_DIV_NUM : R/W; bitpos: [7:0]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_APB_HW_DECREASE_DIV_NUM    0x000000FFU
#define HP_SYS_CLKRST_REG_APB_HW_DECREASE_DIV_NUM_M  (HP_SYS_CLKRST_REG_APB_HW_DECREASE_DIV_NUM_V << HP_SYS_CLKRST_REG_APB_HW_DECREASE_DIV_NUM_S)
#define HP_SYS_CLKRST_REG_APB_HW_DECREASE_DIV_NUM_V  0x000000FFU
#define HP_SYS_CLKRST_REG_APB_HW_DECREASE_DIV_NUM_S  0
/** HP_SYS_CLKRST_REG_CPU_WFI_DECREASE_EN : R/W; bitpos: [8]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CPU_WFI_DECREASE_EN    (BIT(8))
#define HP_SYS_CLKRST_REG_CPU_WFI_DECREASE_EN_M  (HP_SYS_CLKRST_REG_CPU_WFI_DECREASE_EN_V << HP_SYS_CLKRST_REG_CPU_WFI_DECREASE_EN_S)
#define HP_SYS_CLKRST_REG_CPU_WFI_DECREASE_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CPU_WFI_DECREASE_EN_S  8

/** HP_SYS_CLKRST_CNNT_IOMUX_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_CNNT_IOMUX_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x1cc)
/** HP_SYS_CLKRST_REG_CNNT_IOMUX_APB_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  cnnt_iomux clk en
 */
#define HP_SYS_CLKRST_REG_CNNT_IOMUX_APB_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_CNNT_IOMUX_APB_CLK_EN_M  (HP_SYS_CLKRST_REG_CNNT_IOMUX_APB_CLK_EN_V << HP_SYS_CLKRST_REG_CNNT_IOMUX_APB_CLK_EN_S)
#define HP_SYS_CLKRST_REG_CNNT_IOMUX_APB_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CNNT_IOMUX_APB_CLK_EN_S  0

/** HP_SYS_CLKRST_HP_I2CMST_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_HP_I2CMST_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x1d0)
/** HP_SYS_CLKRST_REG_HP_I2CMST_APB_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_HP_I2CMST_APB_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_HP_I2CMST_APB_CLK_EN_M  (HP_SYS_CLKRST_REG_HP_I2CMST_APB_CLK_EN_V << HP_SYS_CLKRST_REG_HP_I2CMST_APB_CLK_EN_S)
#define HP_SYS_CLKRST_REG_HP_I2CMST_APB_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_HP_I2CMST_APB_CLK_EN_S  0
/** HP_SYS_CLKRST_REG_HP_I2CMST_RST_EN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_HP_I2CMST_RST_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_HP_I2CMST_RST_EN_M  (HP_SYS_CLKRST_REG_HP_I2CMST_RST_EN_V << HP_SYS_CLKRST_REG_HP_I2CMST_RST_EN_S)
#define HP_SYS_CLKRST_REG_HP_I2CMST_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_HP_I2CMST_RST_EN_S  1
/** HP_SYS_CLKRST_REG_HP_I2CMST_FORCE_NORST : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_HP_I2CMST_FORCE_NORST    (BIT(2))
#define HP_SYS_CLKRST_REG_HP_I2CMST_FORCE_NORST_M  (HP_SYS_CLKRST_REG_HP_I2CMST_FORCE_NORST_V << HP_SYS_CLKRST_REG_HP_I2CMST_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_HP_I2CMST_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_HP_I2CMST_FORCE_NORST_S  2

/** HP_SYS_CLKRST_AXI_PERF_MON_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_AXI_PERF_MON_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x1d4)
/** HP_SYS_CLKRST_REG_AXI_PERF_MON_RST_EN : R/W; bitpos: [0]; default: 0;
 *  axi_perf_mon rst en
 */
#define HP_SYS_CLKRST_REG_AXI_PERF_MON_RST_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_AXI_PERF_MON_RST_EN_M  (HP_SYS_CLKRST_REG_AXI_PERF_MON_RST_EN_V << HP_SYS_CLKRST_REG_AXI_PERF_MON_RST_EN_S)
#define HP_SYS_CLKRST_REG_AXI_PERF_MON_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_AXI_PERF_MON_RST_EN_S  0
/** HP_SYS_CLKRST_REG_AXI_PERF_MON_CLK_EN : R/W; bitpos: [1]; default: 0;
 *  axi_perf_mon clk en
 */
#define HP_SYS_CLKRST_REG_AXI_PERF_MON_CLK_EN    (BIT(1))
#define HP_SYS_CLKRST_REG_AXI_PERF_MON_CLK_EN_M  (HP_SYS_CLKRST_REG_AXI_PERF_MON_CLK_EN_V << HP_SYS_CLKRST_REG_AXI_PERF_MON_CLK_EN_S)
#define HP_SYS_CLKRST_REG_AXI_PERF_MON_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_AXI_PERF_MON_CLK_EN_S  1
/** HP_SYS_CLKRST_REG_AXI_PERF_MON_FORCE_NORST : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_AXI_PERF_MON_FORCE_NORST    (BIT(2))
#define HP_SYS_CLKRST_REG_AXI_PERF_MON_FORCE_NORST_M  (HP_SYS_CLKRST_REG_AXI_PERF_MON_FORCE_NORST_V << HP_SYS_CLKRST_REG_AXI_PERF_MON_FORCE_NORST_S)
#define HP_SYS_CLKRST_REG_AXI_PERF_MON_FORCE_NORST_V  0x00000001U
#define HP_SYS_CLKRST_REG_AXI_PERF_MON_FORCE_NORST_S  2

/** HP_SYS_CLKRST_CNNT_SYSREG_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_CNNT_SYSREG_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x1d8)
/** HP_SYS_CLKRST_REG_CNNT_SYSREG_SYS_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  cnnt_sysreg clk en
 */
#define HP_SYS_CLKRST_REG_CNNT_SYSREG_SYS_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_CNNT_SYSREG_SYS_CLK_EN_M  (HP_SYS_CLKRST_REG_CNNT_SYSREG_SYS_CLK_EN_V << HP_SYS_CLKRST_REG_CNNT_SYSREG_SYS_CLK_EN_S)
#define HP_SYS_CLKRST_REG_CNNT_SYSREG_SYS_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CNNT_SYSREG_SYS_CLK_EN_S  0

/** HP_SYS_CLKRST_HP_ALIVE_SYSREG_CTRL0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_HP_ALIVE_SYSREG_CTRL0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x1dc)
/** HP_SYS_CLKRST_REG_HP_ALIVE_SYSREG_APB_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  hp alive_sysreg clk en
 */
#define HP_SYS_CLKRST_REG_HP_ALIVE_SYSREG_APB_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_HP_ALIVE_SYSREG_APB_CLK_EN_M  (HP_SYS_CLKRST_REG_HP_ALIVE_SYSREG_APB_CLK_EN_V << HP_SYS_CLKRST_REG_HP_ALIVE_SYSREG_APB_CLK_EN_S)
#define HP_SYS_CLKRST_REG_HP_ALIVE_SYSREG_APB_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_HP_ALIVE_SYSREG_APB_CLK_EN_S  0

/** HP_SYS_CLKRST_MODEM_CONF_REG register
 *  MODEM_APB configuration register
 */
#define HP_SYS_CLKRST_MODEM_CONF_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x1e0)
/** HP_SYS_CLKRST_MODEM_APB_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  This field indicates if modem_apb clock is enable. 0: disable, 1: enable(default).
 */
#define HP_SYS_CLKRST_MODEM_APB_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_MODEM_APB_CLK_EN_M  (HP_SYS_CLKRST_MODEM_APB_CLK_EN_V << HP_SYS_CLKRST_MODEM_APB_CLK_EN_S)
#define HP_SYS_CLKRST_MODEM_APB_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_MODEM_APB_CLK_EN_S  0
/** HP_SYS_CLKRST_MODEM_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set this file as 1 to reset modem-subsystem.
 */
#define HP_SYS_CLKRST_MODEM_RST_EN    (BIT(1))
#define HP_SYS_CLKRST_MODEM_RST_EN_M  (HP_SYS_CLKRST_MODEM_RST_EN_V << HP_SYS_CLKRST_MODEM_RST_EN_S)
#define HP_SYS_CLKRST_MODEM_RST_EN_V  0x00000001U
#define HP_SYS_CLKRST_MODEM_RST_EN_S  1
/** HP_SYS_CLKRST_MODEM_CLK_EN : R/W; bitpos: [2]; default: 1;
 *  This field indicates if modem source clock is enable. 0: disable, 1:
 *  enable(default).
 */
#define HP_SYS_CLKRST_MODEM_CLK_EN    (BIT(2))
#define HP_SYS_CLKRST_MODEM_CLK_EN_M  (HP_SYS_CLKRST_MODEM_CLK_EN_V << HP_SYS_CLKRST_MODEM_CLK_EN_S)
#define HP_SYS_CLKRST_MODEM_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_MODEM_CLK_EN_S  2
/** HP_SYS_CLKRST_MODEM_CLK_SOURCE_SEL : R/W; bitpos: [3]; default: 0;
 *  modem clk source sel
 */
#define HP_SYS_CLKRST_MODEM_CLK_SOURCE_SEL    (BIT(3))
#define HP_SYS_CLKRST_MODEM_CLK_SOURCE_SEL_M  (HP_SYS_CLKRST_MODEM_CLK_SOURCE_SEL_V << HP_SYS_CLKRST_MODEM_CLK_SOURCE_SEL_S)
#define HP_SYS_CLKRST_MODEM_CLK_SOURCE_SEL_V  0x00000001U
#define HP_SYS_CLKRST_MODEM_CLK_SOURCE_SEL_S  3
/** HP_SYS_CLKRST_MODEM_PLL_CLK_EN : R/W; bitpos: [4]; default: 0;
 *  modem clk source pll on
 */
#define HP_SYS_CLKRST_MODEM_PLL_CLK_EN    (BIT(4))
#define HP_SYS_CLKRST_MODEM_PLL_CLK_EN_M  (HP_SYS_CLKRST_MODEM_PLL_CLK_EN_V << HP_SYS_CLKRST_MODEM_PLL_CLK_EN_S)
#define HP_SYS_CLKRST_MODEM_PLL_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_MODEM_PLL_CLK_EN_S  4
/** HP_SYS_CLKRST_MODEM_XTAL_CLK_EN : R/W; bitpos: [5]; default: 1;
 *  modem clk source xtal on
 */
#define HP_SYS_CLKRST_MODEM_XTAL_CLK_EN    (BIT(5))
#define HP_SYS_CLKRST_MODEM_XTAL_CLK_EN_M  (HP_SYS_CLKRST_MODEM_XTAL_CLK_EN_V << HP_SYS_CLKRST_MODEM_XTAL_CLK_EN_S)
#define HP_SYS_CLKRST_MODEM_XTAL_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_MODEM_XTAL_CLK_EN_S  5

/** HP_SYS_CLKRST_CLK_EN0_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_CLK_EN0_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x1f8)
/** HP_SYS_CLKRST_REG_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  need_des
 */
#define HP_SYS_CLKRST_REG_CLK_EN    (BIT(0))
#define HP_SYS_CLKRST_REG_CLK_EN_M  (HP_SYS_CLKRST_REG_CLK_EN_V << HP_SYS_CLKRST_REG_CLK_EN_S)
#define HP_SYS_CLKRST_REG_CLK_EN_V  0x00000001U
#define HP_SYS_CLKRST_REG_CLK_EN_S  0

/** HP_SYS_CLKRST_DATE_REG register
 *  need_des
 */
#define HP_SYS_CLKRST_DATE_REG (DR_REG_HP_SYS_CLKRST_BASE + 0x1fc)
/** HP_SYS_CLKRST_REG_DATE : R/W; bitpos: [27:0]; default: 38834448;
 *  Version control register
 */
#define HP_SYS_CLKRST_REG_DATE    0x0FFFFFFFU
#define HP_SYS_CLKRST_REG_DATE_M  (HP_SYS_CLKRST_REG_DATE_V << HP_SYS_CLKRST_REG_DATE_S)
#define HP_SYS_CLKRST_REG_DATE_V  0x0FFFFFFFU
#define HP_SYS_CLKRST_REG_DATE_S  0

#ifdef __cplusplus
}
#endif
